{
  "blocks_definition": [
    {"block": 1, "theme": "Combat & Basic Keywords", "focus": "Fundamentals of damage and common keywords."},
    {"block": 2, "theme": "The Stack & Spell Interaction", "focus": "LIFO order, counterspells, and independence of abilities."},
    {"block": 3, "theme": "Targets & Triggers", "focus": "Legal targets, ward, and ETB/LTB triggers."},
    {"block": 4, "theme": "Resources & Mana", "focus": "Mana pool, land types, and cost taxes."},
    {"block": 5, "theme": "State-Based Actions (SBA)", "focus": "Legend rule, 0 toughness, and game loss conditions."},
    {"block": 6, "theme": "Replacement Effects & Control", "focus": "Instead effects and continuous control changes."},
    {"block": 7, "theme": "Commander & Multiplayer", "focus": "Color identity, commander tax, and command zone rules."},
    {"block": 8, "theme": "Copies & Transformations", "focus": "Copyable values, morph, and double-faced cards."},
    {"block": 9, "theme": "Costs & X Spells", "focus": "Mana value on stack vs other zones and cost calculation."},
    {"block": 10, "theme": "Elite Interactions (Pro Level)", "focus": "Layers, complex dependencies, and timestamp logic."}
  ],
    "questions": [
    {
        "id": 1,
        "difficulty": "Easy",
        "category": "Keywords",
        "question": "If I attack with a creature with [[Lifelink]] and my opponent blocks with a 1/1, do I still gain life equal to my creature's power?",
        "ground_truth": "Yes. Lifelink causes you to gain life equal to the damage dealt. Even if the blocker has only 1 toughness, your creature deals damage equal to its full power during the combat damage step."
    },
    {
        "id": 2,
        "difficulty": "Easy",
        "category": "Keywords",
        "question": "Can a creature with [[Flying]] be blocked by a creature with [[Reach]]?",
        "ground_truth": "Yes. Reach is a keyword specifically designed to allow creatures to block attackers with Flying as if the blocker also had Flying."
    },
    {
        "id": 3,
        "difficulty": "Easy",
        "category": "Keywords",
        "question": "If my creature has [[Vigilance]], does it still tap to activate an ability with the {T} symbol after it has attacked?",
        "ground_truth": "Yes. Vigilance means the creature does not tap to attack. Since it remains untapped after the declare attackers step, it is available to be tapped for other abilities later."
    },
    {
        "id": 4,
        "difficulty": "Easy",
        "category": "Keywords",
        "question": "Does [[Ward 2]] counter a spell if the opponent doesn't pay the {2} mana?",
        "ground_truth": "Yes. Ward is a triggered ability. When the creature becomes the target of a spell or ability an opponent controls, that spell/ability is countered unless the player pays the cost."
    },
    {
        "id": 5,
        "difficulty": "Medium",
        "category": "Keywords",
        "question": "If I attack with a creature with [[Deathtouch]] and [[Trample]], and it is blocked, how much damage do I need to assign to the blocker?",
        "ground_truth": "You only need to assign 1 point of damage to the blocker. Because of Deathtouch, any amount of damage is considered lethal. The rest of the damage can 'trample' over to the defending player."
    },
    {
        "id": 6,
        "difficulty": "Easy",
        "category": "Keywords",
        "question": "Can a creature with [[Haste]] activate an ability with a {T} symbol the turn it comes into play?",
        "ground_truth": "Yes. Haste removes the restriction that prevents a creature from attacking or using tap abilities until you have controlled it since the beginning of your most recent turn."
    },
    {
        "id": 7,
        "difficulty": "Medium",
        "category": "Turn Structure",
        "question": "Can I cast a creature spell during my opponent's end step if it does not have [[Flash]]?",
        "ground_truth": "No. Without Flash, creatures can only be cast during your own main phases when the stack is empty."
    },
    {
        "id": 8,
        "difficulty": "Easy",
        "category": "Keywords",
        "question": "If my creature has [[First Strike]] and my opponent's creature doesn't, and my creature's power is enough to kill theirs, does my creature take any damage?",
        "ground_truth": "No. Your creature deals damage in the first strike damage step. If the opponent's creature dies there, it won't be around to deal damage in the regular combat damage step."
    },
    {
        "id": 9,
        "difficulty": "Medium",
        "category": "Keywords",
        "question": "If a creature has [[Indestructible]], does it die if its toughness is reduced to 0 by an effect like [[Toxic Deluge]]?",
        "ground_truth": "Yes. Indestructible only prevents destruction (from damage or 'destroy' effects). Having 0 toughness is a state-based action that puts the creature into the graveyard, which is not destruction."
    },
    {
        "id": 10,
        "difficulty": "Easy",
        "category": "Keywords",
        "question": "If I have [[Double Strike]], do I get two triggers for an ability that says 'Whenever this creature deals combat damage'?",
        "ground_truth": "Yes. The creature deals damage in two separate steps (first strike and regular), so the ability will trigger twice, once for each time it deals damage."
    },
    {
        "id": 11,
        "difficulty": "Medium",
        "category": "Stack",
        "question": "I cast [[Lightning Bolt]] on my opponent's 3/3. In response, they cast a spell to give it +1/+1. Does the creature die?",
        "ground_truth": "No. The stack is 'Last-In, First-Out'. The +1/+1 spell resolves first, making the creature a 4/4. Then the Bolt deals 3 damage, which is no longer enough to kill it."
    },
    {
        "id": 12,
        "difficulty": "Medium",
        "category": "Stack",
        "question": "If I cast a spell and my opponent casts [[Counterspell]], and then I cast another [[Counterspell]] targeting theirs, does my original spell resolve?",
        "ground_truth": "Yes. Your Counterspell resolves first, removing the opponent's Counterspell from the stack. Then, your original spell is next on the stack and will resolve normally."
    },
    {
        "id": 13,
        "difficulty": "Hard",
        "category": "Axioms / Stack",
        "question": "I activate [[The One Ring]] to draw cards. My opponent casts [[Vandalblast]] to destroy it in response. Do I still draw the cards?",
        "ground_truth": "Yes. Once an ability is on the stack, it is independent of its source (Axiom 3). The ability will resolve using Last Known Information (LKI) about the counters on the Ring."
    },
    {
        "id": 14,
        "difficulty": "Medium",
        "category": "Triggers",
        "question": "My opponent has [[Sheoldred, the Apocalypse]]. I cast [[Brainstorm]]. When do I lose the 6 life?",
        "ground_truth": "You lose the life after Brainstorm finishes resolving. Each card drawn triggers Sheoldred, but those triggers wait until the current spell is completely finished before being put on the stack."
    },
    {
        "id": 15,
        "difficulty": "Medium",
        "category": "Targets",
        "question": "Can I cast [[Fatal Push]] on a creature with [[Protection from Black]]?",
        "ground_truth": "No. Protection prevents targeting. Since Fatal Push requires a 'target creature', a creature with protection from black is not a legal target for it."
    },
    {
        "id": 16,
        "difficulty": "Hard",
        "category": "Axioms / LKI",
        "question": "I sacrifice [[Manglehorn]] to its own ability to destroy an artifact. If Manglehorn is in the graveyard, does the ability still work?",
        "ground_truth": "Yes. Abilities on the stack do not care if the source is still on the battlefield. The ability will resolve and destroy the targeted artifact."
    },
    {
        "id": 17,
        "difficulty": "Medium",
        "category": "Stack",
        "question": "If I cast a spell with [[Split Second]], can my opponent activate a mana ability in response?",
        "ground_truth": "Yes. Split Second prevents spells and non-mana abilities from being activated. Mana abilities (like tapping a land) do not use the stack and can still be used."
    },
    {
        "id": 18,
        "difficulty": "Hard",
        "category": "Triggers",
        "question": "I control [[Elesh Norn, Mother of Machines]] and an opponent's creature with an ETB ability enters the battlefield. Does it trigger?",
        "ground_truth": "No. Elesh Norn's second ability specifically states that permanents entering the battlefield don't cause abilities of permanents your opponents control to trigger."
    },
    {
        "id": 19,
        "difficulty": "Medium",
        "category": "Stack",
        "question": "What happens if a spell on the stack has its only target removed before it resolves?",
        "ground_truth": "The spell is 'fizzled' (removed from the stack by the game rules). None of its effects happen, not even the ones that don't depend on the target (like drawing a card)."
    },
    {
        "id": 20,
        "difficulty": "Hard",
        "category": "Costs",
        "question": "If I have [[Thalia, Guardian of Thraben]] and I want to cast a spell for its [[Overload]] cost, do I still pay the extra {1}?",
        "ground_truth": "Yes. First you choose the base cost (Overload), then you apply any cost increases (Thalia), then any cost reductions. The {1} tax from Thalia is added to the Overload cost."
    },
    {
        "id": 21,
        "difficulty": "Medium",
        "category": "Targets",
        "question": "I cast [[Decimate]] targeting four legal targets. In response, my opponent hexproofs one of them. Does the spell still resolve?",
        "ground_truth": "Yes. A spell with multiple targets only fails to resolve if ALL of its targets become illegal. Since three targets are still legal, Decimate will destroy those three."
    },
    {
        "id": 22,
        "difficulty": "Easy",
        "category": "Keywords",
        "question": "Can I target a creature with [[Protection from Black]] using an ability from a black artifact?",
        "ground_truth": "No. Protection from black prevents the creature from being Targeted, Enchanted/Equipped, Blocked, or Damaged (DEBT) by anything black, regardless of whether it is an artifact or a spell."
    },
    {
        "id": 23,
        "difficulty": "Medium",
        "category": "Stack",
        "question": "If I cast [[Ancestral Recall]] and my opponent responds with [[Misdirection]], can they make me draw the cards instead of them?",
        "ground_truth": "No. Ancestral Recall targets a 'player'. Misdirection can change the target to any legal player. Your opponent can choose themselves as the target, making them draw the cards."
    },
    {
        "id": 24,
        "difficulty": "Hard",
        "category": "Copying",
        "question": "I cast [[Fork]] targeting my opponent's [[Lightning Bolt]]. If the original Bolt is countered, what happens to the Fork?",
        "ground_truth": "Fork will fail to resolve (fizzle) because its only target (the Bolt on the stack) is no longer there. You do not get a copy of the spell."
    },
    {
        "id": 25,
        "difficulty": "Medium",
        "category": "Flash",
        "question": "Can I cast a creature with [[Flash]] in response to my opponent's land play?",
        "ground_truth": "No. Playing a land is a special action that does not use the stack. You do not receive priority while a land is being played, only after it has entered the battlefield."
    },
    {
        "id": 26,
        "difficulty": "Easy",
        "category": "Keywords",
        "question": "If my creature has [[Haste]], can I use an ability with the tap symbol the same turn it enters?",
        "ground_truth": "Yes. Haste allows a creature to attack and to use abilities with the tap or untap symbol even if you haven't controlled it since the beginning of your most recent turn."
    },
    {
        "id": 27,
        "difficulty": "Hard",
        "category": "Replacement Effects",
        "question": "I have [[Hardened Scales]] in play and I cast a creature that enters with two +1/+1 counters. How many counters does it actually get?",
        "ground_truth": "It enters with three counters. Hardened Scales is a replacement effect that modifies the event of 'placing one or more counters' by adding one additional counter."
    },
    {
        "id": 28,
        "difficulty": "Medium",
        "category": "Costs",
        "question": "If I cast a spell for its [[Flashback]] cost, where does it go after it leaves the stack?",
        "ground_truth": "It is exiled. The Flashback keyword explicitly states that if the spell would leave the stack, it is exiled instead of going anywhere else."
    },
    {
        "id": 29,
        "difficulty": "Medium",
        "category": "Combat",
        "question": "I block a 5/5 creature with a 1/1. Before damage, I use [[Ninjustu]] to return the 1/1 to my hand. What happens to the 5/5?",
        "ground_truth": "The 5/5 is still considered 'blocked'. Unless it has Trample, it will deal no combat damage to the defending player, as it has no creature to assign damage to."
    },
    {
        "id": 30,
        "difficulty": "Hard",
        "category": "Triggers",
        "question": "I have [[Elesh Norn, Mother of Machines]] and my opponent plays a [[Ravenous Chupacabra]]. Does its ability trigger?",
        "ground_truth": "No. Elesh Norn's static ability prevents permanents entering the battlefield from causing abilities of permanents your opponents control to trigger."
    },
    {
        "id": 31,
        "difficulty": "Easy",
        "category": "Mana",
        "question": "If I tap a [[Llanowar Elves]] for mana, does it count as playing a land?",
        "ground_truth": "No. Tapping a creature for mana is an activated ability that adds mana to your mana pool. It is not the same as the special action of playing a land card."
    },
    {
        "id": 32,
        "difficulty": "Medium",
        "category": "Land Types",
        "question": "Can I search for a [[Stomping Ground]] if I use a fetch land like [[Wooded Foothills]]?",
        "ground_truth": "Yes. Wooded Foothills searches for a Forest or a Mountain. Since Stomping Ground has both the 'Forest' and 'Mountain' subtypes, it is a legal target."
    },
    {
        "id": 33,
        "difficulty": "Easy",
        "category": "Mana",
        "question": "Does mana stay in my pool if I move from my First Main Phase to my Combat Phase?",
        "ground_truth": "No. As each step or phase ends, any unspent mana is lost from your mana pool unless an effect specifically says otherwise."
    },
    {
        "id": 34,
        "difficulty": "Hard",
        "category": "Layers",
        "question": "My opponent has [[Dryad of the Ilysian Grove]]. I play [[Blood Moon]]. Do their lands still tap for any color?",
        "ground_truth": "No. Blood Moon and Dryad both apply in Layer 4. Blood Moon has a later timestamp (if played after) or creates a dependency. The lands become Mountains and lose all other abilities, including the one granted by the Dryad."
    },
    {
        "id": 35,
        "difficulty": "Medium",
        "category": "Costs",
        "question": "If I have [[Thalia, Guardian of Thraben]] in play, does it make my own [[Sol Ring]] cost 2 mana?",
        "ground_truth": "Yes. Thalia affects 'noncreature spells' cast by any player, including you. Sol Ring is an artifact (noncreature), so its cost is increased by 1."
    },
    {
        "id": 36,
        "difficulty": "Easy",
        "category": "Lands",
        "question": "Can I play a land on my opponent's turn if it has [[Flash]]?",
        "ground_truth": "No. Lands are never cast; they are played. You can only play a land during your own main phase when the stack is empty, regardless of Flash."
    },
    {
        "id": 37,
        "difficulty": "Hard",
        "category": "Replacement Effects",
        "question": "If I control [[Blood Moon]] and my opponent plays a [[City of Brass]], does the City deal 1 damage to them when tapped?",
        "ground_truth": "No. Blood Moon removes all printed abilities from nonbasic lands. The City of Brass is now just a Mountain with the ability '{T}: Add {R}'. Its triggered damage ability no longer exists."
    },
    {
        "id": 38,
        "difficulty": "Medium",
        "category": "Legendary Rule",
        "question": "I have a [[Mox Amber]] in play and I cast another one. What happens?",
        "ground_truth": "The Legend Rule applies. You must choose one to keep and put the other into its owner's graveyard as a state-based action. This does not count as destruction."
    },
    {
        "id": 39,
        "difficulty": "Easy",
        "category": "Mana",
        "question": "If a spell costs {2}{G} and I have [[Trinisphere]], how much mana must I pay?",
        "ground_truth": "You pay 3 mana ({2}{G}). Trinisphere checks if the total cost is at least 3 mana. Since 2+1=3, Trinisphere does not increase the cost further."
    },
    {
        "id": 40,
        "difficulty": "Hard",
        "category": "Axioms / Sagas",
        "question": "I play [[Urza's Saga]] and my opponent has [[Strict Proctor]] in play. What happens to the Saga?",
        "ground_truth": "The Saga enters the battlefield. Its Chapter I ability is a triggered ability. Strict Proctor triggers, and if you don't pay {2}, the Chapter I ability is countered. The Saga stays in play with 1 lore counter but no abilities gained from Chapter I."
    },
    {
        "id": 41,
        "difficulty": "Medium",
        "category": "SBA",
        "question": "If I have 0 or less life but I control [[Platinum Angel]], do I lose the game?",
        "ground_truth": "No. Platinum Angel's static ability creates a continuous effect that stops the state-based action of losing for having 0 life. You continue playing until the Angel leaves the battlefield."
    },
    {
        "id": 42,
        "difficulty": "Hard",
        "category": "SBA",
        "question": "I have 1 life and my opponent casts [[Lightning Helix]] on me. I respond with [[Stifle]] on the 'gain 3 life' part. Can I do that?",
        "ground_truth": "No. Lightning Helix is a single spell, not a triggered ability. Stifle only targets activated or triggered abilities. The damage and life gain happen during the spell's resolution, not as separate triggers."
    },
    {
        "id": 43,
        "difficulty": "Medium",
        "category": "Legendary Rule",
        "question": "If I have [[Sakashima the Impostor]] copying a [[Griselbrand]], do I have to sacrifice one to the Legend Rule?",
        "ground_truth": "No. Sakashima's ability specifically states that its name remains 'Sakashima the Impostor'. Since the names are different, the Legend Rule does not apply even if they are both Legendary and have the same abilities."
    },
    {
        "id": 44,
        "difficulty": "Easy",
        "category": "SBA",
        "question": "If two 2/2 creatures with [[First Strike]] block each other, do they both die?",
        "ground_truth": "Yes. Both deal damage in the first strike damage step simultaneously. Since both receive lethal damage, they are both destroyed at the same time during state-based actions."
    },
    {
        "id": 45,
        "difficulty": "Hard",
        "category": "SBA",
        "question": "I control [[Death's Shadow]] (normally 13/13) and I am at 13 life. My opponent casts [[Night of Souls' Betrayal]] (-1/-1 to all creatures). Does my Shadow die?",
        "ground_truth": "Yes. At 13 life, Death's Shadow is a 0/0. When Night of Souls' Betrayal applies, it becomes a -1/-1. It is put into the graveyard for having 0 or less toughness before you have a chance to lose life and grow it."
    },
    {
        "id": 46,
        "difficulty": "Medium",
        "category": "Tokens",
        "question": "If a creature token is returned to my hand by [[Unsummon]], can I cast it again?",
        "ground_truth": "No. A token that leaves the battlefield ceases to exist as a state-based action. It cannot be moved back to the battlefield or cast from any other zone."
    },
    {
        "id": 47,
        "difficulty": "Easy",
        "category": "Counters",
        "question": "If my creature has a +1/+1 counter and it gets a -1/-1 counter, what happens?",
        "ground_truth": "The counters cancel each other out. As a state-based action, if a permanent has both +1/+1 and -1/-1 counters, they are removed in pairs until only one type (or none) remains."
    },
    {
        "id": 48,
        "difficulty": "Hard",
        "category": "Axioms / SBA",
        "question": "I control a Saga with 3 lore counters, and its final chapter is III. My opponent casts [[Dress Down]] in response to the chapter trigger. Does the Saga stay or go?",
        "ground_truth": "It stays. Under Axiom 2 (Rule 704.5s), a Saga is sacrificed only if it has lore counters >= final chapter number AND it has chapter abilities. Dress Down removes the abilities, so the sacrifice condition is not met."
    },
    {
        "id": 49,
        "difficulty": "Medium",
        "category": "SBA",
        "question": "If I have no cards in library and I am forced to 'put the top card of your library into your graveyard', do I lose the game?",
        "ground_truth": "No. You only lose the game if you are required to DRAW a card from an empty library. Putting cards from library to graveyard (milling) is not drawing."
    },
    {
        "id": 50,
        "difficulty": "Easy",
        "category": "Combat",
        "question": "Can I block a creature with [[Shadow]] using a normal creature?",
        "ground_truth": "No. Creatures with shadow can only be blocked by other creatures with shadow, and they can only block creatures with shadow."
    },
    {
        "id": 51,
        "difficulty": "Medium",
        "category": "Replacement",
        "question": "If I have [[Leyline of the Void]] and my opponent's creature dies, do 'whenever a creature dies' abilities trigger?",
        "ground_truth": "No. Leyline of the Void is a replacement effect that says the card is exiled 'instead' of hitting the graveyard. Since the card never enters the graveyard, it never 'died' by definition."
    },
    {
        "id": 52,
        "difficulty": "Hard",
        "category": "Replacement",
        "question": "I control [[Alms Collector]] and my opponent casts [[Ancestral Recall]] to draw 3 cards. How many do we each draw?",
        "ground_truth": "You each draw one card. Alms Collector replaces the 'draw 2 or more' event with 'you and that player each draw one instead'. The remaining card from Ancestral is lost."
    },
    {
        "id": 53,
        "difficulty": "Medium",
        "category": "Control",
        "question": "If I use [[Control Magic]] on my opponent's creature, and then Control Magic is destroyed, who gets the creature?",
        "ground_truth": "The creature returns to the control of the player who has the next most recent control effect, or its default owner if no other effects exist."
    },
    {
        "id": 54,
        "difficulty": "Easy",
        "category": "Replacement",
        "question": "Does [[Doubling Season]] affect the loyalty counters a Planeswalker enters the battlefield with?",
        "ground_truth": "Yes. Entering the battlefield with counters is considered 'placing' counters, so Doubling Season will double the starting loyalty."
    },
    {
        "id": 55,
        "difficulty": "Hard",
        "category": "Replacement",
        "question": "If I have [[Doubling Season]] and I use a Planeswalker's [+1] ability, do I get two counters?",
        "ground_truth": "No. Doubling Season only affects effects. The loyalty increase for activating a Planeswalker's [+] ability is a cost, not an effect, so it is not doubled."
    },
    {
        "id": 56,
        "difficulty": "Medium",
        "category": "Control",
        "question": "I cast [[Bribery]] and put a creature from my opponent's deck into play. If that creature dies, whose graveyard does it go to?",
        "ground_truth": "It goes to its owner's graveyard (your opponent). A card can only ever exist in its owner's graveyard, hand, or library."
    },
    {
        "id": 57,
        "difficulty": "Easy",
        "category": "Replacement",
        "question": "If I have [[Rest in Peace]] in play, what happens to cards milled from a library?",
        "ground_truth": "They are exiled. Rest in Peace replaces any event where a card would be put into a graveyard from anywhere with exiling it instead."
    },
    {
        "id": 58,
        "difficulty": "Hard",
        "category": "Control",
        "question": "I control my opponent's creature with [[Threaten]]. Before the turn ends, I use [[Cloudshift]] on it. Who controls it when it returns?",
        "ground_truth": "You do, permanently. Cloudshift returns the card to the battlefield 'under your control'. This creates a new object with no expiration date, unlike Threaten."
    },
    {
        "id": 59,
        "difficulty": "Medium",
        "category": "Replacement",
        "question": "If I have [[Blightsteel Colossus]] and it is put into a graveyard, can I target it with [[Reanimate]] in response?",
        "ground_truth": "No. Blightsteel Colossus has a replacement effect ('If... would be put... instead'), not a triggered ability. It never hits the graveyard, so it is never a legal target for Reanimate."
    },
    {
        "id": 60,
        "difficulty": "Medium",
        "category": "Control",
        "question": "If my opponent controls my Commander and it dies, can I still choose to put it in the Command Zone?",
        "ground_truth": "Yes. The owner of the Commander (you) is the one who makes the choice to move it to the Command Zone when it changes zones, regardless of who controlled it."
    },
    {
        "id": 61,
        "difficulty": "Easy",
        "category": "Commander",
        "question": "Can I include [[Noble Hierarch]] in a mono-green Commander deck?",
        "ground_truth": "No. Noble Hierarch has blue and white mana symbols in its reminder text for Exalted, but it also has a mana ability that produces {G}, {W}, or {U}. The mana symbols in its rules text give it a color identity of Bant (Green, White, Blue)."
    },
    {
        "id": 62,
        "difficulty": "Medium",
        "category": "Commander",
        "question": "If my Commander is phased out by an effect like [[Oubliette]], can I choose to move it to the command zone?",
        "ground_truth": "No. Phasing is not a zone change. The permanent is treated as though it doesn't exist, but it hasn't 'left the battlefield', so the special action to move a Commander to the command zone does not trigger."
    },
    {
        "id": 63,
        "difficulty": "Medium",
        "category": "Commander",
        "question": "If I deal 21 damage to an opponent with a copy of their Commander, do they lose the game?",
        "ground_truth": "Yes. Commander damage is a property of the physical card itself. If you control a copy of a Commander that is a permanent, or the actual card, damage dealt by it counts toward the 21-point threshold for that specific Commander."
    },
    {
        "id": 64,
        "difficulty": "Hard",
        "category": "Commander",
        "question": "My Commander has a 'Dies' trigger. If I move it to the Command Zone instead of the graveyard, does it still trigger?",
        "ground_truth": "Yes. Under current rules, the Commander hits the graveyard first (triggering 'dies' effects) and then, as a state-based action, you may move it to the command zone."
    },
    {
        "id": 65,
        "difficulty": "Easy",
        "category": "Commander",
        "question": "Does the 'Commander Tax' apply if I cast my Commander from my hand instead of the Command Zone?",
        "ground_truth": "No. The additional cost of {2} for each previous casting only applies when casting the Commander from the command zone."
    },
    {
        "id": 66,
        "difficulty": "Medium",
        "category": "Commander",
        "question": "If an opponent uses [[Chaos Warp]] on my Commander, can I put it in the Command Zone instead of shuffling it into my library?",
        "ground_truth": "Yes. If a Commander would be put into a library, its owner may choose to put it into the command zone instead. This is a replacement effect."
    },
    {
        "id": 67,
        "difficulty": "Hard",
        "category": "Commander",
        "question": "I control [[Lignify]] attached to an opponent's Commander. Does it still deal 'Commander Damage'?",
        "ground_truth": "Yes. Being a Commander is an innate property of the card. Even if it loses all abilities and becomes a 0/4 Treefolk, any combat damage it deals is still tracked as Commander damage."
    },
    {
        "id": 68,
        "difficulty": "Easy",
        "category": "Commander",
        "question": "In a Commander game, if a player is eliminated, what happens to the permanents they stole from other players?",
        "ground_truth": "Any effects giving the player control of those permanents end immediately. The permanents return to the control of the player who would otherwise control them."
    },
    {
        "id": 69,
        "difficulty": "Medium",
        "category": "Commander",
        "question": "Can I use [[Command Tower]] to produce mana in a deck where my Commander is [[Hope of Ghirapur]]?",
        "ground_truth": "Command Tower produces mana of any color in your Commander's identity. Since Hope of Ghirapur is colorless, Command Tower produces no mana."
    },
    {
        "id": 70,
        "difficulty": "Hard",
        "category": "Commander",
        "question": "If my Commander is [[Silvos, Rogue Elemental]] and it is destroyed, can I regenerate it AND move it to the Command Zone?",
        "ground_truth": "No. If you regenerate it, it is never destroyed and never leaves the battlefield. Since it doesn't change zones, the option to move it to the command zone never occurs."
    },
    {
        "id": 71,
        "difficulty": "Medium",
        "category": "Copying",
        "question": "If I use [[Clone]] to copy a creature that has a +1/+1 counter on it, does the Clone also get a counter?",
        "ground_truth": "No. Counters are not part of a card's copyable values. Clone only copies what is printed on the card (and other copy effects), not status, counters, or temporary buffs."
    },
    {
        "id": 72,
        "difficulty": "Hard",
        "category": "Copying",
        "question": "I use [[Phantasmal Image]] to copy a creature that is being affected by [[Giant Growth]]. What are the Image's stats?",
        "ground_truth": "The Image will have the base power and toughness of the creature. Temporary effects like +3/+3 from Giant Growth are not copyable values."
    },
    {
        "id": 73,
        "difficulty": "Medium",
        "category": "Face-down",
        "question": "Can I look at my own face-down creatures created by [[Manifest]] or [[Morph]] at any time?",
        "ground_truth": "Yes. You may look at a face-down spell or permanent you control at any time."
    },
    {
        "id": 74,
        "difficulty": "Hard",
        "category": "Transform",
        "question": "If I copy the front face of a transforming double-faced card like [[Delver of Secrets]], can the copy transform?",
        "ground_truth": "No. A copy of a transforming double-faced card cannot transform unless the copy itself is a double-faced card. Most tokens or clones will simply stay on the copied face."
    },
    {
        "id": 75,
        "difficulty": "Medium",
        "category": "Copying",
        "question": "If I cast [[Rite of Replication]] kicked on a [[Gray Merchant of Asphodel]], do the tokens see each other for Devotion?",
        "ground_truth": "Yes. All tokens enter the battlefield simultaneously. When their triggered abilities go on the stack and resolve, they will count the black mana symbols of all tokens currently on the battlefield."
    },
    {
        "id": 76,
        "difficulty": "Easy",
        "category": "Copying",
        "question": "If I copy a spell on the stack, does the copy count as being 'cast' for abilities like Storm?",
        "ground_truth": "No. Copying a spell on the stack creates a copy directly on the stack. It is not 'cast', so it does not trigger abilities that look for spells being cast."
    },
    {
        "id": 77,
        "difficulty": "Hard",
        "category": "Copying",
        "question": "I have [[Mirror Box]] and I copy my legendary Commander. What happens if Mirror Box is destroyed later?",
        "ground_truth": "The Legend Rule will apply immediately as a state-based action. You will have to choose one of the legendary permanents with the same name to keep and put the rest into the graveyard."
    },
    {
        "id": 78,
        "difficulty": "Medium",
        "category": "Face-down",
        "question": "If a face-down creature is destroyed, does it reveal what it was to all players?",
        "ground_truth": "Yes. When a face-down permanent leaves the battlefield, it is turned face up as it moves to the new zone (like the graveyard)."
    },
    {
        "id": 79,
        "difficulty": "Hard",
        "category": "Copying",
        "question": "I copy a [[Questing Beast]] with [[Alter Ego]]. Does the copy have the 'can't be countered' and 'enters with counters' abilities of Alter Ego?",
        "ground_truth": "The 'can't be countered' was part of the casting process. The copy effect is the Questing Beast plus a +1/+1 counter if paid. The counter becomes part of the object but is not a 'copyable value' for future clones."
    },
    {
        "id": 80,
        "difficulty": "Medium",
        "category": "Copying",
        "question": "If I copy a land that has been turned into a creature by [[Nissa, Who Shakes the World]], is the copy a creature?",
        "ground_truth": "No. The effect making the land a creature is a continuous effect, not a copyable value. The copy will just be a non-creature land."
    },
    {
        "id": 81,
        "difficulty": "Medium",
        "category": "Costs",
        "question": "If I cast [[Walking Ballista]] where X=3, what is its mana value on the stack?",
        "ground_truth": "On the stack, X counts as the chosen value. So for X=3, the mana value (CMC) is 3+3 = 6. In any other zone, X is considered 0."
    },
    {
        "id": 82,
        "difficulty": "Easy",
        "category": "Costs",
        "question": "Can I pay the [[Kicker]] cost of a spell if I am casting it for free via an effect?",
        "ground_truth": "Yes. When casting a spell without paying its mana cost, you can still pay optional additional costs like Kicker or Buyback."
    },
    {
        "id": 83,
        "difficulty": "Hard",
        "category": "Costs",
        "question": "I have [[Trinisphere]] and I want to cast [[Force of Will]] by exiling a blue card. How much mana do I pay?",
        "ground_truth": "You pay {3}. Trinisphere is applied after all other cost additions and subtractions. Since you are paying {0} via the alternative cost, Trinisphere sees that the cost is less than 3 and bumps it up to {3}."
    },
    {
        "id": 84,
        "difficulty": "Medium",
        "category": "Costs",
        "question": "If a spell has [[Convoke]], can I tap a creature with summoning sickness to help pay for it?",
        "ground_truth": "Yes. Convoke is not a tap ability of the creature ({T}). It is a way to pay the spell's cost. Summoning sickness only prevents attacking and abilities with the {T} or {Q} symbol."
    },
    {
        "id": 85,
        "difficulty": "Hard",
        "category": "Costs",
        "question": "I cast [[Chalice of the Void]] with X=0. What is its mana value while on the stack?",
        "ground_truth": "On the stack, the mana value is 0+0 = 0. Chalice's CMC is always 2X while on the stack, and 0 everywhere else."
    },
    {
        "id": 86,
        "difficulty": "Easy",
        "category": "Costs",
        "question": "If I cast a spell with [[Delve]], does exiling cards from my graveyard change the spell's mana value?",
        "ground_truth": "No. Delve is an alternative way to pay the mana cost. The mana value (CMC) is determined by the symbols printed in the top right corner of the card."
    },
    {
        "id": 87,
        "difficulty": "Medium",
        "category": "Costs",
        "question": "Can I cast a spell for its [[Overload]] cost if an effect lets me cast it 'without paying its mana cost'?",
        "ground_truth": "No. Overload is an alternative cost. You can only apply one alternative cost to a spell. 'Without paying its mana cost' is already an alternative cost."
    },
    {
        "id": 88,
        "difficulty": "Hard",
        "category": "Costs",
        "question": "I control [[Lodestone Golem]] ({1} more for non-artifact spells). If I cast a non-artifact spell with [[Delve]], can I exile a card to pay for the Golem's tax?",
        "ground_truth": "Yes. Delve allows you to exile cards to pay for any part of the generic mana cost, including additional costs or taxes like the one from Lodestone Golem."
    },
    {
        "id": 89,
        "difficulty": "Medium",
        "category": "Costs",
        "question": "If I cast [[Ancestral Vision]] from my hand, do I have to pay {0}?",
        "ground_truth": "Ancestral Vision has no mana cost (it is unpayable). You cannot cast it normally from your hand; you must use its Suspend ability or an effect that lets you cast it without paying its mana cost."
    },
    {
        "id": 90,
        "difficulty": "Hard",
        "category": "Costs",
        "question": "If I have [[Jet Medallion]] (black spells cost {1} less) and I cast a black spell with X in its cost, does the reduction apply to X?",
        "ground_truth": "Yes. You first choose the value for X, calculate the total cost, and then apply reductions. The Medallion will reduce the total amount of generic mana you have to pay by {1}."
    },
    {
        "id": 91,
        "difficulty": "Hard",
        "category": "Layers",
        "question": "I control [[Humility]] and my opponent plays [[Opalescence]]. What is the power and toughness of other non-aura enchantments?",
        "ground_truth": "This is a Layer 7b interaction. Both effects apply in the same sublayer. They are applied in timestamp order. If Humility entered the battlefield last, all other non-aura enchantments are 1/1 creatures. If Opalescence entered last, their P/T is equal to their mana value."
    },
    {
        "id": 92,
        "difficulty": "Hard",
        "category": "Dependencies",
        "question": "I have [[Blood Moon]] and my opponent has [[Urborg, Tomb of Yawgmoth]] in play. Are lands Swamps?",
        "ground_truth": "No. There is a dependency in Layer 4. Blood Moon's effect changes Urborg's type to Mountain, which removes its ability to make lands Swamps. Therefore, Urborg's effect is never applied, and lands remain their basic types or Mountains."
    },
    {
        "id": 93,
        "difficulty": "Hard",
        "category": "Continuous Effects",
        "question": "If I cast [[Dress Down]] during my opponent's end step, when does it get sacrificed?",
        "ground_truth": "It will be sacrificed at the beginning of the next player's end step (your turn). Since 'at the beginning of the end step' triggers occur at the very start of that phase, casting it during the phase means the trigger for the current turn has already passed."
    },
    {
        "id": 94,
        "difficulty": "Hard",
        "category": "Axioms / Sagas",
        "question": "If I use [[Power Terrace]] to give my [[Urza's Saga]] +1/+1 (making it a creature) and then I play [[Blood Moon]], is it still a creature?",
        "ground_truth": "No. Blood Moon turns the land into a Mountain in Layer 4 and it loses all abilities. Since the effect making it a creature was tied to it being a Saga/Enchantment with specific abilities that are now gone, it ceases to be a creature and becomes a non-basic Mountain."
    },
    {
        "id": 95,
        "difficulty": "Hard",
        "category": "Replacement Effects",
        "question": "I have [[Doubling Season]] and I cast a creature with [[Sunburst]]. Are the counters doubled?",
        "ground_truth": "Yes. Sunburst is a replacement effect that modifies how the permanent enters the battlefield ('enters with...'). Doubling Season interacts with any effect that places counters as a permanent enters, so it doubles the sunburst counters."
    },
    {
        "id": 96,
        "difficulty": "Hard",
        "category": "Time-Travel / Teferi",
        "question": "My opponent has [[Teferi, Time Raveler]]. I have a spell with [[Suspend]] that has its last counter removed during my upkeep. Can I cast it?",
        "ground_truth": "No. Suspend triggers during the upkeep and instructs you to cast the spell. However, Teferi's static ability restricts you to casting spells only when you could cast a sorcery (Main phase, empty stack). Since it is the upkeep, the spell remains in exile."
    },
    {
        "id": 97,
        "difficulty": "Hard",
        "category": "Triggers",
        "question": "If I control [[Elesh Norn, Mother of Machines]] and my opponent's [[Ashen Rider]] dies, does its ability trigger twice?",
        "ground_truth": "No. Elesh Norn only doubles triggers that occur when a permanent ENTERS the battlefield. Ashen Rider's ability is a 'leaves the battlefield' (dies) trigger, so it only triggers once as normal."
    },
    {
        "id": 98,
        "difficulty": "Hard",
        "category": "Control",
        "question": "If I use [[Sudden Substitution]] to swap a creature I control for an opponent's spell, and that spell has [[Storm]], who gets the Storm copies?",
        "ground_truth": "The opponent (the original caster) still controls the Storm trigger. Storm triggers when the spell is cast. Even if you gain control of the original spell, the trigger on the stack is still controlled by the player who cast it, and they will get the copies."
    },
    {
        "id": 99,
        "difficulty": "Hard",
        "category": "Layers / Copy",
        "question": "I have a [[Magus of the Moon]] that is being affected by [[Lignify]]. If I copy it with [[Clone]], what is the Clone?",
        "ground_truth": "The Clone is a full [[Magus of the Moon]]. It will have the ability 'Nonbasic lands are Mountains'. Lignify's effect (making it a 0/4 Treefolk) is a continuous effect applied in Layer 6, which is not part of the card's copyable values."
    },
    {
        "id": 100,
        "difficulty": "Hard",
        "category": "Winning the Game",
        "question": "I have [[Abyssal Persecutor]] and my opponent is at -10 life. I cast [[Fractured Identity]] on my Persecutor. Who wins?",
        "ground_truth": "The game continues. Each of your opponents receives a copy of Abyssal Persecutor. Since YOU are now the only player who doesn't control one, you are the only one who 'can't win', while your opponents 'can't lose' due to the copies they now control."
    }
  ]
}






