[
  {
    "id": 1,
    "question": "I control [[Vizier of Remedies]] and [[Devoted Druid]]. Can I generate infinite Green mana?",
    "accepted_answer": "Yes, you can. This works because the Vizier creates a replacement effect that modifies the cost of the Druid's untap ability. When you activate the Druid, the cost requires putting a -1/-1 counter on it, but the Vizier reduces that number by one, meaning you effectively pay 0 counters. Since the Druid never actually receives the counter, it doesn't shrink or die, allowing you to untap it infinitely.",
    "difficulty": "hard",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Read the text, boy! Read the text!\n\nYou have a combination of **Vizier of Remedies** and **Devoted Druid**. The interaction between these two cards is a classic example of exploiting replacement effects and costs to create a loop.\n\n**The Lecture**:\n- **Devoted Druid** has an ability that allows you to untap it by putting a -1/-1 counter on it. This is a cost, not an effect, meaning you must pay it to activate the ability.\n- **Vizier of Remedies** modifies this cost. It states that if one or more -1/-1 counters would be put on a creature you control, that many minus one are put on it instead.\n- When you activate Devoted Druid's untap ability, you attempt to put a -1/-1 counter on it. However, Vizier of Remedies reduces this to zero counters.\n- Since the cost is modified to zero counters, you can untap Devoted Druid without actually placing a counter on it.\n\n**The Ruling**:\nYes, you can generate infinite Green mana. You tap Devoted Druid for {G}, then activate its untap ability. Vizier of Remedies ensures no -1/-1 counter is placed, allowing you to repeat this process indefinitely.\n\n**Sources**:\n- **Rule 605.2 (Mana Abilities)**: Defines mana abilities and their activation.\n- **Rule 701.44a (Keyword Actions)**: Discusses the application of counters and replacement effects.\n- **Rule 106.7 (Mana)**: Clarifies how mana abilities function and interact with replacement effects."
  },
  {
    "id": 2,
    "question": "I activate [[Kiki-Jiki, Mirror Breaker]] targeting a creature I control. In response, my opponent destroys that target. Do I still create the token?",
    "accepted_answer": "No, you do not create the token. This happens because Kiki-Jiki's ability requires a legal target to resolve. If the target is removed (destroyed, exiled, or bounced) before the ability resolves, the ability has no legal targets left and fails completely (fizzles). Since the ability does not resolve, no token is created.",
    "difficulty": "hard",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen you activate Kiki-Jiki, Mirror Breaker's ability, you target a nonlegendary creature you control to create a token copy of it. However, if your opponent destroys that creature in response, the situation becomes a bit more complex.\n\n**The Lecture**:\n1. **Activation and Targeting**: You activate Kiki-Jiki's ability, targeting a creature you control. This ability goes on the stack and waits to resolve.\n   \n2. **Opponent's Response**: Your opponent responds by destroying the targeted creature. This action resolves first, removing the creature from the battlefield before Kiki-Jiki's ability can resolve.\n\n3. **Resolution of Kiki-Jiki's Ability**: When Kiki-Jiki's ability attempts to resolve, it checks its target. Since the target is no longer on the battlefield, the ability is countered by the game rules for having an illegal target. This means the ability does nothing, and no token is created.\n\n**The Ruling**: You do not create a token. The ability is countered due to the target being destroyed before resolution.\n\n**Sources**: \n- **Rule 608.2b (Resolving Spells and Abilities)**: If all targets for a spell or ability are illegal when it tries to resolve, it is countered and does nothing.\n- **Rule 701.7b (Keyword Actions)**: Replacement effects apply before considering continuous effects, but in this case, the ability never gets to the point of creating a token due to the target's absence."
  },
  {
    "id": 3,
    "question": "If my opponent casts [[Solitude]] on my [[Ketramose]] during my turn, do I draw a card from [[Ketramose]]'s ability?",
    "accepted_answer": "Yes, you will draw a card. Ketramose's ability is a triggered ability that looks back at the game state to see if its trigger condition was met, and it functions even if Ketramose itself leaves the battlefield as part of the event or before the ability resolves.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen your opponent casts Solitude and exiles your Ketramose during your turn, we must consider the sequence of events and the abilities involved. Solitude's ability triggers upon entering the battlefield, allowing it to exile a target creature, in this case, Ketramose. \n\n**The Lecture**: \n1. **Solitude's Trigger**: When Solitude enters the battlefield, its ability triggers, targeting Ketramose for exile. This ability resolves, and Ketramose is exiled.\n2. **Ketramose's Trigger**: Ketramose has an ability that triggers whenever one or more cards are put into exile from graveyards and/or the battlefield during your turn. The key here is that Ketramose's ability looks at the event of cards being exiled, not the state of Ketramose itself.\n3. **Last Known Information (LKI)**: Even though Ketramose is no longer on the battlefield when its ability would trigger, we use the Last Known Information rule to determine that it was indeed on the battlefield when the exile event occurred. Therefore, its ability can trigger and resolve.\n\n**The Ruling**: Yes, you draw a card and lose 1 life from Ketramose's ability when Solitude exiles it during your turn.\n\n**Sources**: \n- **Rule 603.2 (Triggered Abilities)**: Explains how triggered abilities function.\n- **Rule 400.7k (General)**: Discusses how effects can reference objects that have moved to a public zone.\n- **Rule 121.3 (Drawing a Card)**: Details the process of drawing cards."
  },
  {
    "id": 4,
    "question": "I cast [[Dress Down]] and my opponent has a [[Magus of the Moon]] in play. Are my non-basic lands still Mountains?",
    "accepted_answer": "Yes, your non-basic lands will still be Mountains even after casting Dress Down on Magus of the Moon, because Magus's effect (changing land types in Layer 4) applies before Dress Down's effect (removing abilities in Layer 6), meaning the lands become Mountains before the Magus loses its ability to do so.",
    "difficulty": "hard",
    "category": "Continuous Effects, Layers & Copying",
    "owl_answer": "Squawk! A tangled web of layers. Let us untangle it.\n\nWhen you cast **Dress Down**, it enters the battlefield and causes all creatures to lose their abilities. Meanwhile, **Magus of the Moon** is a creature with a static ability that turns all nonbasic lands into Mountains. This interaction involves the application of layers, specifically Layer 4 for type-changing effects and Layer 6 for ability-removing effects.\n\n**The Lecture**:\n1. **Layer 4**: The effect of **Magus of the Moon** is applied here, changing all nonbasic lands into Mountains. This happens before any abilities are removed.\n2. **Layer 6**: **Dress Down** then removes all abilities from creatures, including the ability of **Magus of the Moon**. However, the type-changing effect from Layer 4 persists because it was applied before the abilities were removed.\n\nA common misconception is that removing the ability of **Magus of the Moon** would revert the lands back to their original types. However, the rules dictate that type-changing effects are applied before ability-removing effects, and once applied, they persist even if the source loses its abilities.\n\n**The Ruling**: Your nonbasic lands remain Mountains. The type change persists despite **Dress Down** removing the abilities of **Magus of the Moon**.\n\n**Sources**: \n- **Rule 613.1 (Interaction of Continuous Effects)**\n- **Rule 613.3 (Interaction of Continuous Effects in Layers)**\n- **Rule 613.6 (Applying Effects in Layers)**"
  },
  {
    "id": 5,
    "question": "If I cast [[Merfolk Trickster]] on [[Dryad of the Ilysian Grove]], will my opponent's [[Valakut]] see his lands as Mountains?",
    "accepted_answer": "Yes, the lands remain Mountains. This happens because type-changing effects are applied in Layer 4, whereas ability-removing effects occur later in Layer 6. Since the game applies the 'Mountain' type before removing the Dryad's text, Valakut triggers will still function normally. However, the opponent does lose the specific permission to play an additional land for that turn.",
    "difficulty": "hard",
    "category": "Continuous Effects, Layers & Copying",
    "owl_answer": "Squawk! A tangled web of layers. Let us untangle it.\n\nWhen you cast **Merfolk Trickster** targeting **Dryad of the Ilysian Grove**, the Trickster's ability will cause the Dryad to lose all its abilities until the end of turn. This includes the ability that makes lands you control every basic land type, which is applied in Layer 4.\n\n**The Lecture**:\n1. **Layer 4**: This is where type-changing effects occur. **Dryad of the Ilysian Grove** grants lands the types of all basic lands, including Mountain. This effect is applied here.\n2. **Layer 6**: This is where abilities are gained or lost. **Merfolk Trickster**'s ability removes all abilities from the Dryad, including the one that grants land types.\n\nAccording to the rules of layers, the type-changing effect from the Dryad is applied in Layer 4, before the Trickster's ability removes the Dryad's abilities in Layer 6. Therefore, even though the Dryad loses its abilities, the lands retain their types as all basic land types, including Mountain, because the type change persists from Layer 4.\n\n**The Ruling**: Yes, your opponent's **Valakut, the Molten Pinnacle** will still see the lands as Mountains, even after **Merfolk Trickster** removes the Dryad's abilities. The type change persists due to the order of layers.\n\n**Sources**: \n- **Rule 613.1 (Interaction of Continuous Effects)**\n- **Rule 613.3 (Layer 4: Type-Changing Effects)**\n- **Rule 613.6 (Layer 6: Ability-Adding and Ability-Removing Effects)**"
  },
  {
    "id": 6,
    "question": "If I have an [[Urza's Saga]] on chapter II and my opponent plays a [[Blood Moon]], what happens to my [[Urza's Saga]]?",
    "accepted_answer": "When your opponent plays Blood Moon while your Urza's Saga is on Chapter II, Urza's Saga becomes a basic Mountain, but thanks to a recent rules update (around May 2025), it doesn't get sacrificed, and it retains the abilities from previous chapters, allowing you to keep creating Construct tokens and tapping for mana, effectively becoming a powerful utility Mountain. It loses its lore counters and won't gain more, but its existing chapter abilities become usable on the Mountain.",
    "difficulty": "hard",
    "category": "Continuous Effects, Layers & Copying",
    "owl_answer": "Squawk! A tangled web of layers. Let us untangle it.\n\nWhen your opponent plays **Blood Moon**, it creates a continuous effect that changes all nonbasic lands into Mountains. This effect operates in Layer 4, which is responsible for changing types and removing abilities from the printed text box of the affected permanents.\n\n**The Lecture**:\n1. **Blood Moon's Effect**: As soon as Blood Moon enters the battlefield, it affects all nonbasic lands, including your **Urza's Saga**. It becomes a Mountain and loses all its printed abilities, including its chapter abilities. This is because Blood Moon's effect applies in Layer 4, which is before any abilities granted by other effects (Layer 6).\n\n2. **Urza's Saga's Gained Abilities**: However, Urza's Saga has already resolved its Chapter I and II abilities, granting it \"{T}: Add {C}\" and \"{2}, {T}: Create a 0/0 colorless Construct artifact creature token with 'This token gets +1/+1 for each artifact you control.'\" These abilities are retained because they were gained through resolved chapter triggers, which are applied in Layer 6. Blood Moon does not affect these gained abilities.\n\n3. **Saga Sacrifice Check**: According to the rules regarding Sagas, a Saga is sacrificed if it has a number of lore counters greater than or equal to its final chapter number and it possesses chapter abilities. Since Blood Moon removes the printed chapter abilities, Urza's Saga no longer meets the condition of having chapter abilities. Therefore, it is not sacrificed despite having lore counters equal to or greater than its final chapter number.\n\n**The Ruling**: Your **Urza's Saga** becomes a Mountain due to Blood Moon, losing its printed chapter abilities. However, it retains any abilities gained from resolved chapters. It is not sacrificed because it no longer has chapter abilities to trigger the sacrifice condition.\n\n**Sources**: \n- **Rule 613 (Interaction of Continuous Effects)**\n- **Rule 704.5s (State-Based Actions for Sagas)**\n- **Rule 714.3b (Saga Cards and Lore Counters)**"
  },
  {
    "id": 7,
    "question": "I cast a [[Dragonhawk, Fate's Tempest]] exiling 2 cards, but my opponent kills it right away with [[Shoot the Sheriff]]. On my end step, I still have the 2 cards in exile. Does the [[Dragonhawk]] still do damage to my opponent even if it is in the graveyard?",
    "accepted_answer": "Yes, the Dragonhawk's end-step ability will still trigger and deal 4 damage to your opponent, even though it died, because the ability creates a delayed trigger that exists independently on the stack, separate from its source. The key is that the ability triggered and put the cards into exile and the damage effect on the stack; as long as the cards are still in exile, the delayed trigger resolves and deals damage based on those specific exiled cards.",
    "difficulty": "hard",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen you cast **Dragonhawk, Fate's Tempest**, its ability triggers, exiling the top two cards of your library. Your opponent then responds with **Shoot the Sheriff**, destroying the Dragonhawk. The question is whether the Dragonhawk's delayed triggered ability still deals damage at the end step, even though the Dragonhawk is no longer on the battlefield.\n\n**The Lecture**:\n1. **Dragonhawk's Ability**: When Dragonhawk enters the battlefield, its ability triggers and exiles the top X cards of your library. In this case, X is 2. This ability resolves independently of the Dragonhawk's fate.\n   \n2. **Shoot the Sheriff**: Your opponent casts **Shoot the Sheriff**, targeting and destroying Dragonhawk. The Dragonhawk is sent to the graveyard, but this does not affect the resolution of its previously triggered ability.\n\n3. **Delayed Triggered Ability**: The Dragonhawk's ability creates a delayed triggered ability that checks the exiled cards at the beginning of your next end step. This ability is independent of the Dragonhawk's presence on the battlefield. The rules regarding delayed triggered abilities dictate that they will resolve as long as their conditions are met, regardless of the source's current zone.\n\n**The Ruling**: Yes, the Dragonhawk's delayed triggered ability will still deal damage to your opponent at the end step, even though the Dragonhawk is in the graveyard. The ability was set in motion when the Dragonhawk entered the battlefield, and its resolution does not depend on the Dragonhawk remaining in play.\n\n**Sources**:\n- **Rule 603.7 (Delayed Triggered Abilities)**: Delayed triggered abilities are created by effects and resolve independently of their source.\n- **Rule 400.7 (Zone Changes)**: A card's abilities can still resolve even if the card changes zones, as long as the ability was already on the stack or set to trigger.\n\nRemember, boy, the battlefield is but one of many zones, and the rules govern them all with precision!"
  },
  {
    "id": 8,
    "question": "If my opponent controls [[The One Ring]] with 2 counters and activates it, and I exile it in response with [[Tear Asunder]], does my opponent draw 2 cards, 3 cards, or 0 cards?",
    "accepted_answer": "Your opponent draws 2 cards. This happens because activated abilities exist independently of their source once placed on the stack; removing The One Ring does not counter the ability. Although a new burden counter cannot be added to the now-exiled card, the game uses Last Known Information to recall the two counters present when it left the battlefield, allowing the draw effect to resolve based on that count.",
    "difficulty": "hard",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nIn this scenario, your opponent controls **The One Ring** with 2 burden counters and activates its ability. You respond by casting **Tear Asunder** to exile the Ring. Let's dissect this interaction step by step.\n\n**The Lecture**:\n1. **Activation and Response**: Your opponent activates The One Ring's ability, putting it on the stack. This ability involves putting a burden counter on the Ring and then drawing a card for each burden counter on it. At this point, the Ring has 2 counters.\n\n2. **Stack Resolution**: You respond with Tear Asunder, targeting The One Ring. According to the rules of the stack, Tear Asunder will resolve before The One Ring's ability because of the Last In, First Out (LIFO) principle.\n\n3. **Exiling the Ring**: Tear Asunder resolves, exiling The One Ring. Now, when The One Ring's ability attempts to resolve, the Ring is no longer on the battlefield.\n\n4. **Last Known Information (LKI)**: Since the Ring is gone, we use Last Known Information to determine the number of burden counters it had just before it left the battlefield. At that time, it had 2 counters.\n\n5. **Drawing Cards**: The ability resolves using this Last Known Information. Your opponent draws 2 cards, corresponding to the 2 burden counters that were on The One Ring before it was exiled.\n\n**The Ruling**: Your opponent draws 2 cards.\n\n**Sources**:\n- **Rule 603.2 (Triggered Abilities)**\n- **Rule 608.2g (Resolving Spells and Abilities)**\n- **Rule 608.2h (Last Known Information)**"
  },
  {
    "id": 9,
    "question": "If I cast [[Phantasmal Image]] on an activated [[Mutavault]], do I get a 2/2 creature that does not need activation?",
    "accepted_answer": "No, when Phantasmal Image copies an activated Mutavault (one that's already a creature), the Image enters as a Land, not a creature, because the animation is an effect, not a copyable characteristic. It will only become a 2/2 creature and gain summoning sickness if you activate its ability after it enters, making it a land-creature that must wait until your next turn to tap for mana.",
    "difficulty": "hard",
    "category": "Continuous Effects, Layers & Copying",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen you cast **Phantasmal Image** targeting an activated **Mutavault**, you might expect to get a 2/2 creature without needing to activate it. However, the rules of copying effects are quite specific and do not align with such expectations.\n\n**The Lecture**:\n- **Phantasmal Image** enters the battlefield as a copy of the chosen creature, in this case, the activated **Mutavault**. However, the copy effect only considers the *printed* characteristics of the card being copied, not any temporary effects or statuses it might currently have.\n- The **Mutavault** is originally a land with an ability to become a creature. When **Phantasmal Image** copies it, it becomes a copy of the **Mutavault** as it is printed on the card, not as it is temporarily animated.\n- This means that the **Phantasmal Image** will become a land with the ability to turn into a 2/2 creature, but it will not be a creature itself upon entering the battlefield. It will not have the 2/2 stats or creature types until you activate its ability.\n\n**The Ruling**: The **Phantasmal Image** becomes a land with the ability to become a 2/2 creature, but it is not a creature upon entering the battlefield. You must activate its ability to make it a creature.\n\n**Sources**: \n- **Rule 706.2 (Copying Objects)**: A copy acquires the printed text of the original card.\n- **Rule 110.5b (Permanents)**: Permanents enter the battlefield untapped, unflipped, face up, and phased in unless a spell or ability says otherwise."
  },
  {
    "id": 10,
    "question": "Can I pay life to [[Bolas's Citadel]] and go to negative life if I have a [[Platinum Angel]]?",
    "accepted_answer": "No, you cannot pay life to Bolas's Citadel and go to negative life with Platinum Angel out, because you can't pay life you don't have, even if the Angel keeps you in the game; you can only pay down to 0 life and then can't pay any more, though you can still pay 0 life to activate abilities if a cost allows it. Platinum Angel prevents you from losing the game at 0 or less life, but it doesn't change the fundamental rule that you can't spend life as a resource if your total is zero or below.",
    "difficulty": "hard",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Read the text, boy! Read the text!\n\n**The Lecture**: \nWhen you attempt to cast a spell using Bolas's Citadel, you must pay life equal to the spell's mana value instead of its mana cost. However, the rules are quite clear: you can only pay life if your life total is greater than or equal to the amount you need to pay. This is a fundamental restriction on paying life as a cost. \n\nNow, you might think that Platinum Angel, with its ability to prevent you from losing the game, would allow you to pay life even if it would reduce your life total to zero or below. But alas, this is a common misconception. Platinum Angel does not grant you the ability to pay life you do not have. It merely prevents you from losing the game due to having zero or less life. \n\nThe rules dictate that you cannot pay a cost unless you have the requisite resources. In this case, life is the resource, and if you do not have enough life to pay the cost, you cannot proceed with the payment. Platinum Angel's effect does not alter this fundamental rule.\n\n**The Ruling**: You cannot pay life to Bolas's Citadel if it would reduce your life total below zero, even with Platinum Angel on the battlefield. The payment is illegal because you do not have the necessary life to pay.\n\n**Sources**: \n- **Rule 119.4 (Life)**: If a cost or effect allows a player to pay an amount of life greater than 0, the player may do so only if their life total is greater than or equal to the amount of the payment.\n- **Rule 119.8 (Life)**: A cost that involves having a player pay life can’t be paid if the player cannot lose life."
  },
  {
    "id": 11,
    "question": "Do I draw from [[Dark Confidant]] if my life would go to negative but I have a [[Platinum Angel]] out?",
    "accepted_answer": "Yes, you still draw from Dark Confidant even if your life goes negative with Platinum Angel out, because the Angel prevents you from losing the game, but doesn't stop your life total from becoming negative; the loss prevention only applies when state-based actions check for a loss, and you can't pay life if you have none to pay, but damage still reduces your life below zero, and Dark Confidant's effect triggers before you'd lose.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen you control a **Platinum Angel**, you are shielded from losing the game, regardless of your life total. This means that even if your life total would drop to zero or below, you continue to play as if nothing happened. Now, let's consider the interaction with **Dark Confidant**.\n\n**The Lecture**:\n- At the beginning of your upkeep, **Dark Confidant** triggers, and you reveal the top card of your library.\n- You put that card into your hand and lose life equal to its mana value.\n- Normally, if this loss of life would reduce your life total to zero or below, you would lose the game. However, **Platinum Angel** prevents you from losing the game due to having zero or less life.\n\nThe misconception here is that having a negative life total would somehow prevent you from drawing the card. This is not the case. The draw and life loss are part of the same ability, and the life loss does not prevent the draw from occurring. The game does not check for state-based actions, such as losing the game due to life total, until after the ability has fully resolved and a player would receive priority.\n\n**The Ruling**: You draw the card from **Dark Confidant** even if your life total would become negative, as **Platinum Angel** prevents you from losing the game.\n\n**Sources**: \n- **Rule 704.5 (State-Based Actions)**: State-based actions are checked when a player would receive priority.\n- **Rule 119.8 (Life)**: Effects that prevent life loss or game loss.\n- **Rule 400.6 (General)**: Handling of zone changes and replacement effects."
  },
  {
    "id": 12,
    "question": "If I discarded a nonland card to [[Grab the Prize]] and managed to copy the spell, does the copy also deal the 2 damage?",
    "accepted_answer": "Yes, the copied Grab the Prize will deal 2 damage to each opponent because copies of spells copy all choices made for the original, including additional costs, so the copy \"remembers\" that a nonland was discarded for the original spell and applies that effect. You don't pay additional costs for the copy, but it references the original's costs to determine its own outcome.",
    "difficulty": "hard",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen you cast **Grab the Prize**, you must discard a card as an additional cost. If the discarded card is not a land, the spell will deal 2 damage to each opponent. Now, if you manage to copy **Grab the Prize**, the copy will indeed deal 2 damage to each opponent, provided the original spell's condition was met.\n\n**The Lecture**:\n- When you cast **Grab the Prize**, you discard a card as part of the casting cost. This is a decision made during the casting process, not during resolution.\n- The original spell checks the discarded card to determine if it deals damage. If the discarded card wasn't a land, the spell will deal 2 damage to each opponent.\n- According to the rules of copying spells, a copy of a spell includes all decisions made for the original, including additional costs paid (Rule 707.10).\n- Therefore, the copy of **Grab the Prize** will also recognize the discarded card from the original spell and will deal 2 damage to each opponent if the original condition was satisfied.\n\n**The Ruling**: Yes, the copy of **Grab the Prize** will deal 2 damage to each opponent if the original spell's condition (discarding a nonland card) was met.\n\n**Sources**: \n- **Rule 707.10 (Copying Objects)**: A copy of a spell includes all decisions made for the original spell, including additional costs.\n- **Rule 112.1b (Spells)**: A copy of a spell is a spell and follows the same rules as the original."
  },
  {
    "id": 13,
    "question": "If I have an active [[Purphoros, God of the Forge]] enchanted by [[Unable to Scream]], what happens if my devotion drops below 5? Does the aura fall? Is [[Purphoros]] still a Toy creature?",
    "accepted_answer": "Purphoros remains a Toy creature, and the Aura does not fall off. This happens because both effects (Purphoros trying to revert to a non-creature enchantment and the Aura forcing him to be a Toy creature) apply in Layer 4. Since the Aura entered the battlefield later, its timestamp wins the conflict and overwrites Purphoros's natural state. Because the Aura successfully forces him to remain a creature, it stays legally attached to him regardless of your current devotion count.",
    "difficulty": "hard",
    "category": "Continuous Effects, Layers & Copying",
    "owl_answer": "Squawk! A tangled web of layers. Let us untangle it.\n\nWhen Purphoros, God of the Forge is enchanted by Unable to Scream, several layers of effects interact. Unable to Scream makes Purphoros a Toy artifact creature with base power and toughness 0/2 and removes all its abilities. However, Purphoros has a type-changing ability that depends on your devotion to red.\n\n**The Lecture**:\n1. **Layer 4 (Type-Changing Effects)**: Unable to Scream changes Purphoros into a Toy artifact creature. This effect is applied in Layer 4, which is before any ability-removing effects.\n   \n2. **Layer 6 (Ability-Removing Effects)**: Unable to Scream removes all abilities from Purphoros, including its devotion-based ability that would normally stop it from being a creature if your devotion to red is less than five.\n\n3. **Devotion Check**: Normally, Purphoros's ability would check your devotion to red to determine if it should be a creature. However, since Unable to Scream removes all abilities, this devotion check is irrelevant while the Aura is attached.\n\n4. **State-Based Actions**: If your devotion to red drops below five, Purphoros would typically stop being a creature. However, because Unable to Scream has already made it a creature and removed its abilities, it remains a Toy artifact creature regardless of your devotion.\n\n**The Ruling**: Purphoros remains a Toy artifact creature with base power and toughness 0/2, even if your devotion to red drops below five. The Aura does not fall off because Purphoros remains a creature due to Unable to Scream's effect.\n\n**Sources**:\n- **Rule 613.1 (Interaction of Continuous Effects)**\n- **Rule 613.3 (Layer 4: Type-Changing Effects)**\n- **Rule 613.6 (Layer 6: Ability-Adding and Ability-Removing Effects)**\n- **Rule 700.5a (Devotion Calculation)**"
  },
  {
    "id": 14,
    "question": "I have a [[Utopia Sprawl]] enchanting a [[Breeding Pool]], and play a [[Harbinger of the Seas]]; does the [[Utopia Sprawl]] stay on the land, or fall off?",
    "accepted_answer": "When you play Harbinger of the Seas, it turns your enchanted Breeding Pool into an Island, making it no longer a Forest, so Utopia Sprawl falls off and goes to the graveyard because its enchantment condition (enchanting a Forest) is no longer met. Sprawl is picky and needs a Forest; when that land stops being a Forest (due to Harbinger, Blood Moon, or Spreading Seas), the Sprawl loses its target and ceases to exist.",
    "difficulty": "hard",
    "category": "Continuous Effects, Layers & Copying",
    "owl_answer": "Squawk! A tangled web of layers. Let us untangle it.\n\nWhen you play Harbinger of the Seas, it changes all nonbasic lands into Islands. This is a subtype change applied in Layer 4, which means Breeding Pool loses its Forest type and becomes solely an Island. Utopia Sprawl, an Aura, can only enchant a Forest. If the enchanted land ceases to be a Forest, the Aura becomes illegal and must be put into the graveyard as a State-Based Action.\n\n**The Lecture**:\n1. **Initial State**: Utopia Sprawl is legally enchanting Breeding Pool because it is a Forest.\n2. **Harbinger's Effect**: When Harbinger of the Seas enters the battlefield, it changes Breeding Pool's subtype to Island, removing its Forest type.\n3. **Layer Application**: The change to Island happens in Layer 4, before any abilities are considered in Layer 6. Thus, Breeding Pool is no longer a Forest.\n4. **State-Based Actions**: Once the subtype change is applied, State-Based Actions are checked. Utopia Sprawl is now illegally attached to a non-Forest and is put into the graveyard.\n\n**The Ruling**: Utopia Sprawl falls off and is put into the graveyard because Breeding Pool is no longer a Forest.\n\n**Sources**: \n- **Rule 704.5n (SBAs - Auras)**: An Aura attached to an illegal object is put into its owner's graveyard.\n- **Rule 613.1 (Layer System)**: Subtype changes are applied in Layer 4.\n- **Rule 303.4 (Auras)**: An Aura can only enchant an object with the appropriate type."
  },
  {
    "id": 15,
    "question": "If I have a [[Chalice of the Void]] with 0 counters and my opponent plays a [[Walking Ballista]] paying 4 mana? Does the [[Ballista]] get countered? What is its CMC on the stack?",
    "accepted_answer": "No, the Walking Ballista will not be countered by a Chalice of the Void with zero counters. When a spell with X in its mana cost is on the stack, the value of X is the number chosen for it when it was cast. The mana value (formerly converted mana cost or CMC) of the spell is calculated using that chosen value for X; in this case it would be 4.",
    "difficulty": "hard",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen your opponent casts a Walking Ballista, they must declare the value of X as part of the casting process. In this case, they pay 4 mana, which means X is 2 (since the cost is {X}{X}). Therefore, the mana value of Walking Ballista on the stack is 4, not 0.\n\n**The Lecture**:\n- When a spell with {X} in its cost is cast, the value of X is determined at that moment. For Walking Ballista, if your opponent pays 4 mana, X is 2, making the total mana value 4 (Rule 107.3h).\n- Chalice of the Void with 0 charge counters will only counter spells with a mana value of 0. Since Walking Ballista's mana value is 4, it does not match the condition for Chalice of the Void to trigger its countering ability.\n- The number of charge counters on Chalice of the Void is only relevant at the time the spell is cast. Changing the number of counters afterward does not affect the ability to counter the spell (as per the official rulings on Chalice of the Void).\n\n**The Ruling**: The Walking Ballista is not countered by Chalice of the Void with 0 counters because its mana value on the stack is 4.\n\n**Sources**: \n- **Rule 107.3h (Numbers and Symbols)**: Value of X in a spell's mana cost.\n- **Rule 122.6 (Counters)**: Interaction of counters with objects entering the battlefield."
  },
  {
    "id": 16,
    "question": "I cast [[Taunting Elf]] and have a [[Jaspera Sentinel]] in play. Can I use the [[Sentinel]] ability to tap the [[Taunting Elf]] to make mana right away? Or the [[Taunting Elf]]]'s summoning sickness prevents me from that?",
    "accepted_answer": "Yes, you can use the Jaspera Sentinel to tap the Taunting Elf for mana right away. Summoning sickness only prevents a creature from attacking or using its OWN abilities if they involve the tap symbol or the untap symbol as a cost",
    "difficulty": "hard",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Read the text, boy! Read the text!\n\nThe question of whether you can use Jaspera Sentinel's ability to tap a freshly cast Taunting Elf for mana hinges on understanding the nuances of summoning sickness and the rules for tapping creatures.\n\n**The Lecture**: \nWhen a creature enters the battlefield, it is affected by summoning sickness, which prevents it from attacking or using its own abilities that require tapping (denoted by the `{T}` symbol) unless it has haste. However, summoning sickness does not prevent a creature from being tapped to pay the cost of another card's ability.\n\nIn this scenario, Jaspera Sentinel has an ability that allows you to tap an untapped creature you control, including one you haven’t controlled since the beginning of your most recent turn, to generate mana. The key here is that the ability belongs to Jaspera Sentinel, not Taunting Elf. Therefore, the summoning sickness rule does not apply to the Taunting Elf in this context because it is not using its own ability to tap; it is being tapped as a cost for another card's ability.\n\n**The Ruling**: You can indeed use Jaspera Sentinel's ability to tap the newly cast Taunting Elf for mana immediately, despite the Elf's summoning sickness.\n\n**Sources**: \n- **Rule 302.6 (Creatures)**: Summoning sickness prevents a creature from attacking or using its own tap abilities.\n- **Rule 602.5a (Activating Activated Abilities)**: A creature can be tapped for costs of other cards' abilities, even if it has summoning sickness."
  },
  {
    "id": 17,
    "question": "If I cast [[Seasoned Pyromancer]] with an exerted [[Arena of Glory]], creating 2 elemental tokens, do the tokens have haste too?",
    "accepted_answer": "No, the tokens do not have haste. Arena of Glory specifies that \"Creatures cast this way gain haste,\" which grants haste only to the Seasoned Pyromancer itself because it is the spell that was cast using the mana. The Elemental tokens are generated by a triggered ability after the Pyromancer enters the battlefield, not by the casting of the spell, so they do not receive the bonus from the land.",
    "difficulty": "hard",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Read the text, boy! Read the text!\n\nWhen you cast **Seasoned Pyromancer** using mana from an exerted **Arena of Glory**, the rules regarding how mana is spent and the resulting effects are quite specific.\n\n**The Lecture**:\n- **Arena of Glory**'s ability states that if the mana generated is spent on a creature spell, that creature gains haste until end of turn. This is a direct effect on the creature spell itself.\n- **Seasoned Pyromancer** is indeed a creature spell, so when you use the mana from Arena of Glory to cast it, the Pyromancer will gain haste.\n- However, the tokens created by the Pyromancer's ability are not part of the creature spell itself. They are a result of the triggered ability that occurs when the Pyromancer enters the battlefield.\n- The exerted mana's effect does not extend to these tokens because they are not the creature spell that was cast. The ruling is clear: if mana is spent on a noncreature spell that creates tokens, those tokens do not gain haste.\n\n**The Ruling**: The **Seasoned Pyromancer** will have haste, but the Elemental tokens it creates will not.\n\n**Sources**:\n- **Rule 702.10 (Haste)**: Haste is a static ability that allows creatures to attack or use abilities with the tap symbol immediately.\n- **Arena of Glory's Official Rulings**: Clarifies that tokens created by a spell do not gain haste unless the spell itself is a creature spell that gains haste."
  },
  {
    "id": 18,
    "question": "If I cast [[Treachery]] on an opponent's [[Eidolon of Blossoms]], do I draw a card? If so, what is the rule?",
    "accepted_answer": "Yes. You control the Eidolon as soon as Treachery enters. Then the Eidolon sees that another enchantment you control entered, and triggers. You'll draw a card. This is defined by Rule 611.3c, which establishes that continuous effects generated by a permanent apply simultaneously with its entry into the battlefield. Because the control change happens at the exact same moment Treachery lands, the game state sees you as the controller of the Eidolon in time for it to see the enchantment enter.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "By the Founders! The graveyard is not a revolving door... usually.\n\nWhen you cast **Treachery** on your opponent's **Eidolon of Blossoms**, you are engaging in a fascinating interaction involving control-changing effects and triggered abilities.\n\n**The Lecture**:\n- **Treachery** is an Aura that enchants a creature and changes control of that creature to you when it enters the battlefield. This control change is immediate and simultaneous with Treachery's entry.\n- The **Constellation** ability of **Eidolon of Blossoms** triggers whenever an enchantment enters the battlefield under your control. Since Treachery enters under your control, it triggers the Constellation ability.\n- According to the rules of control-changing effects, as soon as Treachery enters the battlefield, you gain control of the enchanted creature, in this case, the Eidolon of Blossoms. This means that when the game checks for triggers, you are the controller of the Eidolon.\n- Therefore, the Constellation ability of the Eidolon triggers for you, allowing you to draw a card.\n\n**The Ruling**: Yes, you draw a card. The control change from Treachery is immediate, and you control the Eidolon when its Constellation ability triggers.\n\n**Sources**: \n- **Rule 603.2 (Triggered Abilities)**: Explains how triggered abilities work.\n- **Rule 611.2a (Continuous Effects)**: Details how control-changing effects apply.\n- **Rule 704.5 (SBAs)**: State-Based Actions ensure the game state is checked for triggers after Treachery enters."
  },
  {
    "id": 19,
    "question": "If I cast [[Ephemerate]] on my [[Master of Waves]] with 4 Elemental tokens out, do the tokens die?",
    "accepted_answer": "No, the tokens do not die. This happens because State-Based Actions (which check for creatures with 0 toughness) are not performed in the middle of a resolving spell. Although the Master of Waves leaves play briefly (removing the +1/+1 bonus), he returns immediately. By the time the spell finishes resolving and the game actually checks the board state, the Master is back and the tokens are safe with the bonus reapplied.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "By the Founders! The graveyard is not a revolving door... usually.\n\nWhen you cast **Ephemerate** targeting your **Master of Waves**, a sequence of events unfolds that involves the interaction of zones and State-Based Actions (SBAs). Let us dissect this scenario with precision.\n\n**The Lecture**:\n1. **Ephemerate's Effect**: You exile the Master of Waves, and then it returns to the battlefield immediately. This is a single resolving action, and no player receives priority during this process.\n\n2. **Token Status During Exile**: As the Master of Waves leaves the battlefield, the Elemental tokens lose the +1/+1 bonus provided by its ability. They become 1/0 creatures. However, SBAs are not checked during the resolution of a spell or ability. This means the tokens do not immediately die when Master of Waves is exiled.\n\n3. **Master of Waves Returns**: The Master of Waves returns to the battlefield as a new object. Its \"enters the battlefield\" ability triggers, and you create a number of new Elemental tokens equal to your devotion to blue.\n\n4. **SBA Check**: Once the spell finishes resolving and a player would receive priority, SBAs are checked. At this point, the original Elemental tokens are 2/1 due to the returned Master of Waves' ability. They survive because the SBA check occurs after the Master has returned.\n\n**The Ruling**: The Elemental tokens do not die. They temporarily become 1/0 during the resolution of Ephemerate, but since SBAs are checked only after the spell resolves and Master of Waves is back, they are 2/1 and remain on the battlefield.\n\n**Sources**:\n- **Rule 704.5 (SBAs)**: State-Based Actions are checked when a player would receive priority.\n- **Rule 608.2 (Resolving Spells and Abilities)**: Spells and abilities resolve without interruption.\n- **Rule 603.2 (Triggered Abilities)**: The ability of Master of Waves triggers upon re-entry."
  },
  {
    "id": 20,
    "question": "If I cast [[Clone]] on a creature enchanted with [[Lignify]], will it copy the original creature or a 0/4 Treefolk?",
    "accepted_answer": "If you cast Clone on a creature enchanted with Lignify, your Clone will copy the original creature, not the 0/4 Treefolk, because Lignify's effect changes the creature's characteristics but isn't part of its \"copiable values\" (like name, mana cost, text, P/T from abilities) that Clone copies. Clone copies what's printed on the card, and Lignify's continuous effect is applied after the copy is made, so your Clone will be a copy of the base creature with its own abilities, not a Treefolk.",
    "difficulty": "hard",
    "category": "Continuous Effects, Layers & Copying",
    "owl_answer": "Squawk! A tangled web of layers. Let us untangle it.\n\nWhen you cast **Clone** and choose to copy a creature enchanted with **Lignify**, you must understand the interaction between copy effects and type-changing effects. **Clone** copies the *copiable values* of the creature, which are the values derived from the text printed on the original card, not the current state of the creature as modified by other effects like **Lignify**.\n\n**The Lecture**:\n1. **Clone's Copying Mechanism**: When **Clone** enters the battlefield, it copies the original characteristics of the chosen creature, as defined by the printed text on the card. This includes the name, mana cost, type, subtype, power, toughness, and any abilities printed on the card (**Rule 707.2 (Copying Objects)**).\n\n2. **Lignify's Effect**: **Lignify** is an Aura that changes the enchanted creature into a Treefolk with base power and toughness 0/4 and causes it to lose all abilities. This is a type-changing effect that applies in Layer 4, and it modifies the creature's characteristics while it is on the battlefield.\n\n3. **Interaction of Effects**: The key here is that **Clone** does not copy the current state of the creature as modified by **Lignify**. Instead, it copies the original printed characteristics of the creature. **Lignify**'s effect is not part of the copiable values because it is a temporary effect applied after the creature is on the battlefield.\n\n4. **Resulting Characteristics**: Therefore, when **Clone** enters the battlefield as a copy of the creature enchanted by **Lignify**, it will not be a 0/4 Treefolk. Instead, it will have the original characteristics of the creature as printed on the card, ignoring the effects of **Lignify**.\n\n**The Ruling**: **Clone** will copy the original creature, not the 0/4 Treefolk state imposed by **Lignify**. It will have the printed characteristics of the original creature card.\n\n**Sources**: \n- **Rule 707.2 (Copying Objects)**: Defines copiable values.\n- **Rule 613 (Interaction of Continuous Effects)**: Governs the application of layers, including type-changing effects."
  },
  {
    "id": 21,
    "question": "If [[Phantasmal Image]] is copying a black creature, can I kill it with [[Terror]]?",
    "accepted_answer": "No, you cannot kill it with Terror. This is because Phantasmal Image copies all characteristics of the original creature, including its color. Since it is now a black creature, it is not a legal target for Terror (which targets only nonblack creatures). Because you cannot legally cast the spell targeting it, the Image's 'sacrifice when targeted' ability never triggers.",
    "difficulty": "hard",
    "category": "Continuous Effects, Layers & Copying",
    "owl_answer": "Read the text, boy! Read the text!\n\nIf your **Phantasmal Image** is copying a black creature, you might think it gains all the characteristics of that creature, including its color. However, the rules of copying are more nuanced than that.\n\n**The Lecture**: \nWhen **Phantasmal Image** enters the battlefield as a copy of a creature, it copies the printed characteristics of that creature, including its color. If it copies a black creature, it becomes black. However, it also gains an additional ability: \"When this creature becomes the target of a spell or ability, sacrifice it.\"\n\nNow, let's consider **Terror**. This spell can only target nonartifact, nonblack creatures. If your **Phantasmal Image** is copying a black creature, it is indeed black, and thus **Terror** cannot legally target it. However, if the **Phantasmal Image** is copying a nonblack creature, it would be a legal target for **Terror**.\n\n**The Ruling**: If **Phantasmal Image** is copying a black creature, it cannot be targeted by **Terror** because it is black. If it is copying a nonblack creature, it can be targeted, and upon being targeted, it will be sacrificed due to its own ability.\n\n**Sources**: \n- **Rule 706.2 (Copying Objects)**: A copy acquires the characteristics of the original, including color.\n- **Rule 608.2b (Resolving Spells and Abilities)**: A spell checks for legal targets upon resolution. If all targets are illegal, the spell does not resolve."
  },
  {
    "id": 22,
    "question": "Can I destroy a [[Phantasmal Bear]] using [[Hydroblast]], since I can target it?",
    "accepted_answer": "Technically you cannot destroy Phantasmal Bear with Hydroblast, but the interaction will still cause it to die. You can legally target the Phantasmal Bear with Hydroblast (as it targets any permanent). This targeting triggers the Bear's ability, causing it to be sacrificed immediately. Since the Bear leaves the battlefield before Hydroblast resolves, the spell fails to resolve (fizzles). Thus, the Bear is removed by its own sacrifice ability, not by the Hydroblast spell effect.",
    "difficulty": "hard",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Read the text, boy! Read the text!\n\nHydroblast can indeed target any spell or permanent, not just a red one. However, it only checks the color of the target upon resolution. This means you can target Phantasmal Bear with Hydroblast, but the interaction is more nuanced than simply destroying it.\n\n**The Lecture**: \nWhen you cast Hydroblast, you choose its mode and target. You can choose the mode to \"destroy target permanent if it's red\" and target Phantasmal Bear. The Bear's ability will trigger as soon as it becomes the target of Hydroblast, causing you to sacrifice it. This ability goes on the stack above Hydroblast and resolves first, resulting in the Bear being sacrificed before Hydroblast can resolve.\n\nOnce the Bear is sacrificed, Hydroblast will attempt to resolve. However, since its target is no longer on the battlefield, the target is now illegal. According to the rules, if all targets of a spell are illegal when it tries to resolve, the spell is countered by the game rules and does nothing (Rule 608.2b).\n\n**The Ruling**: You can target Phantasmal Bear with Hydroblast, but the Bear's ability will cause it to be sacrificed before Hydroblast resolves. Hydroblast will then be countered for having no legal target, and the Bear will not be destroyed by Hydroblast.\n\n**Sources**: \n- **Rule 608.2b (Resolving Spells and Abilities)**\n- **Rule 115.2 (Targets)**"
  },
  {
    "id": 23,
    "question": "Does [[Wasteland Strangler]] need a card in exile for its ability to work? If I cast [[Strangler]] on my opponent's [[Phantasmal Bear]] while he does not have cards in exile? Can I target the bear so it dies?",
    "accepted_answer": "Yes, the Bear will die. This happens because Wasteland Strangler's ability requires you to choose a target *when the ability is put on the stack*, not when it resolves. You are allowed (and required) to target a creature even if there are no cards in exile to process. The moment you target the Phantasmal Bear, its sacrifice ability triggers and resolves immediately, killing the Bear before the Strangler's ability checks to see if you can pay the cost.",
    "difficulty": "hard",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Read the text, boy! Read the text!\n\nWasteland Strangler's ability is a classic example of targeting mechanics and processing costs. When Wasteland Strangler enters the battlefield, you may choose to put a card an opponent owns from exile into that player's graveyard. If you do, a target creature gets -3/-3 until end of turn. However, the targeting of a creature happens when the ability is put on the stack, not when it resolves.\n\n**The Lecture**:\n- When you cast Wasteland Strangler, its ability triggers and you must choose a target creature immediately. This is independent of whether you can fulfill the processing cost later.\n- You can target Phantasmal Bear with the Strangler's ability even if there are no cards in exile. The Bear's ability will trigger upon being targeted, causing it to be sacrificed before the Strangler's ability resolves.\n- The processing cost of moving a card from exile to the graveyard is checked upon resolution. If there are no cards in exile, you simply cannot pay the cost, and the ability will fail to give any creature -3/-3. However, the Bear is already gone by this point.\n\n**The Ruling**: You can target Phantasmal Bear with Wasteland Strangler's ability even if there are no cards in exile. The Bear will be sacrificed due to its own ability, and the Strangler's ability will resolve without effect since the processing cost cannot be paid.\n\n**Sources**:\n- **Rule 603.3 (Triggering Abilities)**: Abilities trigger and are put on the stack when their conditions are met.\n- **Rule 601.2c (Casting Spells and Activating Abilities)**: Targets are chosen when the ability is put on the stack.\n- **Rule 608.2b (Resolving Spells and Abilities)**: If all targets are illegal when a spell or ability resolves, it is countered."
  },
  {
    "id": 24,
    "question": "I cast [[Tidehollow Sculler]]. In response to its 'enter the battlefield' ability, I cast [[Cloudshift]] on it. What happens?",
    "accepted_answer": "You exile one card permanently and a second card temporarily. This happens because Cloudshift forces the Sculler's 'leaves' trigger to resolve before its first 'enters' trigger has grabbed a card. The return effect fires on nothing, and then the original entry trigger resolves, locking that first card away forever because its return condition has already passed. The re-entered Sculler then triggers again to take a second card normally.",
    "difficulty": "hard",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "By the Founders! The graveyard is not a revolving door... usually.\n\nWhen you cast **Tidehollow Sculler**, its \"enters the battlefield\" ability triggers, targeting an opponent's hand. However, before this ability resolves, you cast **Cloudshift** on the Sculler. This sequence of events is crucial to understanding the outcome.\n\n**The Lecture**:\n1. **Tidehollow Sculler** enters the battlefield, and its first ability triggers. This ability goes on the stack, targeting a nonland card in the opponent's hand.\n2. You respond with **Cloudshift**, exiling the Sculler and immediately returning it to the battlefield. This causes the Sculler's \"leaves the battlefield\" ability to trigger, which is placed on the stack above the \"enters the battlefield\" ability.\n3. The \"leaves the battlefield\" ability resolves first, but since the \"enters the battlefield\" ability hasn't resolved yet, there is no card to return. Thus, this ability does nothing.\n4. The Sculler re-enters the battlefield as a new object, and its \"enters the battlefield\" ability triggers again. This new trigger targets a card in the opponent's hand.\n5. The original \"enters the battlefield\" ability now resolves, exiling the chosen card indefinitely, as the Sculler that would return it is no longer the same object.\n\n**The Ruling**: The card chosen by the first \"enters the battlefield\" ability is exiled indefinitely. The card chosen by the second \"enters the battlefield\" ability is exiled until the new Sculler leaves the battlefield.\n\n**Sources**:\n- **Rule 603.2 (Triggered Abilities)**: Explains how triggered abilities are put on the stack and resolve.\n- **Rule 704.5 (SBAs)**: Discusses state-based actions and their interactions with the stack.\n- **Rule 400.7 (Zone Change)**: Details how objects become new objects when they change zones."
  },
  {
    "id": 25,
    "question": "Can I activate my [[Spellskite]] in response to my opponent trying to equip his creature with [[Shadowspear]]? Will the [[Shadowspear]] equip [[Spellskite]] instead?",
    "accepted_answer": "You can activate Spellskite, but the redirection will fail. This happens because the Equip keyword specifically targets a creature controlled by the player activating the ability. Since your opponent controls the equip ability but does not control your Spellskite, your creature is an illegal target for that specific ability. The target remains unchanged, and the Shadowspear will attach to the opponent's creature as originally intended.",
    "difficulty": "hard",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Read the text, boy! Read the text! The rules of engagement here are quite clear.\n\n**The Lecture**: \nWhen your opponent activates the equip ability of **Shadowspear**, they are attempting to attach it to a creature they control. The equip ability specifically states that it targets \"a creature you control\" (Rule 702.6a). This means that the target must be a creature under the control of the player activating the ability.\n\nNow, you might think that **Spellskite** can redirect this equip attempt to itself. However, the rules are quite strict on this matter. The equip ability can only target a creature controlled by the player activating it. Since you do not control the **Shadowspear**, you cannot change its target to **Spellskite**. The ability of **Spellskite** allows you to change the target of a spell or ability, but only if the new target is legal. In this case, **Spellskite** is not a legal target for the equip ability because you do not control the **Shadowspear**.\n\n**The Ruling**: You cannot use **Spellskite** to redirect the equip ability of **Shadowspear** to itself. The equip ability can only target a creature controlled by the player who controls the **Shadowspear**.\n\n**Sources**: \n- **Rule 702.6a (Equip)**: Equip targets a creature you control.\n- **Rule 301.5b (Artifacts)**: Equip ability attaches to a creature you control."
  },
  {
    "id": 26,
    "question": "If my opponent cast a [[Fatal Push]] on my creature, can I use [[Aether Vial]] in response to put [[Unsettled Mariner]] into play and force him to pay 1 more mana?",
    "accepted_answer": "No, the opponent does not have to pay. This happens because Unsettled Mariner triggers only at the specific moment a permanent becomes the target of a spell. By the time you receive priority to activate Aether Vial, Fatal Push has already been cast and the target established. Since the Mariner arrives on the battlefield after the targeting event has already finished, its ability effectively missed the moment to trigger.",
    "difficulty": "hard",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen your opponent casts **Fatal Push** targeting your creature, the spell is placed on the stack. At this point, you have the opportunity to respond before it resolves. You might think that flashing in an **Unsettled Mariner** with **Aether Vial** could force your opponent to pay an additional mana, but alas, it is not so simple.\n\n**The Lecture**: \n- **Fatal Push** targets your creature as it is cast. The targeting event has already occurred, and the spell is on the stack.\n- **Unsettled Mariner** has an ability that triggers when you or a permanent you control becomes the target of a spell or ability an opponent controls. However, this ability must be on the battlefield *before* the targeting event occurs to trigger.\n- If you use **Aether Vial** to put **Unsettled Mariner** onto the battlefield in response to **Fatal Push**, the Mariner's ability will not trigger because the targeting event has already passed. The Mariner was not present to witness the targeting.\n\n**The Ruling**: You cannot force your opponent to pay an additional mana by putting **Unsettled Mariner** onto the battlefield after **Fatal Push** has been cast. The Mariner's ability will not trigger in this scenario.\n\n**Sources**: \n- **Rule 603.2 (Triggered Abilities)**: Abilities that trigger when a specific event occurs must be on the battlefield before the event.\n- **Rule 601.2c (Casting Spells)**: Targets are chosen as part of casting a spell, not during its resolution."
  },
  {
    "id": 27,
    "question": "I cast [[Supernatural Stamina]] on [[Elenda, the Dusk Rose]] in response to a board wipe. When she dies and returns, does she get counters from the other creatures dying? Does the token generation count the +2/+0 buff?",
    "accepted_answer": "You create tokens based on her buffed power, but the returned Elenda receives no counters. This happens because the token generation relies on Last Known Information to check her power (including the +2/+0) at the moment of death. However, the Elenda that returns is a completely new object; she arrives after the board wipe is complete, so she effectively missed the event of the other creatures dying.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen you cast **Supernatural Stamina** on **Elenda, the Dusk Rose** in response to a board wipe, you are setting up a sequence of events that hinge on the precise timing of triggers and state-based actions.\n\n**The Lecture**:\n1. **Supernatural Stamina** grants Elenda a temporary boost of +2/+0 and a triggered ability: \"When this creature dies, return it to the battlefield tapped under its owner's control.\"\n2. When the board wipe resolves, Elenda and all other creatures die simultaneously. Elenda's death triggers two abilities: her own ability to create Vampire tokens and the ability granted by Supernatural Stamina to return her to the battlefield.\n3. **State-Based Actions** are checked after the board wipe resolves, and Elenda's triggered abilities are placed on the stack. The ability from Supernatural Stamina resolves first, returning Elenda to the battlefield tapped.\n4. Elenda's ability to create Vampire tokens uses her power as it last existed on the battlefield before she died. At that moment, her power was 3 (1 base power + 2 from Supernatural Stamina). Therefore, you will create three 1/1 white Vampire creature tokens with lifelink.\n5. As for the +1/+1 counters, Elenda's ability to gain counters from other creatures dying does trigger, but since she was not on the battlefield when the other creatures died, she does not receive any counters from their deaths.\n\n**The Ruling**: \nElenda returns to the battlefield tapped with no +1/+1 counters from the other creatures dying. You create three Vampire tokens, as her power was 3 when she last existed on the battlefield.\n\n**Sources**: \n- **Rule 603.2 (Triggered Abilities)**\n- **Rule 704.5 (SBAs)**\n- **Rule 400.7 (Last Known Information)**"
  },
  {
    "id": 28,
    "question": "Can I use the processor ability of [[Oracle of Dust]] when there is a [[Rest in Peace]] in play?",
    "accepted_answer": "Yes, you can use the ability. This works because paying a cost only requires you to attempt the specified action, even if a replacement effect changes the final outcome. When you move the opponent's card from exile to the graveyard to pay Oracle's cost, Rest in Peace intercepts it and sends it right back to exile. The game considers the cost paid because the card legally left the exile zone (becoming a new object), even though it ended up returning there immediately, allowing you to draw and discard.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen you have **Rest in Peace** on the battlefield, it creates a replacement effect that exiles any card that would be put into a graveyard from anywhere. However, the ability of **Oracle of Dust** allows you to put a card from exile into its owner's graveyard as a cost to activate its ability.\n\n**The Lecture**: \n   - **Rest in Peace**'s replacement effect only applies to cards moving to the graveyard from other zones, not from exile. Therefore, it does not interfere with the cost of **Oracle of Dust**'s ability.\n   - When you activate **Oracle of Dust**'s ability, you pay the cost by moving a card from exile to the graveyard. This action is not prevented by **Rest in Peace** because the card is already in exile, and the replacement effect of **Rest in Peace** does not apply to this movement.\n   - The cost is considered paid once the card is moved to the graveyard, and the ability resolves as normal, allowing you to draw a card and then discard a card.\n\n**The Ruling**: You can indeed use the processor ability of **Oracle of Dust** even with **Rest in Peace** in play. The cost of moving a card from exile to the graveyard is paid successfully, and the ability resolves without interference.\n\n**Sources**: \n   - **Rule 616.1f (Interaction of Replacement and/or Prevention Effects)**\n   - **Rule 603.10a (Handling Triggered Abilities)**"
  },
  {
    "id": 29,
    "question": "If I use [[Snapcaster Mage]] to flashback [[Approach of the Second Sun]], where would it go when it resolves?",
    "accepted_answer": "It will be exiled. This happens because Flashback creates a strict replacement effect: if the spell would leave the stack to go anywhere other than exile, it is exiled instead. Even though Approach of the Second Sun specifically instructs you to put it into your library, the Flashback rule intercepts that movement and forces the card into the exile zone.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "By the Founders! The graveyard is not a revolving door... usually.\n\nWhen you cast **Approach of the Second Sun** using **Snapcaster Mage**'s flashback ability, it gains the ability to be cast from the graveyard. However, this also means that it will be exiled instead of going anywhere else when it resolves, due to the nature of flashback.\n\n**The Lecture**:\n1. **Snapcaster Mage** enters the battlefield, targeting **Approach of the Second Sun** in your graveyard, granting it flashback until end of turn.\n2. You cast **Approach of the Second Sun** from your graveyard by paying its flashback cost, which is the same as its mana cost.\n3. As **Approach of the Second Sun** resolves, it checks if it was cast from your hand and if another spell named **Approach of the Second Sun** was cast this game. Since it was not cast from your hand, it does not trigger the win condition.\n4. Normally, if cast from your hand, it would be put into its owner's library seventh from the top. However, because it was cast using flashback, the flashback rule takes precedence.\n5. The flashback ability dictates that the card is exiled instead of going anywhere else when it resolves.\n\n**The Ruling**: **Approach of the Second Sun** will be exiled upon resolution due to being cast with flashback.\n\n**Sources**: \n- **Rule 702.34a (Flashback)**: Explains the mechanics of flashback and its effect on the card's destination.\n- **Rule 608.2m (Resolving Spells and Abilities)**: Confirms that a spell will resolve fully even if it leaves the stack.\n- **Rule 307.2 (Sorceries)**: Details the normal resolution process for sorceries."
  },
  {
    "id": 30,
    "question": "If a [[Field-Tested Frying Pan]] enters the battlefield while I control [[Peregrin Took]], how many food tokens would I create in total?",
    "accepted_answer": "You will create three Food tokens and one Halfling token. This happens because Field-Tested Frying Pan generates tokens using two separate instructions: first creating a Food, then creating a Halfling. Peregrin Took's replacement effect sees two distinct token-creation events and applies to each one individually, adding an extra Food to the first event (making two Foods) and an extra Food to the second event (making one Halfling and one Food).",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen the **Field-Tested Frying Pan** enters the battlefield, it triggers an ability that instructs you to create a Food token, then a 1/1 white Halfling creature token. Now, with **Peregrin Took** under your control, things get a bit more interesting.\n\n**The Lecture**: \n   - The Frying Pan's ability is a sequential action: \"create a Food token, *then* create a Halfling token.\" This means these are two separate events.\n   - **Peregrin Took**'s ability states that if one or more tokens would be created under your control, you create those tokens plus an additional Food token instead.\n   - For the first event, creating a Food token, Peregrin Took adds an additional Food token, resulting in two Food tokens.\n   - For the second event, creating a Halfling token, Peregrin Took again adds an additional Food token, resulting in one Halfling token and one more Food token.\n\n**The Ruling**: In total, you will create three Food tokens and one Halfling token.\n\n**Sources**: \n   - **Rule 616.1g (Interaction of Replacement and/or Prevention Effects)**\n   - **Rule 701.7a (Keyword Actions)**"
  },
  {
    "id": 31,
    "question": "If I manifest [[Nexus of Fate]] with [[Abhorrent Oculus]] and the manifested creature dies, will [[Nexus of Fate]]'s replacement trigger activate and put it back in library or does it simply hit the graveyard stay there?",
    "accepted_answer": "It will stay in the graveyard. This happens because face-down creatures have no text or abilities, meaning the replacement effect (shuffle into library) simply does not exist at the moment the creature dies. Since replacement effects must exist before an event occurs to modify it, the game treats it as a vanilla 2/2 dying; by the time the card is revealed in the graveyard, the transition is complete and it is too late to apply the shuffle effect.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "By the Founders! The graveyard is not a revolving door... usually.\n\nWhen you manifest a card like **Nexus of Fate** with **Abhorrent Oculus**, it becomes a face-down 2/2 creature with no name, no abilities, and no mana cost. This is crucial because the characteristics of a face-down card on the battlefield are limited to those defined by the rules for face-down permanents.\n\n**The Lecture**: \n1. **Manifestation**: When you manifest **Nexus of Fate**, it enters the battlefield face down as a 2/2 creature. At this point, it has no abilities, including its replacement effect that would shuffle it into the library if it were to go to the graveyard.\n   \n2. **Death of the Manifested Creature**: If this face-down creature dies, it is treated as a creature with no abilities at the time of its death. The replacement effect of **Nexus of Fate** is not active because the card is face down and has no abilities.\n\n3. **Revealing the Card**: Upon leaving the battlefield, you must reveal the face-down card. However, revealing it does not retroactively apply its abilities to the event of it dying. The replacement effect is not considered because it was not active when the card was face down.\n\n**The Ruling**: The manifested **Nexus of Fate** will go to the graveyard and stay there. Its replacement effect does not apply because it was face down and had no abilities at the time of its death.\n\n**Sources**: \n- **Rule 701.24c (Keyword Actions)**: Replacement effects must be active at the time of the event they replace.\n- **Rule 603.10a (Handling Triggered Abilities)**: Zone-change triggers look back in time, but replacement effects do not.\n- **Face-Down Characteristics**: Face-down cards have no abilities on the battlefield."
  },
  {
    "id": 32,
    "question": "If I turn a manifested creature face-up in response to [[Path to Exile]], does the spell fizzle?",
    "accepted_answer": "The creature will be exiled. This happens because turning a creature face-up does not make it a new object; it remains the exact same permanent on the battlefield, merely changing its visible characteristics. Since the creature is still a legal target for the spell (it is still a creature and usually hasn't gained protection or hexproof), Path to Exile resolves and exiles it normally.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "By the Founders! The graveyard is not a revolving door... usually.\n\nWhen you manifest a card, it enters the battlefield face-down as a 2/2 creature with no name or abilities. If you turn a manifested creature face-up, it reveals its true identity, which could be a creature, instant, or sorcery. In this scenario, you are turning a manifested creature face-up in response to **Path to Exile**.\n\n**The Lecture**:\n1. **Path to Exile** targets a creature. You have the opportunity to respond before it resolves.\n2. You choose to turn the manifested creature face-up. If the card is a creature, it remains on the battlefield with its true characteristics.\n3. If the card is an instant or sorcery, it cannot exist face-up on the battlefield. According to the rules, it is revealed and remains face-down (Rule 701.40g).\n4. **Path to Exile** checks its target upon resolution. If the target is still a creature, it will resolve normally. If the target is no longer a creature (because it was an instant or sorcery), **Path to Exile** will have an illegal target and will fizzle, meaning it will not resolve and no land search will occur.\n\n**The Ruling**: If the manifested card is a creature, **Path to Exile** will resolve and exile it. If the manifested card is an instant or sorcery, **Path to Exile** will fizzle due to an illegal target.\n\n**Sources**: \n- **Rule 701.40g (Keyword Actions)**: Face-up instants or sorceries remain face-down.\n- **Rule 701.40f (Keyword Actions)**: Manifested cards that cannot exist face-up remain face-down.\n- **Rule 608.2b (Resolving Spells and Abilities)**: A spell with an illegal target does not resolve."
  },
  {
    "id": 33,
    "question": "If [[Brawn]] is in my graveyard and I control only a [[Snow-Covered Forest]], will my creatures still have Trample?",
    "accepted_answer": "Yes, your creatures will have trample. This happens because Brawn's ability checks for the subtype Forest, not for a card specifically named Forest. Since Snow-Covered Forests possess the Forest subtype line, they satisfy the condition required to grant the bonus.",
    "difficulty": "hard",
    "category": "Continuous Effects, Layers & Copying",
    "owl_answer": "Squawk! A tangled web of layers. Let us untangle it.\n\nWhen considering whether your creatures gain trample from Brawn in the graveyard, we must examine the conditions required for its ability to function. Brawn's ability states that as long as it is in your graveyard and you control a Forest, your creatures have trample.\n\n**The Lecture**:\n1. **Subtype Matching**: The ability of Brawn requires you to control a \"Forest\". According to the rules, a \"Snow-Covered Forest\" is indeed a Forest because it has \"Forest\" in its type line. This is a straightforward application of subtype matching, where the presence of the word \"Forest\" in the type line satisfies the condition for Brawn's ability to be active.\n\n2. **Layer Logic**: The ability of Brawn is a static ability that functions from the graveyard, and it checks continuously whether the condition (controlling a Forest) is met. Since a Snow-Covered Forest is a Forest, the condition is satisfied.\n\n3. **Common Misconceptions**: Some might mistakenly believe that the \"Snow-Covered\" supertype affects the basic type functionality, but it does not. The supertype \"Snow\" has no bearing on the subtype \"Forest\" for the purposes of abilities like Brawn's.\n\n**The Ruling**: Yes, if Brawn is in your graveyard and you control a Snow-Covered Forest, your creatures will indeed have trample.\n\n**Sources**:\n- **Rule 702.19a (Keyword Abilities)**: Trample is a static ability.\n- **Rule 702.14d (Keyword Abilities)**: Subtype matching for landwalk abilities.\n- **Subtype Matching Precedent**: Snow-Covered Forest is a Forest."
  },
  {
    "id": 34,
    "question": "If I have a [[Cecil, Dark Knight]] transformed into [[Cecil, Redeemed Paladin]], can I play a second [[Cecil, Dark Knight]] or will the legend rule make me sacrifice one?",
    "accepted_answer": "You can keep both. This happens because the Legend Rule applies only when you control two or more legendary permanents with the exact same name. Since the transformed side (Cecil, Redeemed Paladin) has a completely different name than the front side of the new copy (Cecil, Dark Knight), the game treats them as distinct entities, allowing them to coexist on the battlefield.",
    "difficulty": "hard",
    "category": "Continuous Effects, Layers & Copying",
    "owl_answer": "By the Founders! The graveyard is not a revolving door... usually.\n\n**The Lecture**: \nWhen dealing with legendary permanents, the \"legend rule\" is a crucial consideration. According to the rules, if a player controls two or more legendary permanents with the same name, they must choose one to keep, and the rest are put into their owners' graveyards (**Rule 704.5j (State-Based Actions)**). However, the legend rule only applies if the permanents share the exact English name.\n\nIn your scenario, you have a transformed **Cecil, Redeemed Paladin** on the battlefield. This is the back face of the double-faced card **Cecil, Dark Knight // Cecil, Redeemed Paladin**. If you attempt to play another **Cecil, Dark Knight**, you must consider the names. The front face is **Cecil, Dark Knight**, and the back face is **Cecil, Redeemed Paladin**. These are considered different names for the purposes of the legend rule.\n\n**The Ruling**: You may indeed play a second **Cecil, Dark Knight** while controlling **Cecil, Redeemed Paladin**. The legend rule does not apply because they do not share the exact same name.\n\n**Sources**: \n- **Rule 704.5j (State-Based Actions)**: The legend rule.\n- **Legal Principle: Protection & Interaction (Axiom 8)**: The Legend Rule applies only if two permanents share the exact English name."
  },
  {
    "id": 35,
    "question": "I cast a [[Clown Car]], while I control [[Omarthis, Ghostfire Initiate]]. Will [[Omarthis]] get a counter for each counter [[Clown Car]] gets or just one?",
    "accepted_answer": "Just one counter. This happens because Omarthis triggers whenever one or more counters are placed, treating the simultaneous placement of multiple counters as a single event. Since Clown Car enters with all its counters at the exact same moment, Omarthis sees this as a single instance of adding counters and triggers only once, regardless of how large X is.",
    "difficulty": "hard",
    "category": "Continuous Effects, Layers & Copying",
    "owl_answer": "Squawk! A tangled web of layers. Let us untangle it.\n\nWhen you cast Clown Car, it enters the battlefield with a number of +1/+1 counters equal to the number of even results from the dice rolls. Omarthis, Ghostfire Initiate has an ability that triggers whenever you put one or more +1/+1 counters on another colorless creature. \n\n**The Lecture**: \n- When Clown Car enters the battlefield, you roll X six-sided dice. For each even result, you place a +1/+1 counter on Clown Car.\n- The act of placing these counters is considered a single event, as per the principle of Batch Counters. This means that all the counters are placed simultaneously, not one at a time.\n- Omarthis's ability triggers when you put one or more counters on another colorless creature. However, because the counters are placed as a single event, Omarthis's ability will trigger only once, regardless of how many counters Clown Car receives.\n\n**The Ruling**: Omarthis will get only one +1/+1 counter, no matter how many counters Clown Car receives.\n\n**Sources**: \n- **Rule 122.8 (Counters)**: Clarifies that moving counters is a single event.\n- **Rule 603.2 (Triggered Abilities)**: Explains how triggered abilities function when conditions are met."
  },
  {
    "id": 36,
    "question": "If my opponent has a [[Platinum Emperion]] out and I attack with [[Etali, Primal Sickness]] and they didn't block, would they still get the poison counters even though their life total can't change?",
    "accepted_answer": "Yes, they will get the counters and lose the game. This happens because Platinum Emperion prevents changes to life totals but does not prevent damage from being dealt. Etali successfully deals its damage (even though the life total doesn't change), triggering its ability to assign 11 poison counters. Since poison counters function independently of life totals, they are applied normally, and the opponent immediately dies from having 10 or more poison counters.",
    "difficulty": "hard",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nWhen you attack with Etali, Primal Sickness and your opponent does not block, the damage is dealt directly to them. Etali's ability states that whenever it deals combat damage to a player, they receive that many poison counters. Now, you might be wondering about the interaction with Platinum Emperion, which prevents life total changes.\n\n**The Lecture**: \n   - Etali, Primal Sickness has Trample and an ability that gives poison counters equal to the damage dealt.\n   - Platinum Emperion's ability prevents changes to life totals, but it does not prevent damage from being dealt. It merely alters the outcome of that damage by ensuring the life total remains unchanged.\n   - Poison counters are not related to life total changes. They are a separate consequence of damage dealt by a source with the appropriate ability, such as infect or Etali's poison counter ability.\n   - Therefore, when Etali deals combat damage, the opponent receives poison counters equal to the damage dealt, regardless of Platinum Emperion's effect on life totals.\n\n**The Ruling**: Your opponent will indeed receive 11 poison counters from Etali, Primal Sickness, despite Platinum Emperion's presence. The life total remains unchanged, but poison counters are applied as they are not a life total change.\n\n**Sources**: \n   - **Rule 702.90b (Keyword Abilities)**: Damage dealt to a player by a source with infect doesn’t cause that player to lose life. Rather, it causes that source’s controller to give the player that many poison counters.\n   - **Rule 104.3d (Ending the Game)**: If a player has ten or more poison counters, that player loses the game the next time a player would receive priority."
  },
  {
    "id": 37,
    "question": "If I have a [[Tajuru Blightblade]] and cast [[Blizzard Brawl]] targetting it and a 5/5 creature, does [[Blightblade]] kill that creature?",
    "accepted_answer": "Yes, the 5/5 creature will die. This happens because the Fight mechanic causes the creatures to deal damage equal to their power to each other directly. Since Tajuru Blightblade has Deathtouch, any amount of damage it deals is considered lethal. Even if the Blightblade dies from the 5 damage it takes in return (assuming you don't meet the Snow requirement for Indestructible), the 1 damage it inflicts is enough to destroy the opponent's creature.",
    "difficulty": "hard",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nIn this scenario, you are casting **Blizzard Brawl**, a snow sorcery, targeting your **Tajuru Blightblade** and an opposing 5/5 creature. The key here is understanding how the fight mechanic and deathtouch interact.\n\n**The Lecture**:\n1. **Blizzard Brawl** resolves, and you check if you control three or more snow permanents. If you do, your **Tajuru Blightblade** gains +1/+0 and indestructible until end of turn. However, even without these bonuses, the fight will proceed.\n   \n2. During the fight, each creature deals damage equal to its power to the other. Your **Tajuru Blightblade** has deathtouch, which means any amount of damage it deals to a creature is lethal. According to **Rule 702.2b (Keyword Abilities)**, a creature dealt damage by a source with deathtouch is destroyed as a state-based action.\n\n3. The 5/5 creature will deal 5 damage to the **Tajuru Blightblade**. If the Blightblade has indestructible, it will survive; otherwise, it will be destroyed due to having lethal damage marked on it.\n\n4. The 5/5 creature, having been dealt damage by a creature with deathtouch, will be destroyed as a state-based action, regardless of its toughness.\n\n**The Ruling**: Yes, the **Tajuru Blightblade** will kill the 5/5 creature due to its deathtouch ability. The 5/5 creature will be destroyed after the fight resolves, assuming no other effects prevent this.\n\n**Sources**: \n- **Rule 702.2b (Keyword Abilities)**: Deathtouch and its interaction with damage.\n- **Rule 120.5 (Damage)**: Damage and state-based actions."
  },
  {
    "id": 38,
    "question": "If I have a [[Phyrexian Obliterator]] and cast [[Blizzard Brawl]] targetting it and a 5/5 creature, does my opponent have to sacrifice 5 permanents?",
    "accepted_answer": "Yes, the opponent must sacrifice 5 permanents. This happens because the Fight mechanic causes the creatures to deal damage to each other directly. Even though you cast the spell, the damage dealt to your Phyrexian Obliterator comes from the opponent's creature (the source). Since the Obliterator triggers whenever a source deals damage to it, the ability activates and forces the controller of that source (your opponent) to sacrifice permanents equal to the damage dealt.",
    "difficulty": "hard",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nWhen you cast **Blizzard Brawl**, you must choose two targets: a creature you control and a creature you don't control. In this scenario, you target your **Phyrexian Obliterator** and an opponent's 5/5 creature. The spell will resolve if both targets are still legal at that time.\n\n**The Lecture**:\n1. **Targeting and Resolution**: As you cast **Blizzard Brawl**, you select the targets. The spell checks for the legality of these targets upon resolution. If both targets are still legal, the spell proceeds to resolve.\n\n2. **Indestructible Bonus**: If you control three or more snow permanents, your **Phyrexian Obliterator** will gain +1/+0 and indestructible until end of turn. This bonus is checked and applied during resolution, not before.\n\n3. **The Fight Mechanic**: The creatures then fight, meaning they deal damage equal to their power to each other. Your **Phyrexian Obliterator** will deal 5 damage to the opponent's creature, and the opponent's creature will deal 5 damage to your Obliterator.\n\n4. **Obliterator's Trigger**: When the opponent's creature deals damage to **Phyrexian Obliterator**, its ability triggers. The source of the damage is the opponent's creature, so the opponent must sacrifice a number of permanents equal to the damage dealt, which is 5 in this case.\n\n**The Ruling**: Yes, your opponent must sacrifice 5 permanents due to the damage dealt to **Phyrexian Obliterator** during the fight.\n\n**Sources**:\n- **Rule 701.21a (Keyword Actions)**: Sacrificing a permanent.\n- **Rule 120.5 (Damage)**: Damage and state-based actions.\n- **Rule 608.3a (Resolving Spells and Abilities)**: Target legality upon resolution."
  },
  {
    "id": 39,
    "question": "I control [[Ghostly Prison]] and activate [[Nahiri, the Unforgiving]] +1 ability. Does this force my opponent to pay 2 mana to attack me?",
    "accepted_answer": "No, they do not have to pay. This happens because the rules for combat requirements state that a player is never forced to pay a cost (like mana or life) to fulfill a requirement to attack. Your opponent can simply choose not to pay the 2. However, if there is another opponent they can attack for free (in a multiplayer game), they must attack that player to satisfy Nahiri's requirement.",
    "difficulty": "hard",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Read the text, boy! Read the text!\n\nYour question involves the interaction between **Ghostly Prison** and **Nahiri, the Unforgiving**'s first ability. Let's dissect this scenario with precision.\n\n**The Lecture**:\n- **Ghostly Prison** imposes a cost on your opponent's creatures if they wish to attack you. Specifically, they must pay {2} for each creature they control that's attacking you.\n- **Nahiri, the Unforgiving**'s first ability states that a target creature must attack a player each combat if able. However, it does not force the payment of costs associated with attacking.\n- According to the rules, if a creature is required to attack but there is a cost associated with that attack, the controller of the creature is not forced to pay that cost. If they choose not to pay, the creature simply does not attack (Rule 508.1h, Declare Attackers Step).\n\n**The Ruling**:\nYour opponent is not forced to pay the {2} mana required by **Ghostly Prison** to attack you. If they choose not to pay, the creature does not attack, even if **Nahiri**'s ability is in effect.\n\n**Sources**:\n- **Rule 508.1h (Declare Attackers Step)**: Costs to attack are determined and locked in, but not forced.\n- **Rule 118.3c (Costs)**: Paying costs is not mandatory."
  },
  {
    "id": 40,
    "question": "If [[Blightbeetle]] blocks a green creature with trample, is the excess damage still applied to the defending player?",
    "accepted_answer": "Yes, the excess damage hits the player. This happens because Trample assigns damage based on the blocker's toughness, ignoring prevention effects like Protection. The green creature assigns just enough damage to kill the Blightbeetle (normally 1 damage), and the rest tramples over. The damage assigned to the Beetle is prevented.",
    "difficulty": "hard",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nWhen Blightbeetle, a creature with protection from green, blocks a green creature with trample, the interaction of trample and protection must be carefully considered.\n\n**The Lecture**: \n1. **Blocking and Protection**: Blightbeetle's protection from green means it cannot be dealt damage by green sources. However, it can still block a green creature. The protection ability will prevent any damage from being dealt to Blightbeetle by the green creature.\n\n2. **Trample Mechanics**: According to the rules of trample, the attacking creature must assign lethal damage to the blocker before any excess damage can be assigned to the defending player or planeswalker (**Rule 702.19b (Keyword Abilities)**). In this case, lethal damage to Blightbeetle is considered to be 1, as it is a 1/1 creature.\n\n3. **Damage Assignment**: Even though Blightbeetle's protection from green will prevent the damage from being dealt, the attacking creature with trample must still assign at least 1 damage to Blightbeetle. Once this is done, any remaining damage can be assigned to the defending player.\n\n4. **Damage Prevention**: The damage assigned to Blightbeetle is prevented due to its protection ability, but this does not affect the assignment of excess damage to the player. The rules of trample allow for excess damage to be assigned once lethal damage has been assigned, regardless of whether that damage is actually dealt or prevented.\n\n**The Ruling**: Yes, the excess damage from the green creature with trample is still applied to the defending player, as long as lethal damage (1 in this case) is assigned to Blightbeetle first, even though that damage will be prevented.\n\n**Sources**: \n- **Rule 702.19b (Keyword Abilities)**: Trample damage assignment.\n- **Rule 702.19d (Keyword Abilities)**: Trample damage assignment when no blockers remain.\n- **Rule 510.1c (Combat Damage Step)**: Damage assignment for blocked creatures."
  },
  {
    "id": 41,
    "question": "Do I need to have [[The Omenkeel]] in play to play the lands exiled with it?",
    "accepted_answer": "No, you do not need it in play. This happens because the permission to play the lands is part of the triggered ability's resolution, not a separate static ability. When the ability resolves, it sets up a lasting permission that applies to those specific cards for as long as they remain exiled. Even if The Omenkeel leaves the battlefield, that permission persists.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "By the Founders! The graveyard is not a revolving door... usually.\n\nWhen it comes to The Omenkeel, the question of whether you need it on the battlefield to play lands exiled with it is a common misconception. Let us dissect this interaction with precision.\n\n**The Lecture**:\nThe Omenkeel, as a Vehicle, has an ability that triggers whenever a Vehicle you control deals combat damage to a player. This ability causes that player to exile cards from the top of their library equal to the damage dealt. The critical part of this ability is that it allows you to play lands from among those exiled cards for as long as they remain exiled.\n\nNow, the key point here is the phrase \"for as long as they remain exiled.\" This means that the ability to play those lands is tied to the cards themselves being in exile, not to The Omenkeel remaining on the battlefield. Once the cards are exiled, the permission to play them is granted and persists independently of The Omenkeel's presence on the battlefield.\n\n**The Ruling**:\nNo, you do not need to have The Omenkeel in play to play the lands exiled with it. The ability to play those lands is linked to the cards in exile, not to The Omenkeel itself.\n\n**Sources**:\n- **Rule 607.2a (Linked Abilities)**: This rule clarifies that abilities referring to \"the exiled cards\" are linked to the cards in exile, not the object that exiled them.\n- **Rule 406.5 (Exile)**: This rule emphasizes the importance of keeping track of exiled cards and their potential impact on the game, independent of the exiling source."
  },
  {
    "id": 42,
    "question": "Can I play [[Consign to Memory]] to counter the Ward ability of [[Kappa Cannoneer]] after I play [[Dismember]]?",
    "accepted_answer": "Yes, you can. This happens because Ward is a triggered ability, and Consign to Memory has a mode that specifically counters target triggered ability. You can legally target and counter the Ward trigger, removing the requirement to pay 4.",
    "difficulty": "hard",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen you cast **Dismember** targeting **Kappa Cannoneer**, the Ward ability of the Cannoneer triggers. This is because Ward is a triggered ability that activates whenever the Cannoneer becomes the target of a spell or ability an opponent controls. The Ward ability will go on the stack above your **Dismember**.\n\n**The Lecture**:\n1. **Casting Dismember**: You target the Kappa Cannoneer with **Dismember**. The Ward ability triggers and is placed on the stack above **Dismember**.\n2. **Ward Trigger**: The Ward ability demands a payment of {4} mana to prevent the spell from being countered. This is a triggered ability, and it uses the stack.\n3. **Consign to Memory**: You can cast **Consign to Memory** targeting the Ward trigger. Since Ward is a triggered ability, **Consign to Memory** can indeed counter it. This is because **Consign to Memory** specifically counters triggered abilities, as per its text.\n\n**The Ruling**: Yes, you can play **Consign to Memory** to counter the Ward ability of **Kappa Cannoneer** after you play **Dismember**. If you successfully counter the Ward trigger, you do not have to pay the {4} mana, and **Dismember** will resolve, giving the Cannoneer -5/-5 until end of turn.\n\n**Sources**:\n- **Rule 702.21a (Ward)**: Ward is a triggered ability that can be countered.\n- **Rule 603.2 (Triggered Abilities)**: Triggered abilities use the stack and can be responded to.\n- **Rule 116.1a (Timing and Priority)**: Players receive priority to cast spells and activate abilities."
  },
  {
    "id": 43,
    "question": "If I control an [[Encroaching Mycosynth]], does [[Karn, the Great Creator]] -2 ability allow me to get a non-artifact card from my sideboard/outside the game?",
    "accepted_answer": "No, you cannot get non-artifact cards from your sideboard. This happens because static abilities on the battlefield (like Encroaching Mycosynth) only affect objects within the game's zones (Library, Hand, Graveyard, Exile, Stack, Command). The sideboard is considered \"outside the game,\" so the cards there remain unchanged. You can still only fetch cards that are naturally artifacts.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Squawk! A tangled web of layers. Let us untangle it.\n\nWhen you control an **Encroaching Mycosynth**, it indeed turns all nonland permanents you control into artifacts, and this effect extends to permanent spells you control and nonland permanent cards you own in other zones. However, the sideboard is a special case.\n\n**The Lecture**: \n   - **Encroaching Mycosynth** affects cards in zones like the battlefield, your hand, and your graveyard, but it does not extend its reach to the sideboard. The sideboard is considered a \"hidden zone\" outside the game, and effects that apply to cards in the game do not apply to cards outside the game unless explicitly stated.\n   - **Karn, the Great Creator**'s -2 ability allows you to fetch an artifact card from outside the game. However, since **Encroaching Mycosynth** does not affect the sideboard, it does not turn those cards into artifacts.\n   - Therefore, you cannot use Karn's ability to retrieve a non-artifact card from your sideboard, even if you control an Encroaching Mycosynth.\n\n**The Ruling**: You cannot use Karn's -2 ability to get a non-artifact card from your sideboard, even with Encroaching Mycosynth in play. The sideboard remains unaffected by Mycosynth's artifact-creating effect.\n\n**Sources**: \n   - **Rule 701.23j (Keyword Actions)**: Searching outside the game.\n   - **Rule 903.11 (Commander)**: Restrictions on bringing cards from outside the game.\n   - **Encroaching Mycosynth's Official Rulings**: Clarification on its effect scope."
  },
  {
    "id": 44,
    "question": "If I target my [[Walking Ballista]] with [[Heliod, Sun-Crowned]] ability, does [[Ballista]] go infinite?",
    "accepted_answer": "Yes, this creates an infinite damage loop, provided Walking Ballista has at least two +1/+1 counters. This happens because Heliod grants the Ballista Lifelink. When you remove a counter to deal damage, you gain life, which triggers Heliod to put a +1/+1 counter back on the Ballista. This effectively refunds the cost of the ability, allowing you to repeat the process indefinitely until you win. The Ballista must be a 2/2 or larger so it doesn't die when you remove the first counter.",
    "difficulty": "hard",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen you target your **Walking Ballista** with **Heliod, Sun-Crowned**'s ability to give it lifelink, you set the stage for a potentially infinite loop, but only under specific conditions.\n\n**The Lecture**:\n1. **Initial Setup**: You have a **Walking Ballista** with at least two +1/+1 counters on it. You activate **Heliod, Sun-Crowned**'s ability, targeting the Ballista to give it lifelink until end of turn.\n\n2. **Activation and Resolution**: Once the Ballista has lifelink, you can remove a +1/+1 counter from it to deal 1 damage to any target. Because it has lifelink, dealing this damage causes you to gain 1 life.\n\n3. **Heliod's Trigger**: Heliod's ability triggers whenever you gain life, allowing you to put a +1/+1 counter on target creature or enchantment you control. You choose the Ballista as the target.\n\n4. **Loop Potential**: If you can continuously remove a counter to deal damage and gain life, Heliod's ability will replace the counter you removed, allowing you to repeat the process. This creates a loop where you can deal infinite damage, provided you have a legal target for the damage and the Ballista remains on the battlefield.\n\n**The Ruling**: Yes, under these conditions, the Ballista can go infinite. You need at least two counters to start, and you must have a legal target for the damage each time. The loop continues until you choose to stop or run out of legal targets.\n\n**Sources**:\n- **Rule 115.9a (Targets)**: Clarifies targeting mechanics.\n- **Rule 601.2c (Casting Spells)**: Details the process of choosing targets.\n- **Rule 704.5 (SBAs)**: State-Based Actions ensure the Ballista remains on the battlefield as long as it has at least one counter."
  },
  {
    "id": 45,
    "question": "If I cast [[Sculpting Steel]] as a copy of [[Cityscape Leveler]], do I get the 'When you cast this spell' trigger?",
    "accepted_answer": "No, you do not get the trigger. This happens because 'When you cast this spell' triggers fire the moment the spell is placed on the stack. At that specific moment, the card is still just Sculpting Steel and does not have the text of the Leveler. It only becomes a copy as it resolves and enters the battlefield, which is long after the cast event has already occurred.",
    "difficulty": "hard",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Read the text, boy! Read the text!\n\nWhen you cast **Sculpting Steel** and choose to have it enter as a copy of **Cityscape Leveler**, you are not casting the Leveler itself. Instead, you are casting Sculpting Steel, which then enters the battlefield as a copy of the Leveler. This distinction is crucial.\n\n**The Lecture**:\n- **Sculpting Steel** is cast as a spell, and during its resolution, you choose an artifact for it to copy. In this case, you choose **Cityscape Leveler**.\n- The \"When you cast this spell\" ability on **Cityscape Leveler** is tied to the act of casting the Leveler itself, not to the act of copying it. Since you are casting **Sculpting Steel**, not **Cityscape Leveler**, the \"When you cast this spell\" ability does not trigger.\n- The copy effect takes place as **Sculpting Steel** enters the battlefield, not during the casting process. Therefore, any abilities that trigger \"when you cast\" are not applicable to the copied object.\n\n**The Ruling**: You do not get the \"When you cast this spell\" trigger from **Cityscape Leveler** when you cast **Sculpting Steel** as a copy of it.\n\n**Sources**: \n- **Rule 706.2 (Copying Objects)**: A copy acquires the printed text of the original card.\n- **Rule 603.2 (Triggered Abilities)**: Abilities that trigger on casting a spell do so when the spell is cast, not when a copy enters the battlefield."
  },
  {
    "id": 46,
    "question": "I have a [[Vodalian Hexcatcher]] in play and multiple other merfolk creatures, and my opponent plays a noncreature spell. Can I sacrifice a merfolk then if my opponent decides to pay 1, sacrifice another one, and so on?",
    "accepted_answer": "This happens because objects on the stack resolve individually, and players receive priority again after each resolution. When your first activation resolves and the opponent pays the 1, their original spell is still on the stack waiting to resolve. Before it can resolve, the game must pass priority to you again, giving you the opportunity to activate the Hexcatcher a second time, sacrifice another Merfolk, and force them to pay another 1. You can repeat this taxing process until you run out of Merfolk or they run out of mana.",
    "difficulty": "hard",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen your opponent casts a noncreature spell, you have the opportunity to respond with Vodalian Hexcatcher's ability. This ability allows you to sacrifice a Merfolk to counter the spell unless your opponent pays {1}. \n\n**The Lecture**: \n- When your opponent casts their noncreature spell, it goes onto the stack, and you gain priority to respond.\n- You may activate Vodalian Hexcatcher's ability by sacrificing a Merfolk. This ability then goes onto the stack above the noncreature spell.\n- Your opponent must decide whether to pay {1} to prevent the spell from being countered. If they pay, the ability resolves without effect.\n- If they pay, you regain priority. You can activate Vodalian Hexcatcher's ability again by sacrificing another Merfolk, putting another instance of the ability on the stack.\n- This process can repeat as long as you have Merfolk to sacrifice and your opponent has mana to pay.\n\n**The Ruling**: You can indeed sacrifice multiple Merfolk, one at a time, each time your opponent decides to pay {1} to keep their spell from being countered. This continues until either you run out of Merfolk or your opponent runs out of mana.\n\n**Sources**: \n- **Rule 702.119c (Keyword Abilities)**: Sacrificing is part of the cost.\n- **Rule 116.2e (Special Actions)**: You can take actions any time you have priority.\n- **Rule 118.10 (Costs)**: Each payment of a cost applies to only one spell or ability."
  },
  {
    "id": 47,
    "question": "I control four copies of [[Hare Apparent]] and cast [[Ghostway]]. When they all return to the battlefield simultaneously, how many tokens do I create? Does each Hare see the other three?",
    "accepted_answer": "Yes, you are correct; you will create 12 tokens. This happens because when multiple creatures enter the battlefield at the same time, they all \"see\" each other for the purpose of triggering abilities. Each of the four Hare Apparents looks at the board, sees exactly three other Hare Apparents entering alongside it, and triggers to create three tokens.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Squawk! A tangled web of layers. Let us untangle it.\n\nWhen you cast **Ghostway**, each of your **Hare Apparent** creatures is exiled and then returns to the battlefield at the beginning of the next end step. The key here is understanding how simultaneous events interact with triggered abilities.\n\n**The Lecture**:\n1. **Exile and Return**: When you cast **Ghostway**, all your creatures, including the four **Hare Apparent**, are exiled. They return to the battlefield simultaneously at the beginning of the next end step.\n\n2. **Simultaneous Entry**: As they return, each **Hare Apparent** sees the others entering the battlefield at the same time. This is crucial because the ability of **Hare Apparent** triggers based on the number of other creatures named **Hare Apparent** you control.\n\n3. **Triggering the Ability**: Each **Hare Apparent** will trigger its ability based on the presence of the other three. Therefore, each one will create three 1/1 white Rabbit creature tokens.\n\n4. **Resolution of Triggers**: The triggers resolve independently, but since they all see the same number of **Hare Apparent** at the time of triggering, each will create three tokens.\n\n**The Ruling**: You will create a total of 12 Rabbit tokens. Each of the four **Hare Apparent** creates three tokens, seeing the other three as they enter the battlefield simultaneously.\n\n**Sources**:\n- **Rule 603.6 (Triggered Abilities)**: Explains how abilities trigger when conditions are met.\n- **Rule 603.10 (Handling Simultaneous Triggers)**: Details how multiple triggers are handled when they occur simultaneously."
  },
  {
    "id": 48,
    "question": "I am casting an opponent's card exiled with [[Gonti, Lord of Luxury]]. In response, he plays [[Aven Interrupter]] targeting that spell. Does the card go to my exile or the owner's exile, and who gets to cast it later?",
    "accepted_answer": "It goes to the owner's exile, and the owner gets to cast it later. This happens because Aven Interrupter causes the spell to become Plotted. The rules for the Plot mechanic specifically state that the card's owner (not the player who controlled the spell on the stack) gains the permission to cast it from exile on a later turn without paying its mana cost.",
    "difficulty": "hard",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen you cast a card exiled with Gonti, Lord of Luxury, it is indeed a spell on the stack. If your opponent responds with Aven Interrupter, targeting that spell, the Interrupter's ability will exile the spell, making it \"plotted.\" This is a critical moment where the ownership and control of the spell's future are determined.\n\n**The Lecture**:\n1. **Casting the Exiled Card**: You, the player who exiled the card with Gonti, are allowed to cast it as long as it remains exiled. This is because Gonti's ability specifically grants you the right to cast the card, regardless of Gonti's presence on the battlefield.\n\n2. **Aven Interrupter's Trigger**: When Aven Interrupter enters the battlefield, its ability triggers and targets the spell you are casting. This ability exiles the spell, and it becomes \"plotted.\" According to the rules, the plotted card is exiled under the control of the player who cast the Aven Interrupter, not the original owner of the card.\n\n3. **Ownership vs. Control**: The card remains owned by your opponent, but the ability to cast it as a plotted card is now determined by the Aven Interrupter's effect. The card is exiled in a manner that allows the owner to cast it as a sorcery on a later turn without paying its mana cost.\n\n**The Ruling**: The card goes to your opponent's exile, and they gain the ability to cast it later as a plotted card. You lose the ability to cast it once it is exiled by Aven Interrupter.\n\n**Sources**:\n- **Rule 406.3 (Exile)**: Cards exiled face down can only be examined by the player allowed to do so.\n- **Rule 406.4 (Exile)**: Face-down cards in exile are kept in separate piles based on when and how they were exiled.\n- **Rule 601.2 (Casting Spells)**: The process of casting a spell, including choosing targets and paying costs."
  },
  {
    "id": 49,
    "question": "I control [[Nomads en-Kor]] and [[Needletooth Raptor]], and my opponent casts a spell that deals 2 damage to all creatures. If I activate [[Nomads en-Kor]] twice to redirect the damage it would take to the [[Needletooth Raptor]], will its Enrage ability trigger one, two, or three times?",
    "accepted_answer": "It triggers just once. This happens because damage redirection creates a replacement effect that modifies the original damage event without splitting it up. The game sees a single simultaneous event where the spell deals 0 damage to the Nomads and 4 damage (2 natural + 2 redirected) to the Needletooth Raptor.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nIn this scenario, you have a spell dealing 2 damage to all creatures, and you wish to redirect the damage from **Nomads en-Kor** to **Needletooth Raptor**. Let's dissect this interaction.\n\n**The Lecture**:\n1. **Initial Damage Assignment**: The spell initially assigns 2 damage to both **Nomads en-Kor** and **Needletooth Raptor**. \n\n2. **Nomads en-Kor's Ability**: You activate **Nomads en-Kor**'s ability twice, each time redirecting 1 damage from itself to **Needletooth Raptor**. This means that instead of taking 2 damage, **Nomads en-Kor** takes none, and **Needletooth Raptor** is set to take 4 damage in total (2 from the spell, plus 2 redirected).\n\n3. **Damage Resolution**: When the damage is dealt, **Needletooth Raptor** takes 4 damage simultaneously. According to the rules, if multiple sources deal damage to a creature with an enrage ability at the same time, the enrage ability triggers only once.\n\n**The Ruling**: The enrage ability of **Needletooth Raptor** will trigger only once, despite the multiple sources of damage, because all the damage is dealt simultaneously.\n\n**Sources**:\n- **Rule 702.38b (Keyword Abilities)**: If a creature has multiple instances of amplify, each one works separately.\n- **Rule 702.112c (Keyword Abilities)**: If a creature has multiple instances of renown, each triggers separately.\n- **Rule 702.154d (Keyword Abilities)**: Multiple instances of enlist on a single creature function independently. The triggered ability represented by each instance of enlist triggers only once and only for the cost associated with that enlist ability."
  },
  {
    "id": 50,
    "question": "If I control a creature that I stole with [[Act of Treason]], and I use [[Cloudshift]] on it, do I keep it forever?",
    "accepted_answer": "Yes, you keep it permanently. This happens because Cloudshift exiles the creature and returns it specifically 'under your control.' When the creature leaves and returns, it becomes a brand new game object. The temporary 'until end of turn' effect from [[Act of Treason]] loses track of it, and since you are the controller of the 'new' creature upon entry, it stays yours indefinitely.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "By the Founders! The graveyard is not a revolving door... usually.\n\nWhen you use **Act of Treason** to gain control of a creature, you only control it until the end of the turn. However, if you then use **Cloudshift** on that creature, the situation changes significantly.\n\n**The Lecture**:\n1. **Act of Treason** grants you control of the creature until the end of the turn. This is a temporary control effect.\n2. **Cloudshift** exiles the creature and then returns it to the battlefield under your control. When a creature returns to the battlefield this way, it is considered a new object with no memory of its previous existence. This means any previous control effects, such as those from **Act of Treason**, are irrelevant.\n3. The creature now enters the battlefield under your control, and you control it indefinitely, as per the effect of **Cloudshift**. The original owner loses all claim to it unless another effect changes control again.\n\n**The Ruling**: Yes, you keep the creature forever, or at least until another effect changes control or the game ends. The creature is a new object under your control, free from the shackles of **Act of Treason**'s temporary effect.\n\n**Sources**: \n- **Rule 611.2b (Continuous Effects)**: Explains the duration of control effects.\n- **Rule 800.4a (General)**: Details what happens when control effects end.\n- **Rule 707.4 (Copying Objects)**: Clarifies that returning a creature makes it a new object."
  },
  {
    "id": 51,
    "question": "When can I play a Sorcery spell?",
    "accepted_answer": "You can only play a Sorcery spell during your own Main Phase (either the first or second), and only when the stack is empty. You cannot play it during your opponent's turn or during combat.",
    "difficulty": "easy",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Read the text, boy! Read the text!\n\nA sorcery spell can be cast only during your main phase when the stack is empty, and you have priority. This is the fundamental rule for sorceries, and it is non-negotiable.\n\n**The Lecture**:\n- First, you must have priority, which means it's your turn to make a move. This is typically granted after a spell or ability resolves, or at the beginning of a phase or step.\n- Second, it must be during one of your main phases. A turn consists of two main phases: the pre-combat main phase and the post-combat main phase. You can cast sorceries during either, provided the other conditions are met.\n- Third, the stack must be empty. This means no other spells or abilities are waiting to resolve. You cannot cast a sorcery in response to another spell or ability.\n\nThese conditions ensure that sorceries are cast in a controlled manner, reflecting their nature as deliberate and powerful spells.\n\n**The Ruling**: You may cast a sorcery during your main phase when you have priority and the stack is empty. \n\n**Sources**: \n- **Rule 307.1 (Sorceries)**: A player who has priority may cast a sorcery card from their hand during a main phase of their turn when the stack is empty.\n- **Rule 307.5 (Sorceries)**: If a spell, ability, or effect states that a player can do something only “any time they could cast a sorcery,” it means only that the player must have priority, it must be during the main phase of their turn, and the stack must be empty."
  },
  {
    "id": 52,
    "question": "Can I block a creature that has Flying with a creature that does not have Flying or Reach?",
    "accepted_answer": "No, you cannot. A creature with Flying can only be blocked by other creatures with Flying or creatures with the Reach keyword. A ground creature without Reach cannot interact with a flier.",
    "difficulty": "easy",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nA creature with flying is a nimble adversary, soaring above the battlefield. According to the rules, such a creature can only be blocked by creatures that either have flying themselves or possess the reach ability. This is a fundamental aspect of the flying and reach mechanics, ensuring that only those capable of reaching the skies can engage with these aerial threats.\n\n**The Lecture**:\n- When a creature with flying attacks, it presents a unique challenge. The rules state that only creatures with flying or reach can block it (**Rule 702.9b (Keyword Abilities)**, **Rule 702.17b (Keyword Abilities)**).\n- Reach is a keyword ability specifically designed to allow creatures to block those with flying, effectively extending their defensive capabilities to the air (**Rule Reach (Glossary)**).\n- If you attempt to block a flying creature with one that lacks both flying and reach, the block is illegal and cannot occur. The flying creature will continue its assault unimpeded.\n\n**The Ruling**: No, you cannot block a creature with flying using a creature that does not have flying or reach. The rules are clear and unyielding on this matter.\n\n**Sources**: \n- **Rule 702.9b (Keyword Abilities)**: Flying restrictions.\n- **Rule 702.17b (Keyword Abilities)**: Reach capabilities."
  },
  {
    "id": 53,
    "question": "If my opponent attacks me with a 2/2 creature, can I block with two 1/1 creatures?",
    "accepted_answer": "Yes, you can. This is called a 'double block' or 'gang block.' You can assign multiple creatures to block a single attacking creature. The attacker determines the order in which damage is dealt to your blockers.",
    "difficulty": "easy",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nWhen your opponent attacks with a 2/2 creature, you are indeed allowed to block it with two 1/1 creatures. The rules of combat allow you to assign multiple blockers to a single attacking creature, provided there are no restrictions or requirements preventing you from doing so.\n\n**The Lecture**:\n- During the declare blockers step, you, as the defending player, may assign any number of your creatures to block an attacking creature, unless the attacking creature has an ability like menace, which requires it to be blocked by two or more creatures.\n- In this scenario, the 2/2 creature does not have any such restrictions, so you may block it with one, two, or even more creatures if you wish.\n- Once blocked, the attacking creature will assign its combat damage to the blocking creatures. The 2/2 will deal its damage to the blockers as you choose, and the blockers will deal their damage to the attacker simultaneously.\n\n**The Ruling**: Yes, you can block a 2/2 creature with two 1/1 creatures. This is perfectly legal and follows the rules of combat.\n\n**Sources**:\n- **Rule 302.5 (Creatures)**: Creatures can attack and block.\n- **Rule 509.1c (Declare Blockers Step)**: The defending player can assign blockers as long as they adhere to any restrictions or requirements."
  },
  {
    "id": 54,
    "question": "Does damage dealt to a creature stay on it forever?",
    "accepted_answer": "No. Damage marked on a creature remains until the 'Cleanup Step' at the very end of the turn. If the damage isn't lethal by then, it is removed completely. The creature starts the next turn fresh.",
    "difficulty": "easy",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Read the text, boy! Read the text!\n\nDamage dealt to a creature does not linger indefinitely. It remains marked on the creature until the cleanup step of the turn, at which point it is removed. This is a fundamental aspect of the game, ensuring that damage is not permanent unless it results in the creature's destruction.\n\n**The Lecture**:\nWhen a creature takes damage, that damage is marked on it. If the total damage marked on a creature equals or exceeds its toughness, the creature is destroyed as a state-based action. This destruction is not caused by the damage itself but by the game rules recognizing that the creature has suffered lethal damage (**Rule 120.6 (Damage)**, **Rule 704.5 (SBAs)**).\n\nHowever, this damage is not eternal. During the cleanup step, which occurs at the end of each turn, all damage marked on creatures is removed. This ensures that creatures do not carry over damage from one turn to the next, unless they are destroyed or otherwise affected by specific game mechanics like regeneration (**Rule 514.2 (Cleanup Step)**).\n\nRegeneration, for instance, can replace the destruction of a creature by removing all damage marked on it and tapping it, if applicable. This is a separate process that occurs when a creature would be destroyed, not during the cleanup step (**Rule 701.19b (Regenerate)**).\n\n**The Ruling**: Damage does not stay on a creature forever. It is removed during the cleanup step of each turn, unless the creature is destroyed or regenerated before then.\n\n**Sources**:\n- **Rule 120.6 (Damage)**\n- **Rule 704.5 (State-Based Actions)**\n- **Rule 514.2 (Cleanup Step)**\n- **Rule 701.19b (Regenerate)**"
  },
  {
    "id": 55,
    "question": "I have a creature with Haste. Can I attack with it the turn I play it?",
    "accepted_answer": "Yes. Normally, creatures suffer from 'summoning sickness' and cannot attack or tap for abilities the turn they come under your control. The Haste keyword specifically ignores this rule, allowing immediate attacks.",
    "difficulty": "easy",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Read the text, boy! Read the text!\n\nIf your creature has haste, it can indeed attack the turn it enters the battlefield. Haste is a keyword ability that allows a creature to ignore the usual restriction known as \"summoning sickness,\" which prevents creatures from attacking or using abilities with the tap symbol ({T}) unless they've been under your control since the beginning of your turn.\n\n**The Lecture**: \n- When you play a creature, it typically suffers from summoning sickness, meaning it cannot attack or use abilities with the tap symbol until your next turn.\n- However, if the creature has haste, this restriction is lifted. Haste allows the creature to attack immediately, as if it had been under your control since the start of your turn.\n- This is because haste is a static ability that modifies the rules for that creature, specifically allowing it to bypass the summoning sickness rule (Rule 702.10a, Keyword Abilities).\n\n**The Ruling**: Yes, you can attack with a creature the turn you play it if it has haste.\n\n**Sources**: \n- **Rule 702.10 (Keyword Abilities)**: Haste\n- **Rule 702.10b (Keyword Abilities)**: If a creature has haste, it can attack even if it hasn’t been controlled by its controller continuously since their most recent turn began."
  },
  {
    "id": 56,
    "question": "Can I play an Instant spell during my opponent's turn?",
    "accepted_answer": "Yes. Instant spells can be cast at any time you have priority, including during your opponent's turn, in response to their spells, or during combat.",
    "difficulty": "easy",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Read the text, boy! Read the text!\n\nOf course, you can cast an instant spell during your opponent's turn. Instants are designed for such flexibility, allowing you to respond to your opponent's actions or prepare for your own turn. The rules governing instants are quite clear on this matter.\n\n**The Lecture**: \n   - Instants can be cast at any time you have priority, which includes during your opponent's turn. This is one of the defining characteristics of instant spells, setting them apart from sorceries, which are restricted to your main phase when the stack is empty (**Rule 304.1 (Instants)**).\n   - Priority is the key here. You gain priority after any spell or ability resolves, or when a player passes priority to you. This means you can cast an instant in response to your opponent's actions or during any phase of their turn, provided you have priority (**Rule 117.1a (Timing and Priority)**).\n   - The flexibility of instants is what makes them powerful tools for interaction and strategy. They allow you to react to threats, protect your own spells, or set up for future plays.\n\n**The Ruling**: Yes, you can cast an instant spell during your opponent's turn, as long as you have priority.\n\n**Sources**: \n   - **Rule 117.1a (Timing and Priority)**\n   - **Rule 304.1 (Instants)**"
  },
  {
    "id": 57,
    "question": "If I have unspent mana in my mana pool at the end of my Main Phase, can I save it for my opponent's turn?",
    "accepted_answer": "No. Mana empties from your mana pool at the end of every step and phase. If you do not use it before moving to the next step (like moving from Main Phase to Combat), it is lost.",
    "difficulty": "easy",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Read the text, boy! Read the text!\n\nMana, once added to your pool, is a fleeting resource. It does not linger beyond the confines of a single step or phase. As each step or phase concludes, any unspent mana in your pool vanishes into the ether, leaving you with nothing to carry over into your opponent's turn.\n\n**The Lecture**: \n   - When you add mana to your pool, it is available for use during that step or phase.\n   - As the phase ends, any unspent mana is lost. This is a turn-based action that does not use the stack, meaning it happens automatically and without the opportunity for response (**Rule 703.4q (State-Based Actions)**, **Rule 500.5 (General)**).\n   - This means you cannot save mana from your main phase to use during your opponent's turn. Once your main phase ends, any mana left in your pool is gone.\n\n**The Ruling**: You cannot save unspent mana from your main phase for your opponent's turn. It disappears at the end of the phase.\n\n**Sources**: \n   - **Rule 703.4q (State-Based Actions)**\n   - **Rule 500.5 (General)**"
  },
  {
    "id": 58,
    "question": "What happens if I have to draw a card but my library is empty?",
    "accepted_answer": "You lose the game immediately. Attempting to draw from an empty library is one of the primary lose conditions in Magic: The Gathering.",
    "difficulty": "easy",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "By the Founders! The graveyard is not a revolving door... usually.\n\nWhen you are required to draw a card and your library is empty, the rules of the game dictate a very specific sequence of events. This is not a matter of choice or chance, but a matter of inevitability.\n\n**The Lecture**: \n   - When you attempt to draw a card from an empty library, the game does not immediately end. Instead, the game waits until the next time a player would receive priority to check for state-based actions.\n   - At that moment, the game checks if you have attempted to draw from an empty library since the last time state-based actions were checked. If you have, you lose the game as a state-based action.\n   - This is a crucial distinction: the loss does not occur at the moment of the attempted draw, but rather at the next opportunity for state-based actions to be checked.\n\n**The Ruling**: If you attempt to draw a card from an empty library, you will lose the game the next time state-based actions are checked, which is when a player would next receive priority.\n\n**Sources**: \n   - **Rule 704.5b (State-Based Actions)**: If a player attempted to draw a card from a library with no cards in it since the last time state-based actions were checked, that player loses the game.\n   - **Rule 104.3c (Ending the Game)**: If a player is required to draw more cards than are left in their library, they draw the remaining cards and then lose the game the next time a player would receive priority."
  },
  {
    "id": 59,
    "question": "Can I target my creature with Hexproof with my own spells?",
    "accepted_answer": "Yes, you can. Hexproof prevents a permanent from being targeted by spells or abilities your *opponents* control. It does not prevent you (the controller) from targeting it with your own buffs or enchantments.",
    "difficulty": "easy",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Read the text, boy! Read the text!\n\nHexproof is a static ability that prevents a permanent or player from being the target of spells or abilities controlled by an opponent. It does not prevent you from targeting your own creatures with your own spells or abilities.\n\n**The Lecture**: \n   - Hexproof is defined as a keyword ability that precludes a permanent or player from being targeted by an opponent's spells or abilities (**Rule 702.11b (Keyword Abilities)**).\n   - This means that if you control a creature with hexproof, you are free to target it with your own spells and abilities. The restriction only applies to your opponents.\n   - For instance, if you have a creature with hexproof and you wish to cast a spell like **Sheltering Word** on it, you may do so without any issue. The hexproof ability does not interfere with your ability to target your own creature.\n\n**The Ruling**: Yes, you can target your creature with hexproof with your own spells and abilities. Hexproof only prevents your opponents from targeting it.\n\n**Sources**: \n   - **Rule 702.11b (Keyword Abilities)**: “Hexproof” on a permanent means “This permanent can’t be the target of spells or abilities your opponents control.”"
  },
  {
    "id": 60,
    "question": "If I block a 5/5 creature with a 1/1 creature, do I take 4 damage?",
    "accepted_answer": "No, you take 0 damage. Unless the attacking creature has Trample, a blocker absorbs all combat damage from the attacker, regardless of the size difference. The 1/1 will die, but you will be safe.",
    "difficulty": "easy",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nWhen you block a 5/5 creature with a 1/1 creature, the interaction is governed by the rules of combat damage assignment. Let's dissect this scenario.\n\n**The Lecture**:\n1. **Blocking and Damage Assignment**: When your 1/1 creature blocks the 5/5 attacker, the attacker is considered blocked. According to the rules, a blocked creature assigns its combat damage to the creatures blocking it, not to the player, unless it has trample (**Rule 510.1c (Combat Damage Step)**).\n\n2. **The Ghost Block**: Even if the 1/1 blocker is removed before damage is dealt (say, by being sacrificed or destroyed), the 5/5 remains blocked. Without trample, it cannot assign any damage to you, the defending player. This is a classic case of the \"Ghost Block\" principle, where the attacker deals 0 damage to the player if the blocker is removed (**Rule 510.1c (Combat Damage Step)**).\n\n3. **Trample Exception**: If the 5/5 creature had trample, it would be able to assign damage to you, the player, after assigning lethal damage to the blocker. In this case, lethal damage to a 1/1 is 1 point, so the remaining 4 damage could be assigned to you (**Rule 702.19b (Keyword Abilities)**).\n\n**The Ruling**: Without trample, you take 0 damage. The 5/5 assigns all its damage to the 1/1 blocker, and none to you.\n\n**Sources**:\n- **Rule 510.1c (Combat Damage Step)**\n- **Rule 702.19b (Keyword Abilities)**"
  },
  {
    "id": 61,
    "question": "When do I untap my lands and creatures?",
    "accepted_answer": "You untap your permanents during the 'Untap Step,' which is the very first thing that happens on your turn, before you draw a card or play anything.",
    "difficulty": "easy",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Squawk! A tangled web of layers. Let us untangle it.\n\nWhen it comes to untapping your lands and creatures, the rules are quite specific, and various effects can influence this process. Let us dissect the mechanics involved.\n\n**The Lecture**:\n1. **Untap Step Basics**: During your untap step, you determine which permanents you control will untap, and then you untap them all simultaneously. This is a turn-based action and does not use the stack (**Rule 502.3 (Untap Step)**).\n\n2. **Effects Preventing Untap**: Certain effects, like those from **Bontu's Last Reckoning** or **Mudslide**, can prevent your permanents from untapping during your untap step. For instance, if you cast **Bontu's Last Reckoning**, your lands will not untap during your next untap step, regardless of whether they were tapped or not when the spell resolved.\n\n3. **Additional Untap Opportunities**: Some effects allow permanents to untap outside of the normal untap step. For example, **Urban Burgeoning** grants an enchanted land the ability to untap during each other player's untap step. This means that even if your lands don't untap during your untap step due to an effect like **Bontu's Last Reckoning**, they can still untap during an opponent's untap step if enchanted by **Urban Burgeoning**.\n\n4. **Triggered Abilities**: Enchantments like **Mudslide** and **Dream Tides** have triggered abilities that allow you to untap certain creatures during your upkeep if you pay a cost. These abilities provide an opportunity to untap creatures that wouldn't normally untap during the untap step due to their static effects.\n\n5. **Combat and Untap**: **Nature's Will** provides another layer of complexity. When your creatures deal combat damage to a player, you untap all lands you control. This can occur multiple times in a turn if there are multiple combat phases or if creatures have first strike or double strike.\n\n**The Ruling**: \n- During your untap step, you untap all permanents unless an effect prevents it.\n- Effects like **Bontu's Last Reckoning** will stop your lands from untapping during your next untap step.\n- Abilities from cards like **Urban Burgeoning** allow untapping during other players' untap steps.\n- Triggered abilities from cards like **Mudslide** and **Dream Tides** can untap creatures during your upkeep if costs are paid.\n- **Nature's Will** untaps lands when your creatures deal combat damage to a player.\n\n**Sources**:\n- **Rule 502.3 (Untap Step)**\n- **Rule 703.4c (Turn-Based Actions)**\n- **Rule 701.26b (Keyword Actions: Untap)**"
  },
  {
    "id": 62,
    "question": "Can I counter a Land card when my opponent plays it?",
    "accepted_answer": "No. Playing a land is a special action that does not use the stack. Because it does not go on the stack, it cannot be responded to or countered by spells like Counterspell.",
    "difficulty": "easy",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Read the text, boy! Read the text!\n\nWhen your opponent plays a land, they are performing a special action that does not use the stack. This means it is not a spell or ability, and thus, it cannot be countered by any means. \n\n**The Lecture**: \n   - Playing a land is a unique action in Magic. According to the rules, it occurs during a player's main phase when they have priority and the stack is empty. This action is distinct from casting a spell or activating an ability because it does not use the stack at all (Rule 305.1, Lands).\n   - Since playing a land does not involve the stack, it cannot be responded to with instants or activated abilities. This includes any attempt to counter it, as countering requires the target to be on the stack.\n   - Common misconceptions arise from the fact that lands can enter the battlefield through other means, such as spells or abilities, which do use the stack. However, the act of playing a land is a special action and is immune to such interactions.\n\n**The Ruling**: You cannot counter a land card when your opponent plays it, as it does not use the stack and is not a spell or ability.\n\n**Sources**: \n   - **Rule 305.1 (Lands)**\n   - **Rule 116.2a (Special Actions)**\n   - **Rule 701.18a (Keyword Actions)**"
  },
  {
    "id": 63,
    "question": "Does a creature with Deathtouch kill a player if it deals 1 damage to them?",
    "accepted_answer": "No. Deathtouch only applies to damage dealt to other creatures. If a Deathtouch creature hits a player, it just deals normal damage to their life total.",
    "difficulty": "easy",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Read the text, boy! Read the text!\n\nA creature with deathtouch is particularly lethal to other creatures, but it does not extend this lethality to players. Deathtouch is a keyword ability that causes any amount of damage dealt by a creature to be considered lethal to other creatures, meaning it can destroy them regardless of their toughness. However, this ability does not have any special effect when dealing damage to players.\n\n**The Lecture**:\n- Deathtouch is defined as a static ability that affects how damage is treated when dealt to creatures. Specifically, any nonzero amount of damage from a source with deathtouch is considered lethal to creatures (see **Rule 702.2 (Deathtouch)**).\n- When a creature with deathtouch deals damage to another creature, that creature is destroyed as a state-based action if it has been dealt damage by a source with deathtouch since the last time state-based actions were checked (**Rule 704.5h (State-Based Actions)**).\n- However, when a creature with deathtouch deals damage to a player, the damage is treated as normal damage. There is no additional effect or consequence beyond the loss of life equal to the damage dealt.\n\n**The Ruling**: A creature with deathtouch does not kill a player by dealing 1 damage to them. The player simply loses 1 life, and deathtouch has no further impact.\n\n**Sources**: \n- **Rule 702.2 (Deathtouch)**\n- **Rule 704.5h (State-Based Actions)**"
  },
  {
    "id": 64,
    "question": "Can I equip an Artifact Equipment to a creature at Instant speed?",
    "accepted_answer": "No. The Equip keyword can only be activated as a Sorcery. This means you can only do it during your Main Phase when the stack is empty, not in response to removal or during combat.",
    "difficulty": "easy",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Read the text, boy! Read the text!\n\nThe ability to equip an Artifact Equipment to a creature is governed by the rules of the game, and these rules are quite specific about timing.\n\n**The Lecture**: \n   - The equip ability is an activated ability that allows you to attach an Equipment to a creature you control. The rules state that you can only activate this ability any time you could cast a sorcery, which means during your main phase when the stack is empty and you have priority. This is not at instant speed (**Rule 702.6a (Keyword Abilities)**).\n   - However, some Equipment have abilities that allow them to be attached to creatures without using the equip ability. For instance, when an Equipment enters the battlefield, it might have a triggered ability that attaches it to a creature you control. This triggered ability can occur at any time, even if you couldn't normally cast a sorcery at that moment (**Rule 301.5b (Artifacts)**).\n   - Additionally, if an Equipment has flash, like the Javelin of Lightning, you can cast it at instant speed, and its triggered ability will attach it to a creature you control immediately upon entering the battlefield. This is not the same as using the equip ability, which remains restricted to sorcery speed (**Rule 301.5b (Artifacts)**).\n\n**The Ruling**: You cannot use the equip ability of an Equipment at instant speed. However, if an Equipment has a triggered ability that attaches it to a creature upon entering the battlefield, or if it has flash, it can be attached at instant speed through those means, but not through the equip ability itself.\n\n**Sources**: \n   - **Rule 702.6a (Keyword Abilities)**\n   - **Rule 301.5b (Artifacts)**"
  },
  {
    "id": 65,
    "question": "My opponent casts a spell. Can I cast a spell in response before theirs resolves?",
    "accepted_answer": "Yes. Magic uses a system called 'The Stack.' When a spell is cast, it goes on top of the stack. You can respond with an Instant or ability, which goes on top of theirs and will resolve first.",
    "difficulty": "easy",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen your opponent casts a spell, it doesn't resolve immediately. Instead, it goes onto the Stack, a mystical construct where spells and abilities wait their turn to resolve. This is where you, with your keen sense of timing, can intervene.\n\n**The Lecture**: \n   - When your opponent casts a spell, they must first choose targets and pay any costs associated with casting it. Once this is done, the spell is placed on the Stack, and they pass priority to you.\n   - At this point, you have the opportunity to cast an instant spell or activate an ability \"in response\" to their spell. This means your spell or ability will resolve before theirs, thanks to the Last In, First Out (LIFO) nature of the Stack (**Rule 117.7 (Costs)**, **Rule 608.2g (Resolving Spells and Abilities)**).\n   - For example, if your opponent casts a creature spell, you could respond with a counterspell or a removal spell to deal with the creature before it ever hits the battlefield.\n\n**The Ruling**: Yes, you can cast a spell in response to your opponent's spell before theirs resolves. Your spell will resolve first, potentially altering the outcome of the game.\n\n**Sources**: \n   - **Rule 117.7 (Costs)**: Explains the concept of casting in response.\n   - **Rule 608.2g (Resolving Spells and Abilities)**: Details the resolution process and priority.\n   - **Rule 117.1a (Timing and Priority)**: Clarifies when you can cast instant spells."
  },
  {
    "id": 66,
    "question": "If a creature is Indestructible, does it die if it takes damage equal to its toughness?",
    "accepted_answer": "No. Indestructible prevents a creature from being destroyed by lethal damage or effects that say 'destroy.' It can still take damage, but the damage will not cause it to go to the graveyard.",
    "difficulty": "easy",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen a creature is indestructible, it cannot be destroyed by damage, even if that damage is equal to or exceeds its toughness. This is because the indestructible ability specifically prevents destruction from lethal damage, which is the usual consequence when a creature's toughness is met or exceeded by damage.\n\n**The Lecture**: \n   - Indestructible is a static ability that prevents a creature from being destroyed by lethal damage or effects that say \"destroy\" (**Rule 702.12b (Keyword Abilities)**).\n   - Normally, when a creature takes damage equal to or greater than its toughness, it is destroyed as a state-based action (**Rule 704.5g (State-Based Actions)**). However, indestructible creatures ignore this state-based action.\n   - The damage remains marked on the creature until the cleanup step, but it does not result in destruction due to the indestructible ability (**Rule 120.6 (Damage)**).\n\n**The Ruling**: A creature with indestructible does not die from taking damage equal to its toughness. It remains on the battlefield, impervious to destruction by damage.\n\n**Sources**: \n   - **Rule 702.12b (Keyword Abilities)**\n   - **Rule 704.5g (State-Based Actions)**\n   - **Rule 120.6 (Damage)**"
  },
  {
    "id": 67,
    "question": "Can I attack a specific creature my opponent controls?",
    "accepted_answer": "No. In Magic, you attack the player (or a Planeswalker). You declare your attackers, and then the defending player decides which of their creatures will block your attackers. You cannot force an attack directly onto a specific creature unless you use a specific 'Fight' spell.",
    "difficulty": "easy",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nYou cannot attack a specific creature your opponent controls. In Magic: The Gathering, creatures attack players, planeswalkers, or battles, not other creatures. The rules of combat dictate that during the declare attackers step, you choose which of your creatures will attack and who or what they will attack, but this choice is limited to your opponents, their planeswalkers, or battles they protect.\n\n**The Lecture**:\n- During the declare attackers step, as the active player, you select which of your creatures will attack. These creatures must be untapped and either have haste or have been under your control since the beginning of the turn (**Rule 508.1a (Declare Attackers Step)**).\n- You then choose a defending player, a planeswalker controlled by a defending player, or a battle protected by a defending player for each attacking creature (**Rule 802.3 (Attack Multiple Players Option)**).\n- The concept of attacking a creature directly does not exist within the rules. Creatures can only be targeted for combat through blocking, which occurs during the declare blockers step, where the defending player decides which of their creatures will block the attacking creatures (**Rule 509.1a (Declare Blockers Step)**).\n\n**The Ruling**: You cannot attack a specific creature your opponent controls. You may only attack players, planeswalkers, or battles.\n\n**Sources**: \n- **Rule 506.3 (Combat Phase)**\n- **Rule 508.1a (Declare Attackers Step)**\n- **Rule 802.3 (Attack Multiple Players Option)**"
  },
  {
    "id": 68,
    "question": "If a creature equipped with an Equipment dies, does the Equipment go to the graveyard as well?",
    "accepted_answer": "No, the Equipment stays on the battlefield. Unlike Enchantment Auras, which go to the graveyard if the creature they enchant leaves play, Equipment simply becomes unattached and remains on the battlefield waiting to be equipped to a new creature.",
    "difficulty": "easy",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "By the Founders! The graveyard is not a revolving door... usually.\n\nWhen a creature equipped with an Equipment dies, the Equipment does not follow it to the graveyard. The Equipment remains on the battlefield, unattached, waiting for its next opportunity to be equipped to another creature.\n\n**The Lecture**:\n   - When a creature dies, it is put into the graveyard from the battlefield. This is a straightforward transition for the creature itself, but not for the Equipment attached to it.\n   - Equipment, as artifacts, are not inherently tied to the life or death of the creature they equip. They remain on the battlefield unless an effect specifically causes them to leave.\n   - The moment the creature dies, the Equipment becomes unattached due to state-based actions, but it stays on the battlefield, ready to be equipped to another creature you control (as per **Rule 301.5d (Artifacts)**).\n\n**The Ruling**: The Equipment remains on the battlefield when the equipped creature dies. It does not go to the graveyard with the creature.\n\n**Sources**: \n   - **Rule 301.5d (Artifacts)**: Control of the Equipment and the equipped creature are separate.\n   - **Rule 704.5 (SBAs)**: State-based actions handle the unattaching of Equipment when the equipped creature dies."
  },
  {
    "id": 69,
    "question": "Can I tap a creature with Vigilance to make mana with [[Gene Pollinator]]'s ability?",
    "accepted_answer": "Yes. Vigilance specifically means the creature does not tap when it attacks. It does not prevent the creature from being tapped for other reasons. In fact, you can attack with it (keeping it untapped) and then tap it to activate the Pollinator in the same turn.",
    "difficulty": "easy",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Read the text, boy! Read the text!\n\nThe question at hand involves the interaction between a creature enchanted with **Vigilance** and the activated ability of **Gene Pollinator**. Vigilance, as you should know, prevents a creature from tapping when it attacks, but it does not grant immunity from being tapped by other means.\n\n**The Lecture**:\n- **Vigilance**: This ability ensures that attacking does not cause the creature to tap (Rule 702.20b). It does not, however, prevent the creature from being tapped by other effects or abilities.\n- **Gene Pollinator's Ability**: This ability requires you to tap an untapped permanent you control as part of its activation cost. The ability does not specify that the permanent must be untapped due to not attacking, merely that it must be untapped at the time of activation.\n\nThus, a creature with Vigilance remains untapped after attacking, making it eligible to be tapped for Gene Pollinator's ability. The vigilance ability does not interfere with the ability to tap the creature for other purposes, such as paying costs.\n\n**The Ruling**: Yes, you can tap a creature with Vigilance to pay the cost for **Gene Pollinator**'s ability. Vigilance only prevents tapping due to attacking, not from other effects or costs.\n\n**Sources**:\n- **Rule 702.20b (Keyword Abilities)**: Attacking doesn’t cause creatures with vigilance to tap.\n- **Rule 602.5a (Activating Activated Abilities)**: A creature’s activated ability with the tap symbol ({T}) in its activation cost can’t be activated unless the creature has been under its controller’s control since the start of their most recent turn."
  },
  {
    "id": 70,
    "question": "Do Token creatures go to the graveyard when they die?",
    "accepted_answer": "Technically, yes. Tokens do hit the graveyard, triggering 'when a creature dies' abilities. However, they cease to exist immediately after arriving there. They cannot be returned to your hand or battlefield from the graveyard.",
    "difficulty": "easy",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "By the Founders! The graveyard is not a revolving door... usually.\n\nWhen a token creature \"dies,\" it is indeed put into the graveyard, but only momentarily. The term \"dies\" specifically means that a creature is put into a graveyard from the battlefield, as per the rules. However, tokens have a unique fate once they leave the battlefield.\n\n**The Lecture**:\n- When a token creature is destroyed or sacrificed, it is put into the graveyard, fulfilling the condition for \"dies\" triggers. This means any abilities that trigger when a creature dies will indeed trigger.\n- However, tokens are ephemeral by nature. Once they are in the graveyard, they cannot remain there. State-Based Actions (SBAs) dictate that tokens cease to exist when they are in any zone other than the battlefield.\n- This cessation occurs the next time SBAs are checked, which is when a player would next receive priority after the token enters the graveyard.\n\n**The Ruling**: Token creatures do go to the graveyard when they die, triggering any relevant abilities. However, they cease to exist shortly thereafter due to State-Based Actions.\n\n**Sources**: \n- **Rule 700.4 (General)**: The term dies means “is put into a graveyard from the battlefield.”\n- **Rule 704.5d (State-Based Actions)**: If a token is in a zone other than the battlefield, it ceases to exist.\n- **Rule 111.7 (Tokens)**: A token that’s in a zone other than the battlefield ceases to exist."
  },
  {
    "id": 71,
    "question": "If I have two Legendary creatures with the exact same name on the battlefield, what happens?",
    "accepted_answer": "You must choose one to keep and put the other into your graveyard immediately. This is known as the 'Legend Rule'.",
    "difficulty": "easy",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "By the Founders! The graveyard is not a revolving door... usually.\n\nIf you control two legendary creatures with the exact same name, the \"legend rule\" comes into play. This rule is a state-based action that requires you to choose one of those legendary permanents to keep, and the rest must be put into their owners' graveyards. This is an automatic process that occurs without the use of the stack, meaning no player can respond to it.\n\n**The Lecture**:\n- When you have two legendary creatures with the same name on the battlefield, the game checks for state-based actions.\n- The \"legend rule\" (Rule 704.5j) is triggered, which dictates that you must choose one of the legendary creatures to remain on the battlefield.\n- The other creature(s) with the same name are put into the graveyard. This is not considered \"dying\" for the purposes of triggering \"dies\" abilities if the creature is exiled or otherwise removed instead of going to the graveyard.\n- This rule applies strictly to permanents with the exact same name. If the names differ even slightly, the rule does not apply.\n\n**The Ruling**: You must choose one of the legendary creatures with the same name to keep on the battlefield, and the rest are put into the graveyard.\n\n**Sources**: \n- **Rule 704.5j (State-Based Actions)**: The \"legend rule\" requires you to choose one of the legendary permanents with the same name to keep.\n- **Rule Legend Rule (Glossary)**: Explains the state-based action for legendary permanents."
  },
  {
    "id": 72,
    "question": "Can I play a creature before I play a land on my turn?",
    "accepted_answer": "Yes. As long as it is your Main Phase and you have the mana available (perhaps from artifacts or creatures), you can perform actions in any order. You are not required to play a land first.",
    "difficulty": "easy",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Read the text, boy! Read the text!\n\nPlaying a land is a special action that does not use the stack, and it can only be done during your main phase when the stack is empty and you have priority. This means you have the flexibility to sequence your plays as you see fit during your turn.\n\n**The Lecture**: \n- During your main phase, you may play a land if you haven't already done so this turn. This action is independent of the stack, meaning it doesn't require priority to resolve, nor can it be responded to with spells or abilities (Rule 305.1, Rule 116.2a).\n- You can cast spells, such as creatures, before or after playing a land, as long as you adhere to the rules of priority and the stack. Casting a creature spell involves putting it on the stack, allowing for responses before it resolves.\n- The order in which you play a land or cast a creature is entirely up to you, provided you follow the rules for each action. You might choose to cast a creature first to see if it resolves before deciding to play a land, or vice versa, depending on your strategy.\n\n**The Ruling**: Yes, you can play a creature before you play a land on your turn. The sequence of actions during your main phase is flexible, allowing you to decide the order based on your strategic needs.\n\n**Sources**: \n- **Rule 305.1 (Lands)**\n- **Rule 116.2a (Special Actions)**\n- **Rule 701.18a (Keyword Actions)**"
  },
  {
    "id": 73,
    "question": "If a creature has Vigilance, what does that mean?",
    "accepted_answer": "It means attacking does not cause the creature to tap. Normally, attacking requires tapping. A Vigilance creature stays upright, meaning it can attack on your turn and still be available to block on your opponent's turn.",
    "difficulty": "easy",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Read the text, boy! Read the text!\n\nA creature with Vigilance possesses a static ability that modifies the rules for the declare attackers step. Specifically, it means that when this creature attacks, it does not tap as a result of attacking. This allows the creature to remain untapped and potentially available for blocking during your opponent's turn.\n\n**The Lecture**: \n   - Vigilance is a keyword ability that alters the normal behavior of creatures during combat. Typically, when a creature attacks, it becomes tapped, rendering it unable to block during the next turn unless it is untapped by some other means.\n   - With Vigilance, however, the creature remains untapped after declaring it as an attacker. This provides a strategic advantage, as the creature can both attack and be ready to block on the opponent's turn.\n   - It is important to note that multiple instances of Vigilance on the same creature are redundant. The creature will not gain any additional benefits from having Vigilance more than once.\n\n**The Ruling**: A creature with Vigilance does not tap when it attacks, allowing it to be used for both offense and defense in the same turn.\n\n**Sources**: \n   - **Rule 702.20a (Keyword Abilities)**: Vigilance is a static ability that modifies the rules for the declare attackers step.\n   - **Rule 702.20b (Keyword Abilities)**: Attacking doesn’t cause creatures with vigilance to tap."
  },
  {
    "id": 74,
    "question": "What is 'Milling'?",
    "accepted_answer": "Milling refers to putting cards directly from the top of a library into the graveyard. It does not count as drawing cards. If a player is forced to mill their entire deck, they lose the next time they are required to draw a card.",
    "difficulty": "easy",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Read the text, boy! Read the text!\n\nMilling is a keyword action in Magic: The Gathering that involves moving cards from the top of a player's library directly into their graveyard. This action is often used as a strategy to deplete an opponent's library, potentially leading to their defeat if they cannot draw a card when required.\n\n**The Lecture**: \n   - When a player is instructed to mill a certain number of cards, they take that many cards from the top of their library and place them into their graveyard. This is a straightforward process, but it can have significant strategic implications.\n   - If a player is required to mill more cards than they have in their library, they simply mill as many as possible. This means that if a player has fewer cards in their library than the number they are instructed to mill, they will not lose the game due to milling alone, as milling is not a draw effect.\n   - The order of cards in the graveyard can matter, especially if multiple cards are milled at once, as the player who owns the cards can choose the order in which they are placed in the graveyard.\n\n**The Ruling**: Milling is the act of putting cards from the top of a library into the graveyard, and it is governed by specific rules that ensure it is executed correctly, even when the library is nearly empty.\n\n**Sources**: \n   - **Rule 701.17 (Keyword Actions)**: Details the process and limitations of milling.\n   - **Rule 701.17a (Keyword Actions)**: Specifies the basic action of milling cards.\n   - **Rule 701.17b (Keyword Actions)**: Clarifies what happens when milling more cards than are available in the library."
  },
  {
    "id": 75,
    "question": "Does a -5/-5 effect kill an Indestructible 3/4 creature?",
    "accepted_answer": "Yes. Indestructible prevents destruction from damage or 'destroy' effects. However, if a creature's toughness is reduced to 0 or less by -X/-X effects, it is put into the graveyard as a State-Based Action. This is not 'destruction,' so Indestructible does not save it.",
    "difficulty": "easy",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Read the text, boy! Read the text!\n\nAn indestructible creature is not as invincible as you might think. While it cannot be destroyed by lethal damage or effects that say \"destroy,\" it is still vulnerable to having its toughness reduced to zero or less.\n\n**The Lecture**: \n   - Indestructibility, as a static ability, prevents a creature from being destroyed by lethal damage or destroy effects (**Rule 702.12b (Keyword Abilities)**).\n   - However, if a creature's toughness is reduced to zero or less, it is put into the graveyard as a state-based action, regardless of indestructibility (**Rule 704.5f (State-Based Actions)**).\n   - In this scenario, a 3/4 creature with indestructible is subjected to a -5/-5 effect. This reduces its toughness to -1, which is less than zero.\n   - The rules dictate that a creature with zero or less toughness is put into the graveyard, bypassing indestructibility entirely.\n\n**The Ruling**: Yes, a -5/-5 effect will indeed cause an indestructible 3/4 creature to be put into the graveyard due to its toughness being reduced to zero or less.\n\n**Sources**: \n   - **Rule 702.12b (Keyword Abilities)**: Indestructible prevents destruction by lethal damage.\n   - **Rule 704.5f (State-Based Actions)**: A creature with toughness 0 or less is put into the graveyard."
  },
  {
    "id": 76,
    "question": "If my 2/2 creature with Double Strike is blocked by a 2/2 creature without abilities, what happens?",
    "accepted_answer": "Your creature survives, and the opponent's creature dies. Double Strike allows your creature to deal damage in the 'First Strike' damage step. It deals 2 damage to the blocker first, killing it before the blocker gets a chance to deal its combat damage back in the normal damage step.",
    "difficulty": "medium",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nWhen your 2/2 creature with Double Strike is blocked by a 2/2 creature without abilities, the interaction unfolds in two distinct combat damage steps due to the presence of Double Strike.\n\n**The Lecture**:\n1. **First Combat Damage Step**: Your creature, having Double Strike, deals its combat damage first. It assigns 2 damage to the blocking 2/2 creature. Since the blocking creature has no abilities like First Strike or Double Strike, it does not deal damage in this step.\n\n2. **State-Based Actions**: After the first combat damage step, state-based actions are checked. The blocking 2/2 creature, having received lethal damage (equal to its toughness), is destroyed and sent to the graveyard.\n\n3. **Second Combat Damage Step**: Normally, creatures without Double Strike would deal damage in this step. However, since the blocking creature is no longer on the battlefield, your creature assigns no damage in this step. The rules dictate that a blocked creature assigns its combat damage to the creatures blocking it, and if no creatures are currently blocking it, it assigns no combat damage (**Rule 510.1c (Combat Damage Step)**).\n\n**The Ruling**: Your 2/2 creature with Double Strike will destroy the blocking 2/2 creature in the first combat damage step. No damage is dealt in the second combat damage step because the blocker is no longer present.\n\n**Sources**:\n- **Rule 702.4b (Keyword Abilities)**: Double Strike mechanics.\n- **Rule 510.1c (Combat Damage Step)**: Damage assignment for blocked creatures."
  },
  {
    "id": 77,
    "question": "I have a creature with Menace. Can my opponent block it with one creature?",
    "accepted_answer": "No. Menace requires that the creature be blocked by two or more creatures. If the opponent only has one creature (or only wants to use one), they cannot block your Menace creature at all.",
    "difficulty": "medium",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nWhen dealing with a creature that has Menace, the rules are quite clear. Menace is an evasion ability that requires a creature to be blocked by two or more creatures. This means that a single creature is insufficient to block a creature with Menace.\n\n**The Lecture**: \n   - Menace is defined as an ability that prevents a creature from being blocked except by two or more creatures (**Rule 702.111b (Keyword Abilities)**).\n   - During the declare blockers step, the defending player must ensure that any creature with Menace is blocked by at least two creatures if they wish to block it at all.\n   - If the defending player only has one creature available to block, they cannot legally block the creature with Menace. The requirement of Menace would not be satisfied, and thus, the creature with Menace would remain unblocked.\n   - This is not a matter of choice or strategy; it is a strict requirement of the rules governing combat and blocking.\n\n**The Ruling**: Your opponent cannot block your creature with Menace using only one creature. They must use two or more creatures to block it, or it will remain unblocked.\n\n**Sources**: \n   - **Rule 702.111b (Keyword Abilities)**: A creature with menace can’t be blocked except by two or more creatures.\n   - **Rule 509.1c (Declare Blockers Step)**: Details the requirements and restrictions during the declare blockers step, including the necessity to satisfy all blocking requirements like those imposed by Menace."
  },
  {
    "id": 78,
    "question": "If I cast [[Clone]] copying a creature that has three +1/+1 counters on it, does my [[Clone]] enter with those counters?",
    "accepted_answer": "No. Copy effects only copy what is written on the card (plus other copy effects). They do not copy 'external' modifications like counters, Auras, or temporary buffs (like Giant Growth). Your Clone will enter as a fresh version of that creature with zero counters.",
    "difficulty": "medium",
    "category": "Continuous Effects, Layers & Copying",
    "owl_answer": "Read the text, boy! Read the text! \n\nWhen you cast **Clone**, it enters the battlefield as a copy of any creature on the battlefield. However, it only copies the original characteristics of that creature, not any additional modifications such as counters, Auras, or Equipment.\n\n**The Lecture**: \n- When **Clone** enters the battlefield, it becomes a copy of the chosen creature. This copying process involves acquiring the copiable values of the original creature's characteristics, which include the printed text, power, toughness, and abilities, but not any temporary or external modifications like counters.\n- The presence of +1/+1 counters on the original creature is a modification that is not part of the copiable values. Therefore, **Clone** will not enter with those counters.\n- This is consistent with the rules regarding copying objects, which state that counters and other non-copy effects are not duplicated (**Rule 707.2 (Copying Objects)**).\n\n**The Ruling**: Your **Clone** will not enter with the +1/+1 counters from the original creature. It will only have the base characteristics of the creature it copies.\n\n**Sources**: \n- **Rule 707.2 (Copying Objects)**: Details the copiable values and exclusions.\n- **Rule 707.5 (Copying Objects)**: Explains the process of entering as a copy."
  },
  {
    "id": 79,
    "question": "Can I use [[Lightning Bolt]] to destroy a Planeswalker?",
    "accepted_answer": "Yes. Any spell or ability that says 'any target' can target a Planeswalker directly. If the damage deals enough to remove all the Planeswalker's loyalty counters, it is put into the graveyard.",
    "difficulty": "medium",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Read the text, boy! Read the text!\n\nLightning Bolt deals 3 damage to any target, including planeswalkers. However, dealing damage to a planeswalker does not directly destroy it. Instead, damage to a planeswalker results in the removal of loyalty counters, which may lead to its destruction if the loyalty counters are reduced to zero.\n\n**The Lecture**: \n   - When you cast Lightning Bolt targeting a planeswalker, it deals 3 damage to that planeswalker.\n   - According to the rules, damage to a planeswalker results in the removal of an equivalent number of loyalty counters (**Rule 120.3c (Damage)**).\n   - If the removal of these counters reduces the planeswalker's loyalty to zero, it is put into its owner's graveyard as a state-based action (**Rule 704.5f (SBAs)**).\n   - It is crucial to understand that Lightning Bolt itself does not destroy the planeswalker; rather, the state-based action of having zero loyalty counters does.\n\n**The Ruling**: You can use Lightning Bolt to reduce a planeswalker's loyalty by 3. If this reduction brings the loyalty to zero, the planeswalker is put into the graveyard. Thus, while Lightning Bolt can lead to a planeswalker's destruction, it does so indirectly through the mechanics of loyalty counters and state-based actions.\n\n**Sources**: \n   - **Rule 120.3c (Damage)**: Damage dealt to a planeswalker causes that many loyalty counters to be removed from that planeswalker.\n   - **Rule 704.5f (SBAs)**: If a planeswalker has loyalty 0, it is put into its owner's graveyard."
  },
  {
    "id": 80,
    "question": "If I attack with a creature and my opponent blocks it, and then I use [[Unsummon]] to return the blocker to their hand, does my creature deal damage to the opponent?",
    "accepted_answer": "No (unless your creature has Trample). Once a creature is blocked, it remains blocked for the rest of combat, even if the blocker disappears. Since there is no creature left to hit, your creature deals no combat damage.",
    "difficulty": "medium",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nWhen your creature is blocked, it remains blocked for the duration of the combat phase, regardless of what happens to the blocker. This is a fundamental aspect of combat mechanics.\n\n**The Lecture**: \n   - During the declare blockers step, your opponent's creature is declared as a blocker for your attacking creature. At this point, your creature is considered \"blocked\" (**Rule 509.1h (Declare Blockers Step)**).\n   - You then cast **Unsummon** to return the blocking creature to your opponent's hand. While this removes the blocker from the battlefield, it does not change the status of your attacking creature. It remains blocked.\n   - According to the rules, a blocked creature assigns its combat damage to the creatures blocking it. If no creatures are currently blocking it, it assigns no combat damage (**Rule 510.1c (Combat Damage Step)**).\n   - Therefore, even though the blocker is no longer present, your creature will not deal any combat damage to the opponent because it remains blocked and has no blocker to assign damage to.\n\n**The Ruling**: Your creature will deal no damage to the opponent. It remains blocked, and without Trample, it cannot assign damage to the player.\n\n**Sources**: \n   - **Rule 509.1h (Declare Blockers Step)**\n   - **Rule 510.1c (Combat Damage Step)**"
  },
  {
    "id": 81,
    "question": "Does a creature with Protection from Red take damage from a red 'wrath' effect like [[Blasphemous Act]]?",
    "accepted_answer": "No, it does not take damage. Protection prevents D.E.B.T. (Damage, Enchanting/Equipping, Blocking, Targeting). Since Blasphemous Act tries to deal damage, Protection prevents it. However, a red spell that says 'Destroy all creatures' (without damage) would still kill it.",
    "difficulty": "medium",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen dealing with a creature that has Protection from Red, we must consider how protection interacts with damage, especially from a red source like Blasphemous Act. Protection from a color, in this case red, prevents all damage that would be dealt to the creature by sources of that color.\n\n**The Lecture**: \n   - Blasphemous Act is a red sorcery that deals 13 damage to each creature. The key here is that it is a red source.\n   - Protection from Red includes four main benefits: it prevents damage from red sources, prevents the creature from being enchanted or equipped by red auras or equipment, prevents it from being blocked by red creatures, and prevents it from being targeted by red spells or abilities.\n   - When Blasphemous Act resolves, it attempts to deal 13 damage to each creature. However, for a creature with Protection from Red, this damage is prevented entirely due to the protection ability.\n   - The protection ability acts as a \"shield\" that stops the damage from being applied to the creature (Rule 702.16e).\n\n**The Ruling**: A creature with Protection from Red will not take any damage from Blasphemous Act, as the protection ability prevents all damage from red sources.\n\n**Sources**: \n   - **Rule 702.16e (Keyword Abilities)**: Protection prevents damage from sources of the specified quality.\n   - **Rule 609.7b (Effects)**: Prevention effects recheck the source’s properties to determine if the damage should be prevented."
  },
  {
    "id": 82,
    "question": "If I cast a spell and my opponent casts [[Counterspell]] targeting it, can I cast another instant in response to prevent it from being countered?",
    "accepted_answer": "Yes. Because spells on the stack resolve in 'Last In, First Out' order, the Counterspell has not resolved yet. You can respond with your own spell (like [[Dispel]] or [[Veil of Summer]]) on top of theirs. Your response will resolve first, neutralizing or invalidating the Counterspell before it can affect your original spell.",
    "difficulty": "medium",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen you cast a spell, it goes onto the stack, and your opponent can respond with a spell like **Counterspell** to target and counter it. However, once **Counterspell** is on the stack, you cannot directly prevent it from resolving by casting another instant. The stack resolves in a Last In, First Out (LIFO) order, meaning the last spell or ability added to the stack resolves first.\n\n**The Lecture**:\n1. You cast your initial spell, and it goes onto the stack.\n2. Your opponent responds with **Counterspell**, targeting your spell. This **Counterspell** is now on top of the stack.\n3. You may cast another instant in response, but this new instant will resolve before **Counterspell** does. \n\nFor example, if you cast a spell like **Negate** targeting the **Counterspell**, then **Negate** will resolve first and can counter the **Counterspell**. However, if you cast an instant that does not directly interact with the **Counterspell**, such as a draw spell, it will not prevent your original spell from being countered.\n\n**The Ruling**: You cannot prevent a spell from being countered by simply casting another instant unless that instant directly counters or otherwise interacts with the **Counterspell** itself.\n\n**Sources**:\n- **Rule 117.7 (Costs)**: Explains the concept of responding to spells on the stack.\n- **Rule 304.1 (Instants)**: Details the casting of instant spells and their use of the stack."
  },
  {
    "id": 83,
    "question": "If I have a creature with Ward 2 and my opponent targets it with a spell but cannot pay the 2, what happens to their spell?",
    "accepted_answer": "Their spell is countered. Ward is a triggered ability that triggers when the creature is targeted. If the opponent does not pay the cost upon resolution of that trigger, their spell is countered by the game rules.",
    "difficulty": "medium",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen your opponent targets a creature you control that has Ward 2, the Ward ability triggers. This ability is a protective measure that requires your opponent to pay an additional cost to successfully target your creature. If they cannot pay this cost, the consequences are quite clear.\n\n**The Lecture**:\n1. **Triggering Ward**: As soon as your opponent's spell or ability targets your creature, the Ward ability triggers. This is a triggered ability, meaning it goes onto the stack and can be responded to, just like any other spell or ability (**Rule 702.21a (Keyword Abilities)**).\n\n2. **Resolving Ward**: When the Ward ability resolves, your opponent must pay the specified cost—in this case, 2 mana. If they cannot or choose not to pay this cost, the spell or ability that triggered the Ward is countered. This means it is removed from the stack and has no effect (**Rule Ward (Glossary)**).\n\n3. **No Payment, No Effect**: The inability to pay the Ward cost results in the spell being countered. It does not resolve, and thus, it does not affect your creature or any other game elements.\n\n**The Ruling**: If your opponent cannot pay the 2 mana required by the Ward ability, their spell is countered and has no effect.\n\n**Sources**:\n- **Rule 702.21a (Keyword Abilities)**: Ward is a triggered ability.\n- **Rule Ward (Glossary)**: A triggered ability that can counter spells or abilities that target the permanent with ward."
  },
  {
    "id": 84,
    "question": "Does First Strike work when creatures 'fight' using a spell like [[Prey Upon]]?",
    "accepted_answer": "No. First Strike and Double Strike only apply during specific Combat Damage steps. 'Fight' is a spell effect that causes two creatures to deal damage equal to their power to each other simultaneously. Combat keywords are ignored.",
    "difficulty": "medium",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Read the text, boy! Read the text!\n\nWhen creatures 'fight' using a spell like **Prey Upon**, the concept of First Strike does not apply. Fighting is not combat; it is a separate action where two creatures deal damage to each other equal to their power, but it occurs outside the combat phase.\n\n**The Lecture**:\n- **Prey Upon** is a sorcery that causes two creatures to fight. This means each creature deals damage equal to its power to the other. \n- First Strike is a keyword ability that modifies the rules for the combat damage step, specifically allowing a creature to deal its combat damage before other creatures during combat (see **Rule 702.7a (First Strike)**).\n- However, fighting is not part of the combat phase and does not involve combat damage steps. Therefore, First Strike has no effect during a fight.\n- The damage dealt during a fight is simultaneous and does not consider First Strike or Double Strike abilities.\n\n**The Ruling**: First Strike does not apply when creatures fight using **Prey Upon**. Both creatures deal damage to each other simultaneously, regardless of any First Strike ability.\n\n**Sources**:\n- **Rule 702.7a (First Strike)**: First Strike modifies combat damage steps.\n- **Rule 510.4 (End of Combat Step)**: Details on combat damage steps, irrelevant to fighting."
  },
  {
    "id": 85,
    "question": "If I create a token copy of a card with Mana Value (CMC) 5, what is the Mana Value of the token?",
    "accepted_answer": "The token has a Mana Value of 5. Unlike generic tokens (like a 1/1 Soldier) which have a Mana Value of 0, a token that is a *copy* of a card copies all characteristics of the original, including its Mana Cost.",
    "difficulty": "medium",
    "category": "Continuous Effects, Layers & Copying",
    "owl_answer": "Read the text, boy! Read the text!\n\nWhen you create a token that is a copy of a card with a mana value of 5, the token will inherit the mana value of the original card. This is because the token copies the original characteristics of the card, including its mana cost, which determines its mana value.\n\n**The Lecture**:\n- When a token is created as a copy of another object, it copies all the characteristics of that object as they are printed, including the mana cost.\n- The mana value of an object is determined by the total amount of mana in its mana cost, regardless of color (**Rule 202.3 (Mana Cost and Color)**).\n- Therefore, if the original card has a mana value of 5, the token copy will also have a mana value of 5, as it copies the mana cost of the original card.\n\n**The Ruling**: The mana value of the token is 5, matching the original card it copied.\n\n**Sources**: \n- **Rule 202.3 (Mana Cost and Color)**: The mana value of an object is a number equal to the total amount of mana in its mana cost, regardless of color.\n- **Rule 706.2 (Copying Objects)**: A copy acquires the characteristics of the original object, including mana cost."
  },
  {
    "id": 86,
    "question": "Can I activate a Planeswalker ability during my opponent's turn?",
    "accepted_answer": "No. Unless an ability specifically says otherwise (like The Wandering Emperor), Planeswalker loyalty abilities can only be activated as a Sorcery: during your Main Phase, when the stack is empty.",
    "difficulty": "medium",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Read the text, boy! Read the text!\n\nPlaneswalker abilities, specifically their loyalty abilities, are a type of activated ability. According to the rules, you may activate an activated ability any time you have priority, but there are specific restrictions for loyalty abilities.\n\n**The Lecture**:\n- Loyalty abilities of planeswalkers can only be activated during your main phase when the stack is empty. This is a fundamental restriction that applies to all planeswalkers unless an effect specifically states otherwise.\n- The Chain Veil, for instance, allows you to activate a loyalty ability as though none have been activated that turn, but it does not change the timing restrictions. You still must be in your main phase with an empty stack.\n- Therefore, even if you have priority during your opponent's turn, you cannot activate a planeswalker's loyalty ability because it is not your main phase, and the stack is not necessarily empty.\n\n**The Ruling**: No, you cannot activate a planeswalker ability during your opponent's turn. Loyalty abilities are restricted to your main phase with an empty stack.\n\n**Sources**: \n- **Rule 306.1 (Planeswalkers)**: Casting and activating restrictions.\n- **Rule 117.1b (Timing and Priority)**: General timing for activated abilities."
  },
  {
    "id": 87,
    "question": "If I have a 1/1 creature with both Deathtouch and First Strike, and it blocks a 10/10 creature without abilities, does my creature die?",
    "accepted_answer": "No, your creature survives. Because of First Strike, your creature deals damage in the first combat damage step. Because of Deathtouch, that 1 damage is immediately lethal. The 10/10 dies and is removed from combat before the regular damage step occurs, so it never gets a chance to hit your creature back.",
    "difficulty": "medium",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nIn this scenario, you have a 1/1 creature with both deathtouch and first strike blocking a 10/10 creature without any abilities. Let us dissect this interaction with the precision of a talon.\n\n**The Lecture**:\n1. **First Strike Damage Step**: Your 1/1 creature, possessing first strike, will deal its combat damage in the first strike damage step. Due to deathtouch, any amount of damage it deals is considered lethal. Thus, the 1/1 deals 1 damage to the 10/10, which is enough to destroy it as a state-based action due to deathtouch (**Rule 702.2b (Keyword Abilities)**).\n\n2. **State-Based Actions**: After the first strike damage step, state-based actions are checked. The 10/10 creature, having been dealt damage by a source with deathtouch, is destroyed before it can deal any damage back to your 1/1 creature (**Rule 704.5h (State-Based Actions)**).\n\n3. **Second Combat Damage Step**: Normally, if any creatures without first strike or double strike remain, a second combat damage step would occur. However, since the 10/10 is destroyed before this step, it never gets the chance to deal damage to your 1/1.\n\n**The Ruling**: Your 1/1 creature survives unscathed, having destroyed the 10/10 with its deathtouch ability during the first strike damage step.\n\n**Sources**: \n- **Rule 702.2b (Keyword Abilities)**: Deathtouch and lethal damage.\n- **Rule 704.5h (State-Based Actions)**: Destruction due to deathtouch.\n- **Rule 510.4 (End of Combat Step)**: First strike and combat damage steps."
  },
  {
    "id": 88,
    "question": "I control [[Doubling Season]] and [[Parallel Lives]]. If I activate [[Luminarch Ascension]] to create a single 4/4 Angel token, how many Angels do I actually get?",
    "accepted_answer": "You get 4 Angels. This happens because both enchantments generate replacement effects that modify the token creation event. The first effect sees you creating 1 token and doubles it to 2. The second effect sees the modified event of creating 2 tokens and doubles it again to 4.",
    "difficulty": "medium",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen you activate Luminarch Ascension's ability to create a 4/4 white Angel creature token, both Doubling Season and Parallel Lives come into play as replacement effects. Each of these enchantments doubles the number of tokens created by an effect under your control.\n\n**The Lecture**:\n1. **Initial Event**: You activate Luminarch Ascension to create one Angel token.\n2. **Replacement Effects**: Both Doubling Season and Parallel Lives have replacement effects that apply to this event. According to the rules, when multiple replacement effects apply, you choose the order in which they apply (**Rule 616.1g (Interaction of Replacement and/or Prevention Effects)**).\n3. **Doubling Season**: First, apply Doubling Season. It doubles the number of tokens from 1 to 2.\n4. **Parallel Lives**: Next, apply Parallel Lives. It doubles the number of tokens again from 2 to 4.\n\n**The Ruling**: You will end up with four 4/4 white Angel creature tokens with flying.\n\n**Sources**:\n- **Rule 616.1g (Interaction of Replacement and/or Prevention Effects)**: This rule explains how replacement effects interact and are applied in sequence.\n- **Doubling Season and Parallel Lives**: Both enchantments double the number of tokens created, and their effects stack multiplicatively."
  },
  {
    "id": 89,
    "question": "My opponent controls [[Voice of Victory]]. Can I cast an Instant spell during their turn just to get a Prowess trigger and have the spell countered?",
    "accepted_answer": "No, you cannot cast the spell at all. Voice of Victory creates a restriction that says opponents 'can't cast spells.' This prevents you from even beginning the process of casting. Since the spell is never cast, it never goes on the stack, and Prowess never triggers. The spell is not 'countered'; the action is simply illegal to perform.",
    "difficulty": "medium",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Read the text, boy! Read the text!\n\n**The Lecture**: \nThe card in question, **Voice of Victory**, states that \"Your opponents can't cast spells during your turn.\" This is a blanket prohibition that applies to all spells, including instants. The rules are quite clear: if an effect prohibits you from casting a spell, you simply cannot do so during the specified time frame. This means that during your opponent's turn, while they control **Voice of Victory**, you are entirely unable to cast any spells, instant or otherwise.\n\nNow, you might be thinking of some clever trickery to get around this, perhaps by attempting to cast an instant just to trigger Prowess. However, the rules do not allow for such shenanigans. The prohibition is absolute; you cannot even begin the process of casting a spell if it is disallowed by an effect like that of **Voice of Victory**. \n\n**The Ruling**: You cannot cast an instant spell during your opponent's turn if they control **Voice of Victory**. Therefore, you cannot trigger Prowess in this manner.\n\n**Sources**: \n- **Rule 601.3a (Casting Spells)**: Prohibitions on casting spells are absolute unless a choice during casting could change the prohibition.\n- **Rule 117.1a (Timing and Priority)**: Spells can only be cast when you have priority and no prohibitions apply."
  },
  {
    "id": 90,
    "question": "If I cast the Adventure part of a card (like the [[Stomp]] part of [[Bonecrusher Giant]]), does it go to the graveyard after it resolves?",
    "accepted_answer": "Yes. If you cast the *creature* side, it enters the battlefield. If it dies later, it goes to the graveyard. If you cast the Adventure side (Stomp), it goes to Exile on a special adventure zone after resolving, allowing you to cast the creature later.",
    "difficulty": "medium",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen you cast the Adventure part of a card, such as the Stomp part of Bonecrusher Giant, it does not follow the usual path to the graveyard after resolution. Instead, it takes a detour to exile.\n\n**The Lecture**: \n   - When you cast Stomp, you are casting it as an instant spell with its own characteristics, separate from the Bonecrusher Giant creature.\n   - Upon resolution, the spell's effects occur: damage can't be prevented this turn, and Stomp deals 2 damage to the chosen target.\n   - Normally, an instant would then be put into the graveyard as per **Rule 608.2n (Resolving Spells and Abilities)**. However, Adventure spells have a special rule.\n   - According to **Rule 715.3d (Adventurer Cards)**, instead of going to the graveyard, a spell cast as an Adventure is exiled. This allows you to later cast the Bonecrusher Giant from exile as a creature.\n\n**The Ruling**: The Adventure spell, Stomp, is exiled after it resolves, not sent to the graveyard. This permits you to cast the Bonecrusher Giant from exile later.\n\n**Sources**: \n   - **Rule 715.3d (Adventurer Cards)**\n   - **Rule 608.2n (Resolving Spells and Abilities)**"
  },
  {
    "id": 91,
    "question": "My opponent casts [[Deadly Dispute]]. Can I kill the creature they are sacrificing in response to make the spell fizzle?",
    "accepted_answer": "No, you cannot. Sacrificing the creature is an additional cost to cast the spell. Costs are paid immediately, before the spell even goes onto the stack. By the time you receive priority to respond, the creature is already in the graveyard, so you cannot target it with removal.",
    "difficulty": "medium",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen your opponent casts **Deadly Dispute**, they must pay the additional cost of sacrificing an artifact or creature as part of the casting process. This means the sacrifice happens immediately, before you have any opportunity to respond. The creature is already gone by the time you could attempt to interfere.\n\n**The Lecture**: \n   - As soon as your opponent announces the casting of **Deadly Dispute**, they choose and sacrifice a creature or artifact as part of the cost. This is not an action you can respond to.\n   - The sacrifice is instantaneous and occurs during the casting of the spell, not during its resolution. Therefore, the creature is no longer on the battlefield by the time you could respond with a spell or ability.\n   - A common misconception is that you can respond to the sacrifice itself, but the rules dictate that costs are paid upfront and cannot be interrupted.\n\n**The Ruling**: You cannot kill the creature being sacrificed to **Deadly Dispute** to make the spell fizzle. The creature is already sacrificed as part of the casting cost, leaving nothing to target.\n\n**Sources**: \n   - **Rule 601.2h (Casting Spells)**: Costs are paid as part of the casting process.\n   - **Rule 702.48b (Keyword Abilities)**: Sacrificing is part of paying the total cost."
  },
  {
    "id": 92,
    "question": "If I attack with a creature with Deathtouch and Trample and it gets blocked, how much damage do I need to assign to the blocker?",
    "accepted_answer": "When your creature with Deathtouch and Trample gets blocked, you only need to assign 1 damage to the blocker to kill it (due to Deathtouch), and then you can assign any remaining damage to the defending player or planeswalker (thanks to Trample). This is because Deathtouch makes any amount of damage lethal, so 1 damage is enough to satisfy the \"lethal damage\" requirement for Trample, allowing the rest to trample over.",
    "difficulty": "medium",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nWhen you attack with a creature that has both Deathtouch and Trample, the interaction between these abilities is quite fascinating. Deathtouch means that any amount of damage, even a single point, is considered lethal to a creature. Trample allows you to assign excess damage to the defending player or planeswalker once all blockers have been assigned lethal damage.\n\n**The Lecture**:\n1. **Deathtouch**: This ability means that any nonzero amount of damage is considered lethal. Therefore, you only need to assign 1 point of damage to each blocking creature to satisfy the requirement for lethal damage (**Rule 702.2c (Deathtouch)**).\n\n2. **Trample**: After assigning lethal damage to the blockers, any remaining damage can be assigned to the defending player or planeswalker. Since Deathtouch allows you to assign just 1 damage to each blocker, the rest of your creature's power can be directed at the player or planeswalker (**Rule 702.19b (Trample)**).\n\n3. **Damage Assignment**: During the combat damage step, you first assign 1 damage to each blocking creature due to Deathtouch. The remaining damage, thanks to Trample, can be assigned to the defending player or planeswalker (**Rule 510.1c (Combat Damage Step)**).\n\n**The Ruling**: You need to assign only 1 damage to each blocker due to Deathtouch. The rest of the damage can be assigned to the defending player or planeswalker, thanks to Trample.\n\n**Sources**: \n- **Rule 702.2c (Deathtouch)**\n- **Rule 702.19b (Trample)**\n- **Rule 510.1c (Combat Damage Step)**"
  },
  {
    "id": 93,
    "question": "Does [[Garruk's Harbinger]] (which has Hexproof from Black) survive a [[Damnation]]?",
    "accepted_answer": "No, it does not survive. This happens because Hexproof from Black only prevents the creature from being targeted by black spells or abilities. Damnation does not use the word 'target'—it simply says 'destroy all creatures.' Since it affects the board globally without targeting specific objects, the Hexproof offers no protection, and the Harbinger is destroyed.",
    "difficulty": "medium",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nGarruk's Harbinger, with its Hexproof from black, presents an interesting case when faced with Damnation. Hexproof from black means that the Harbinger cannot be targeted by black spells or abilities your opponents control. However, Damnation is a global effect that does not target any specific creature. It simply states, \"Destroy all creatures.\"\n\n**The Lecture**: \n   - Hexproof from black prevents targeting by black spells or abilities, but Damnation does not target; it affects all creatures simultaneously.\n   - The Harbinger's Hexproof from black is irrelevant in this scenario because Damnation does not attempt to target it. Instead, it issues a blanket destruction order to all creatures on the battlefield.\n   - Indestructible would prevent destruction, but Hexproof does not. The Harbinger is not immune to being destroyed by non-targeted effects like Damnation.\n\n**The Ruling**: Garruk's Harbinger will be destroyed by Damnation. Hexproof from black does not protect it from non-targeted destruction effects.\n\n**Sources**: \n   - **Rule 702.11d (Keyword Abilities)**: Hexproof from [quality] prevents targeting, not destruction.\n   - **Rule 120.5 (Damage)**: Destruction by state-based actions, not targeting."
  },
  {
    "id": 94,
    "question": "If I cast [[Banishing Light]] and my opponent destroys it while its 'enters the battlefield' trigger is still on the stack, is the target exiled forever?",
    "accepted_answer": "No, the target is never exiled at all. This happens because Banishing Light uses a modern single-paragraph wording ('exile... until Banishing Light leaves'). If the enchantment leaves the battlefield before the trigger resolves, the duration of the exile effect expires before it can even begin. The ability sees that the card is already gone and does nothing.",
    "difficulty": "medium",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Squawk! A tangled web of layers. Let us untangle it.\n\nWhen you cast **Banishing Light**, its ability to exile a target nonland permanent triggers and goes onto the stack. However, if your opponent destroys **Banishing Light** before this triggered ability resolves, the situation becomes quite interesting.\n\n**The Lecture**: \n- First, you cast **Banishing Light** and choose a target for its ability. This target is chosen when the ability is put on the stack, not when it resolves.\n- Your opponent, being clever, destroys **Banishing Light** before its ability resolves. According to the rules, if **Banishing Light** leaves the battlefield before its triggered ability resolves, the target permanent will not be exiled at all. This is because the ability checks for the presence of **Banishing Light** on the battlefield as it resolves to determine if it should exile the target.\n- The destruction of **Banishing Light** means that the condition for exiling the target is no longer met, and thus, the target remains safely on the battlefield.\n\n**The Ruling**: The target is not exiled at all, let alone forever. The destruction of **Banishing Light** before its ability resolves prevents the exile effect from occurring.\n\n**Sources**: \n- **Rule 603.7c (Handling Triggered Abilities)**: If the object is no longer in the zone it’s expected to be in at the time the delayed triggered ability resolves, the ability won’t affect it.\n- **Official Rulings on Banishing Light**: If Banishing Light leaves the battlefield before its triggered ability resolves, the target permanent won’t be exiled."
  },
  {
    "id": 95,
    "question": "Can I look at my sideboard during a game?",
    "accepted_answer": "No. You may only look at your sideboard between games in a match. You cannot reference it or notes during the game itself (unless a card like 'Wish' specifically lets you access it).",
    "difficulty": "medium",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Read the text, boy! Read the text!\n\nThe sideboard is a hidden zone, and you cannot simply peruse it at your leisure during a game. The rules are quite clear on this matter.\n\n**The Lecture**: \n   - The sideboard is defined as a group of additional cards that may be used to modify a deck between games of a match (**Rule 100.4 (General)**).\n   - Cards in a player's sideboard are considered to be outside the game (**Rule 400.11a (General)**).\n   - In a tournament setting, you may only look at your sideboard if a specific effect allows it, such as the card **Wish** or **Mastermind's Acquisition**. These cards explicitly permit you to access your sideboard to select a card to play or put into your hand.\n   - In casual play, the sideboard can be your personal collection, but again, you need a card effect to access it during a game.\n\n**The Ruling**: You cannot look at your sideboard during a game unless a card effect specifically allows you to do so.\n\n**Sources**: \n   - **Rule 100.4 (General)**: Sideboard rules.\n   - **Rule 400.11a (General)**: Cards in a sideboard are outside the game."
  },
  {
    "id": 96,
    "question": "I am attacking with a Lifelink creature (without Trample). My opponent blocks it, then sacrifices his creature right after. Do I still gain life?",
    "accepted_answer": "No, you do not gain life. This happens because a blocked creature without Trample deals damage only to the creature blocking it. If the blocker is removed before damage calculation, the attacker is still considered blocked but assigns zero damage because there is nothing left to hit. Since Lifelink requires actual damage to be dealt to function, you gain no life.",
    "difficulty": "medium",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nIn this scenario, you are attacking with a creature that has lifelink, and your opponent blocks it with a creature, then sacrifices that blocker before damage is dealt. You are wondering if you still gain life from the lifelink ability.\n\n**The Lecture**: \nWhen your lifelink creature is blocked, it remains blocked even if the blocking creature is removed from combat before damage is dealt. This is known as the \"Ghost Block\" principle. The removal of the blocker does not allow your creature to deal damage to the defending player or planeswalker unless it has trample. Since your creature does not have trample, it will deal no combat damage to the player or any other target.\n\nLifelink requires actual damage to be dealt for life to be gained. Since your creature deals no damage due to the absence of a blocker and lack of trample, you gain no life. The lifelink ability does not trigger because no damage event occurs.\n\n**The Ruling**: You do not gain life. The lifelink ability does not trigger because no damage is dealt.\n\n**Sources**: \n- **Rule 702.15b (Keyword Abilities)**: Damage dealt by a source with lifelink causes life gain.\n- **Rule 119.9 (Life)**: No life gain event occurs if 0 life is gained.\n- **Rule 702.19b (Keyword Abilities)**: Trample allows excess damage to be assigned to the player, but without it, no damage is dealt if the blocker is removed."
  },
  {
    "id": 97,
    "question": "I control [[Monastery Swiftspear]]. If I cast [[Shattering Spree]] and pay the Replicate cost twice, do I get 1 or 3 Prowess triggers?",
    "accepted_answer": "You get only 1 trigger. This happens because Prowess triggers specifically when you cast a spell. Replicate creates copies that are placed directly onto the stack; these copies are not 'cast.' Therefore, Swiftspear sees only the original spell being cast, regardless of how many copies you make.",
    "difficulty": "medium",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Read the text, boy! Read the text!\n\nWhen you cast **Shattering Spree**, you are indeed casting a noncreature spell, which will trigger the Prowess ability on your **Monastery Swiftspear**. However, the intricacies of the Replicate ability must be understood to determine the number of Prowess triggers.\n\n**The Lecture**:\n- **Casting Shattering Spree**: When you initially cast **Shattering Spree**, it triggers Prowess once because you are casting a noncreature spell. This is straightforward.\n- **Replicate Mechanism**: The Replicate ability allows you to pay an additional cost to create copies of the spell. These copies are created directly on the stack and are not cast. Therefore, they do not trigger Prowess. The copies are simply placed on the stack as a result of the Replicate ability resolving.\n- **Prowess Trigger**: Since Prowess triggers specifically when you cast a noncreature spell, and the copies from Replicate are not cast, they do not cause additional Prowess triggers.\n\n**The Ruling**: You will get **1 Prowess trigger** from casting **Shattering Spree**, regardless of how many times you pay the Replicate cost.\n\n**Sources**:\n- **Rule 702.108a (Prowess)**: Prowess triggers when you cast a noncreature spell.\n- **Rule 702.56a (Replicate)**: Copies created by Replicate are not cast, thus do not trigger abilities that trigger on casting."
  },
  {
    "id": 98,
    "question": "I have a [[Monastery Swiftspear]] and need one more Prowess trigger to win. Can I cast [[Spell Pierce]] even with no target, just to get the trigger?",
    "accepted_answer": "No, you cannot. To cast a spell, you must be able to choose a legal target for it. Spell Pierce specifically requires a 'target noncreature spell' to be on the stack. If there are no spells on the stack to target, the game does not allow you to cast Spell Pierce at all, so Prowess never triggers.",
    "difficulty": "medium",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Read the text, boy! Read the text!\n\nYou cannot cast **Spell Pierce** without a legal target. The rules of the game require that a spell must have a valid target at the moment of casting. This is not merely a suggestion; it is a fundamental requirement of the game.\n\n**The Lecture**: \nWhen you attempt to cast **Spell Pierce**, you must first choose a target for it. **Spell Pierce** specifically targets a noncreature spell. If there are no noncreature spells on the stack, you cannot legally cast **Spell Pierce**. The game does not allow you to cast a spell without a valid target just to trigger abilities like Prowess. This is known as the \"Valid Cast Check,\" which ensures that all spells have appropriate targets when they are cast.\n\nEven if your intention is to trigger the Prowess ability on your **Monastery Swiftspear**, the rules do not permit you to cast a spell without a target simply for the sake of triggering abilities. The Prowess ability will only trigger if you successfully cast a noncreature spell, which means the spell must be legally cast with all its requirements met, including having a valid target.\n\n**The Ruling**: You cannot cast **Spell Pierce** without a target. Therefore, you cannot use it to trigger Prowess on your **Monastery Swiftspear** if there are no valid targets.\n\n**Sources**: \n- **Rule 601.2c (Casting Spells)**: A player must choose a legal target for a spell when casting it.\n- **Rule 603.2 (Triggered Abilities)**: Prowess triggers when a noncreature spell is cast, but the spell must be legally cast."
  },
  {
    "id": 99,
    "question": "If I attack with a creature with Trample and it becomes blocked, and I kill the blocker before the damage step, does the damage from my creature go through?",
    "accepted_answer": "Yes, all the damage goes through. This happens because Trample modifies the rules for blocked creatures. While a normal creature deals no damage if its blocker is removed, a creature with Trample checks to see how much damage is needed to kill the blocker. Since there is no blocker present, the required amount is zero, allowing the full power of the attacking creature to trample over to the defending player.",
    "difficulty": "medium",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Pinfeathers! Combat is chaotic, but the rules are precise.\n\nWhen your trampling creature is blocked, and you remove the blocker before the damage step, the rules of trample come into play. Let us dissect this scenario.\n\n**The Lecture**: \n1. **Declare Attackers and Blockers**: Your creature with trample is declared as an attacker and is subsequently blocked by an opponent's creature.\n2. **Removal of the Blocker**: You then use a spell or ability to destroy or otherwise remove the blocking creature before the combat damage step.\n3. **Combat Damage Assignment**: According to the rules of trample, if a creature with trample is blocked but there are no creatures blocking it when damage is assigned, its damage is assigned to the defending player or planeswalker as though all blocking creatures have been assigned lethal damage (**Rule 702.19d (Keyword Abilities)**).\n\n**The Ruling**: Yes, the damage from your creature with trample will go through to the defending player or planeswalker if the blocker is removed before the damage step. The trample ability allows the creature to assign its damage directly to the player or planeswalker in the absence of any blockers.\n\n**Sources**: \n- **Rule 702.19d (Keyword Abilities)**: Trample damage assignment when no blockers remain.\n- **Rule 510.1c (Combat Damage Step)**: Damage assignment for blocked creatures."
  },
  {
    "id": 100,
    "question": "If I crew a Vehicle to attack, at what specific moment does it stop being a creature?",
    "accepted_answer": "It stops being a creature during the Cleanup Step, which is the very last part of the turn. It remains a creature throughout combat, the second main phase, and the end step. It only reverts to being a non-creature artifact when 'until end of turn' effects wear off as the turn officially closes.",
    "difficulty": "medium",
    "category": "Combat & Damage Mechanics",
    "owl_answer": "Hoo-hoo! Timing is everything, student! Listen closely.\n\nWhen you crew a Vehicle, it becomes an artifact creature until the end of turn. This transformation is crucial for it to participate in combat, either as an attacker or a blocker. However, the moment it ceases to be a creature is dictated by the duration of the crew effect.\n\n**The Lecture**:\n1. **Crew Activation**: You activate the crew ability during the beginning of combat step, turning the Vehicle into an artifact creature. This status persists until the end of turn, as specified by the crew ability itself ('This Vehicle becomes an artifact creature until end of turn').\n\n2. **Combat Phase**: As the combat phase progresses, the Vehicle remains a creature throughout the declare attackers step, the declare blockers step, and the combat damage step. It retains its creature status until the end of the turn, regardless of whether it is tapped, untapped, or removed from combat.\n\n3. **End of Turn**: The end of turn is a specific point in the turn structure, occurring after the end step. At this juncture, all effects that last \"until end of turn\" expire. Thus, the Vehicle stops being a creature at this precise moment, reverting to its original artifact-only state.\n\n**The Ruling**: The Vehicle stops being a creature at the end of turn, specifically after the end step concludes. Until then, it remains an artifact creature, capable of participating in combat and being affected by effects that target creatures.\n\n**Sources**:\n- **Rule 702.122a (Keyword Abilities)**: Crew ability duration.\n- **Rule 301.7b (Creatures)**: Vehicle's power and toughness as a creature.\n- **Rule 508.1k (Declare Attackers Step)**: Attacking creature status."
  }
]