[
  {
    "id": 10,
    "question": "Can I pay life to [[Bolas's Citadel]] and go to negative life if I have a [[Platinum Angel]]?",
    "accepted_answer": "No, you cannot pay life to Bolas's Citadel and go to negative life with Platinum Angel out, because you can't pay life you don't have, even if the Angel keeps you in the game; you can only pay down to 0 life and then can't pay any more, though you can still pay 0 life to activate abilities if a cost allows it. Platinum Angel prevents you from losing the game at 0 or less life, but it doesn't change the fundamental rule that you can't spend life as a resource if your total is zero or below.",
    "difficulty": "hard",
    "category": "Costs, Mana & Casting Requirements",
    "owl_answer": "Read the text, boy! Read the text!\n\n**The Lecture**: \nWhen you attempt to cast a spell using Bolas's Citadel, you must pay life equal to the spell's mana value instead of its mana cost. However, the rules are quite clear: you can only pay life if your life total is greater than or equal to the amount you need to pay. This is a fundamental restriction on paying life as a cost. \n\nNow, you might think that Platinum Angel, with its ability to prevent you from losing the game, would allow you to pay life even if it would reduce your life total to zero or below. But alas, this is a common misconception. Platinum Angel does not grant you the ability to pay life you do not have. It merely prevents you from losing the game due to having zero or less life. \n\nThe rules dictate that you cannot pay a cost unless you have the requisite resources. In this case, life is the resource, and if you do not have enough life to pay the cost, you cannot proceed with the payment. Platinum Angel's effect does not alter this fundamental rule.\n\n**The Ruling**: You cannot pay life to Bolas's Citadel if it would reduce your life total below zero, even with Platinum Angel on the battlefield. The payment is illegal because you do not have the necessary life to pay.\n\n**Sources**: \n- **Rule 119.4 (Life)**: If a cost or effect allows a player to pay an amount of life greater than 0, the player may do so only if their life total is greater than or equal to the amount of the payment.\n- **Rule 119.8 (Life)**: A cost that involves having a player pay life can’t be paid if the player cannot lose life."
  },
  {
    "id": 18,
    "question": "If I cast [[Treachery]] on an opponent's [[Eidolon of Blossoms]], do I draw a card? If so, what is the rule?",
    "accepted_answer": "Yes. You control the Eidolon as soon as Treachery enters. Then the Eidolon sees that another enchantment you control entered, and triggers. You'll draw a card. This is defined by Rule 611.3c, which establishes that continuous effects generated by a permanent apply simultaneously with its entry into the battlefield. Because the control change happens at the exact same moment Treachery lands, the game state sees you as the controller of the Eidolon in time for it to see the enchantment enter.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "By the Founders! The graveyard is not a revolving door... usually.\n\nWhen you cast **Treachery** on your opponent's **Eidolon of Blossoms**, you are engaging in a fascinating interaction involving control-changing effects and triggered abilities.\n\n**The Lecture**:\n- **Treachery** is an Aura that enchants a creature and changes control of that creature to you when it enters the battlefield. This control change is immediate and simultaneous with Treachery's entry.\n- The **Constellation** ability of **Eidolon of Blossoms** triggers whenever an enchantment enters the battlefield under your control. Since Treachery enters under your control, it triggers the Constellation ability.\n- According to the rules of control-changing effects, as soon as Treachery enters the battlefield, you gain control of the enchanted creature, in this case, the Eidolon of Blossoms. This means that when the game checks for triggers, you are the controller of the Eidolon.\n- Therefore, the Constellation ability of the Eidolon triggers for you, allowing you to draw a card.\n\n**The Ruling**: Yes, you draw a card. The control change from Treachery is immediate, and you control the Eidolon when its Constellation ability triggers.\n\n**Sources**: \n- **Rule 603.2 (Triggered Abilities)**: Explains how triggered abilities work.\n- **Rule 611.2a (Continuous Effects)**: Details how control-changing effects apply.\n- **Rule 704.5 (SBAs)**: State-Based Actions ensure the game state is checked for triggers after Treachery enters."
  },
  {
    "id": 43,
    "question": "If I control an [[Encroaching Mycosynth]], does [[Karn, the Great Creator]] -2 ability allow me to get a non-artifact card from my sideboard/outside the game?",
    "accepted_answer": "No, you cannot get non-artifact cards from your sideboard. This happens because static abilities on the battlefield (like Encroaching Mycosynth) only affect objects within the game's zones (Library, Hand, Graveyard, Exile, Stack, Command). The sideboard is considered \"outside the game,\" so the cards there remain unchanged. You can still only fetch cards that are naturally artifacts.",
    "difficulty": "hard",
    "category": "Zones, Objects & State-Based Actions",
    "owl_answer": "Squawk! A tangled web of layers. Let us untangle it.\n\nWhen you control an **Encroaching Mycosynth**, it indeed turns all nonland permanents you control into artifacts, and this effect extends to permanent spells you control and nonland permanent cards you own in other zones. However, the sideboard is a special case.\n\n**The Lecture**: \n   - **Encroaching Mycosynth** affects cards in zones like the battlefield, your hand, and your graveyard, but it does not extend its reach to the sideboard. The sideboard is considered a \"hidden zone\" outside the game, and effects that apply to cards in the game do not apply to cards outside the game unless explicitly stated.\n   - **Karn, the Great Creator**'s -2 ability allows you to fetch an artifact card from outside the game. However, since **Encroaching Mycosynth** does not affect the sideboard, it does not turn those cards into artifacts.\n   - Therefore, you cannot use Karn's ability to retrieve a non-artifact card from your sideboard, even if you control an Encroaching Mycosynth.\n\n**The Ruling**: You cannot use Karn's -2 ability to get a non-artifact card from your sideboard, even with Encroaching Mycosynth in play. The sideboard remains unaffected by Mycosynth's artifact-creating effect.\n\n**Sources**: \n   - **Rule 701.23j (Keyword Actions)**: Searching outside the game.\n   - **Rule 903.11 (Commander)**: Restrictions on bringing cards from outside the game.\n   - **Encroaching Mycosynth's Official Rulings**: Clarification on its effect scope."
  },
  {
    "id": 89,
    "question": "My opponent controls [[Voice of Victory]]. Can I cast an Instant spell during their turn just to get a Prowess trigger and have the spell countered?",
    "accepted_answer": "No, you cannot cast the spell at all. Voice of Victory creates a restriction that says opponents 'can't cast spells.' This prevents you from even beginning the process of casting. Since the spell is never cast, it never goes on the stack, and Prowess never triggers. The spell is not 'countered'; the action is simply illegal to perform.",
    "difficulty": "medium",
    "category": "The Stack, Timing & Priority",
    "owl_answer": "Read the text, boy! Read the text!\n\n**The Lecture**: \nThe card in question, **Voice of Victory**, states that \"Your opponents can't cast spells during your turn.\" This is a blanket prohibition that applies to all spells, including instants. The rules are quite clear: if an effect prohibits you from casting a spell, you simply cannot do so during the specified time frame. This means that during your opponent's turn, while they control **Voice of Victory**, you are entirely unable to cast any spells, instant or otherwise.\n\nNow, you might be thinking of some clever trickery to get around this, perhaps by attempting to cast an instant just to trigger Prowess. However, the rules do not allow for such shenanigans. The prohibition is absolute; you cannot even begin the process of casting a spell if it is disallowed by an effect like that of **Voice of Victory**. \n\n**The Ruling**: You cannot cast an instant spell during your opponent's turn if they control **Voice of Victory**. Therefore, you cannot trigger Prowess in this manner.\n\n**Sources**: \n- **Rule 601.3a (Casting Spells)**: Prohibitions on casting spells are absolute unless a choice during casting could change the prohibition.\n- **Rule 117.1a (Timing and Priority)**: Spells can only be cast when you have priority and no prohibitions apply."
  }
]